Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Unable to push changes. This is usually because the remote repository cannot be contacted
kk_kz: Өзгерістерді беру мүмкін емес. Әдетте бұл алыстағы қоймамен байланыс жасау мүмкін болмағандығын білдіреді

source: Bad course location provided
kk_kz: Оқу курсының орналасқан орнына сілтеме қате көрсетілген

source: Missing branch on fresh clone
kk_kz: Жаңа клонда тармақ жоқ

source: Command was: {0!r}. Working directory was: {1!r}
kk_kz: Мынадай команда берілді: {0!r}. мынадай жұмыс каталогы анықталды: {1!r}

source: Command output was: {0!r}
kk_kz: Команданы орындау нәтижесі: {0!r}

source: Directory already exists, doing a git reset and pull instead of git clone.
kk_kz: Каталог бар, clone орнына git reset және pull командалары орындалады

source: My Notes
kk_kz: Менің жазбаларым

source: Take the specified course and attempt to export it to a git repository . Course directory must already be a git repository. Usage: git_export <course_loc> <git_url>
kk_kz: Көрсетілген оқу курсын алу және оны git қоймасына экспорттау . Оқу курсы бар каталог git қоймасында болуы тиіс. Пайдалану: git_export <course_loc> <git_url>

source: Upload completed
kk_kz: Жүктеу аяқталды

source: Special characters not allowed in organization, course number, and course run.
kk_kz: Ұйымды, курс нөмірін және курстардың бағдарламаларын белгілеу үшін арнайы символдар пайдалану.

source: There is already a course defined with the same organization, course number, and course run. Please change either organization or course number to be unique.
kk_kz: Осындай Аты, Ұйымы, Бастау уақыты бар курс бар. Курстың аты, Курстың нөмірі алаптарының бірін өзгертіңіз.

source: Please change either the organization or course number so that it is unique.
kk_kz: Ұйымды немесе Курстың нөмірін өзгертіңіз. Олар бірегей болуы тиіс.

source: Unable to create course '{name}'. {err}
kk_kz: '{name}' курсын құру мүмкін емес. {err}

source: Course successfully exported to git repository
kk_kz: Оқу курсы git қоймасына ойдағыдай экспортталды

source: We only support uploading a .tar.gz file.
kk_kz: Тек қана .tar.gz файлдарын жүктеу мүмкін

source: File upload corrupted. Please try again
kk_kz: Файлды жүктеу кезінде қате. Қайта жүктеп көріңіз

source: Could not find the course.xml file in the package.
kk_kz: Пакет ішінде course.xml файлы табылмады.

source: Duplicate of {0}
kk_kz: Қайталау {0}

source: Duplicate of '{0}'
kk_kz: Қайталау '{0}'

source: Incoming video data is empty.
kk_kz: Бос кіріс бейнедеректері.

source: Can't find item by locator.
kk_kz: Көрсеткіш бойынша объектіні табу мүмкін болмады.

source: Transcripts are supported only for "video" modules.
kk_kz: Титрлар "бейне" модульдері үшін ғана қолданады.

source: Insufficient permissions
kk_kz: Ырқыңыз жеткіліксіз

source: Could not find user by email address '{email}'.
kk_kz: '{email}' электронды поштаға сәйкес қолданушы табылмады.

source: User {email} has registered but has not yet activated his/her account.
kk_kz: Пайдаланушы {email} тіркелген, бірақ өз аккаунтын әлі белсендендірген жоқ.

source: `role` is required
kk_kz: `role` талап етіледі

source: Only instructors may create other instructors
kk_kz: Тек нұсқаушылар басқа нұсқаушыларды құра алады

source: You may not remove the last instructor from a course
kk_kz: Сіз курстың жалғыз нұсқаушысын өшіре алмайсыз

source: unrequested
kk_kz: тіркелмеген

source: pending
kk_kz: орындалу үстінде

source: granted
kk_kz: рұқсат етілді

source: denied
kk_kz: рұқсатсыз

source: Studio user
kk_kz: Studio қолданушы

source: The date when state was last updated
kk_kz: Жай-күйді соңғы жаңарту

source: Current course creator state
kk_kz: Курсты құрушының ағымдағы жай-күйі

source: Optional notes about this user (for example, why course creation access was denied)
kk_kz: Пайдаланушы туралы қосымша жазбалар (мысалы, курсты құруға қол жеткізуден неге бас тартылды)

source: Page Not Found
kk_kz: Бет табылмады

source: Page not found
kk_kz: Бет табылмады

source: close
kk_kz: жабу

source: Loading...
kk_kz: Жүктелу өтуде...

source: View
kk_kz: Қарау

source: Error:
kk_kz: Қателік:

source: Course Number
kk_kz: Курс нөмірі

source: Cancel
kk_kz: Болдырмау

source: Organization:
kk_kz: Ұйым:

source: Course Number:
kk_kz: Курс нөмірі:

source: Pending
kk_kz: күтуде

source: Forgot password?
kk_kz: Парольды ұмыттыңыз ба?

source: Password
kk_kz: Пароль

source: Settings
kk_kz: Бапталымдар

source: Admin
kk_kz: Әкімші

source: Save
kk_kz: Сақтау

source: Sign Up
kk_kz: Тіркелу

source: Public Username
kk_kz: Пайдаланушының жария аты

source: Preferred Language
kk_kz: Тіл артықшылықтары

source: Thanks for activating your account.
kk_kz: Есептік жазбаны белсендендіргеніңіз үшін рахмет

source: This account has already been activated.
kk_kz: Бұл есептік жазба белсендендірілді

source: Visit your {link_start}dashboard{link_end} to see your courses.
kk_kz: Сіздің курстарыңызды көру үшін сіздің {link_start} жеке бөлмеңізге {link_end} кіріңіз

source: Terms of Service
kk_kz: Қызметтерді көрсету шарттары

source: Privacy Policy
kk_kz: Құпиялылық саясаты

source: Help
kk_kz: Көмек

source: Upgrade Your Registration for {} | Choose Your Track
kk_kz: {} тіркеу мәртебесін өзгерту | Курсты өту әдісін таңдау

source: Register for {} | Choose Your Track
kk_kz: {} ретінде тіркелу | Сіздің жолыңызды таңдау

source: Sorry, there was an error when trying to register you
kk_kz: Кешіріңіз, Сізді тіркеуге талпынған кезде қателік пайда болды

source: Select your track:
kk_kz: Сіздің жолыңызды таңдаңыз

source: Certificate of Achievement (ID Verified)
kk_kz: Жетістіктер сертификаты (құжат расталды)

source: Upgrade and work toward a verified Certificate of Achievement.
kk_kz: Тіркеу мәртебесін өзгерту және расталған Сертификатты алу үшін курсты өту

source: Sign up and work toward a verified Certificate of Achievement.
kk_kz: Алдағы расталған Жетістіктердің сертификаты үшін кіру және жұмыс істеу

source: Select your contribution for this course (min. $
kk_kz: Осы курс үшін Сіздің жарнаңызды таңдаңыз (min. $

source: Why do I have to pay?
kk_kz: Неліктен мен төлеуім керек?

source: As a not-for-profit, edX uses your contribution to support our mission to provide quality education to everyone around the world, and to improve learning through research. While we have established a minimum fee, we ask that you contribute as much as you can.
kk_kz: edX пайдаланушылары Сіздің жарнаңызды пайда ретінде емес, әлемдегі барлығы үшін сапалы білімді ұсынуда біздің міндетімізді қолдау үшін және зерттеу арқылы оқытуды жақсарту үшін пайдаланады. Біз ең аз сыйақыны орнатқан уақытта, Сіз қолдан келгеніңізше енгізе аласыз.

source: I'd like to pay more than the minimum. Is my contribution tax deductible?
kk_kz: Мен ең төменнен артық төлегім келеді. Оған салықтар салына ма?

source: Please check with your tax advisor to determine whether your contribution is tax deductible.
kk_kz: Сіздің салық қызметіңізде нақтылаңыз.

source: What if I can't afford it or don't have the necessary equipment?
kk_kz: Ал, егер мен ұсына аламасам немесе менде қажетті жабдық болмаса?

source: Select Honor Code Certificate
kk_kz: Құрмет сертификатын таңдау

source: Upgrade Your Registration
kk_kz: Тіркеу мәртебесін өзгерту

source: Select Certificate
kk_kz: Сертификатты таңдаңыз

source: Verified Registration Requirements
kk_kz: Расталған сертификатқа тіркелу талаптары

source: To upgrade your registration and work towards a Verified Certificate of Achievement, you will need a webcam, a credit or debit card, and an ID.
kk_kz: Өз тіркелу мәртебеңізді өзгерту және расталған Жетістіктер сертификатын алу мүмкіндігін іске асыру үшін, Сізге вебкамера, кредиттік немесе дебеттік карта және жеке куәлік құжаты қажет.

source: To register for a Verified Certificate of Achievement option, you will need a webcam, a credit or debit card, and an ID.
kk_kz: Расталған жетістіктер сертификатын алу үшін тіркелуге, Сізге вебкамера, кредиттік немесе дебеттік карта және жеке куәлік құжаты қажет.

source: What is an ID Verified Certificate?
kk_kz: Құжатпен расталған сертификат деген не?

source: An ID Verified Certificate requires proof of your identity through your photo and ID and is checked throughout the course to verify that it is you who earned the passing grade.
kk_kz: Құжатпен расталған сертификат Сіздің суретіңіздің және жеке куәлік құжатыңыздың көмегімен Сіздің тұлғаңызды растауды талап етеді, Сіз өту балына ие екеніңізді растау үшін олар курс бойы тексерілдеді.

source: Audit This Course
kk_kz: Осы курсты қарау

source: Sign up to audit this course for free and track your own progress.
kk_kz: Осы курсты ақысыз қарау және өз алға басуыңызды дербес бақылау үшін кіру

source: Select Audit
kk_kz: Тыңдаушы ретінде курсты өту

source: {platform_name}-wide Summary
kk_kz: {platform_name}-кеңейтілген қысқаша мазмұн

source: Instructions
kk_kz: Нұсқаулықтар

source: Collapse Instructions
kk_kz: Нұсқаулықтарды жиыру

source: Guided Discussion
kk_kz: Бақыланатын пікірталастар

source: Hide Annotations
kk_kz: Түсіндірмелерді жасыру

source: Vision
kk_kz: Бейнелеу

source: Faq
kk_kz: ЖҚС

source: Press
kk_kz: Баспасөз

source: Contact
kk_kz: Байланыстар

source: Class Feedback
kk_kz: Сабақ бойынша кері байланыс

source: We are always seeking feedback to improve our courses. If you are an enrolled student and have any questions, feedback, suggestions, or any other issues specific to a particular class, please post on the discussion forums of that&nbsp;class.
kk_kz: Біз курстарымызды жақсарту үшін кері байланыста әрқашан мүдделіміз. Егер сіз курсты тыңдаушы болсаңыз және сізде қандай да бір сұрақтар, тілектер, ұсыныстар немесе нақты курсқа жататын қандай да бір басқа проблемалар болса, сол туралы осы курстың форумында жазыңыз.

source: General Inquiries and Feedback
kk_kz: Жалпы мәселелер және кері байланыс

source: If you have a general question about {platform_name} please email {contact_email}. To see if your question has already been answered, visit our {faq_link_start}FAQ page{faq_link_end}. You can also join the discussion on our {fb_link_start}facebook page{fb_link_end}. Though we may not have a chance to respond to every email, we take all feedback into consideration.
kk_kz: Егер Сізде {platform_name} туралы жалпы сипаттағы мәселе туындаса, {contact_email} мекенжайына хабар жіберуіңізді өтінеміз. Сіздің сұрағыңызға бұдан бұрын жауап жарияланған болды ма екенін білу үшін, {faq_link_start}біздің {faq_link_end} ЖҰС бетіне кіріңіз. Сіз {fb_link_end} Facebook бетінде біздің {fb_link_start} пікірталасқа қатыса аласыз. Мүмкін біз барлық хабарларға жауап бере алмайтын шығармыз, бірақ біз барлық ұсыныстарды назарға аламыз.

source: Technical Inquiries and Feedback
kk_kz: Техникалық мәселелер және кері байланыс

source: If you have suggestions/feedback about the overall {platform_name} platform, or are facing general technical issues with the platform (e.g., issues with email addresses and passwords), you can reach us at {tech_email}. For technical questions, please make sure you are using a current version of Firefox or Chrome, and include browser and version in your e-mail, as well as screenshots or other pertinent details. If you find a bug or other issues, you can reach us at the following: {bugs_email}.
kk_kz: Егер Сізде жалпы {platform_name} тұғырының жұмысы туралы ұсыныстар/пікірлер болса, немесе егер Сізде жалпы техникалық проблемалар (мысалы, электрондық почта мекенжайларымен немесе парольдармен проблемалар) пайда болса, Сіз {tech_email} мекенжай бойынша бізбен байланыса аласыз. Егер Сізде техникалық сипаттағы мәселе пайда болса, Firefox немесе Chrome ең кейінгі қолжетімді нұсқасын пайдаланатыныңызға көз жеткізіңіз және өз браузеріңіздің атауын немесе нұсқасын хабарда көрсетіңіз, сондай-ақ экранның суреттерін немесе іске қатысты басқа егжей тегжейлерді қоса жалғаңыз. Егер Сіз жүйеде қателік тапсаңыз немесе қандай да бір басқа проблемалар болса, Сіз мынадай мекенжай бойынша бізбен байланыса аласыз: {bugs_email}.

source: Media
kk_kz: Медиафайлдар

source: Please visit our {link_start}media/press page{link_end} for more information. For any media or press inquiries, please email {email}.
kk_kz: Көбірек ақпарат алу үшін {link_end} баспасөздің біздің {link_start} бетіне кіріңіз. Медиа немесе баспасөзбен байланысты кез келген мәселелер үшін {email} жазыңыз.

source: Universities
kk_kz: Университеттер

source: If you are a university wishing to collaborate with or if you have questions about {platform_name}, please email {email}.
kk_kz: Егер сіз университет атынан болсаңыз және {platform_name} ынтымақтастықта мүдделі болсаңыз {email} жазыңыз.

source: New
kk_kz: Жаңа

source: Dashboard
kk_kz: Үстел

source: An error occurred. Please try again later.
kk_kz: Қателік шықты. Кейінірек тағы бір рет талпыныңыз.

source: Please verify your new email
kk_kz: Электрондық почтаның жаңа мекенжайын растаңыз.

source: edit
kk_kz: редакциялау

source: Reset Password
kk_kz: Парольді ауыстыру

source: Current Courses
kk_kz: Ағымдағы курстар

source: Looks like you haven't registered for any courses yet.
kk_kz: Барлығына қарағанда, сіз әлі бірде бір курсқа тіркелмедіңіз.

source: Find courses now!
kk_kz: Дәл қазір курстарды табу!

source: Looks like you haven't been enrolled in any courses yet.
kk_kz: Cіз курстардың ешбір тізіміне енгізілмеген сияқтысыз.

source: Course-loading errors
kk_kz: Курсты жүктеу кезінде қателіктер

source: Email Settings for {course_number}
kk_kz: {course_number} курс үшін e-mail бапталымдар

source: Receive course emails
kk_kz: Курс әкімшісінен таратуға жазылу

source: Save Settings
kk_kz: Бапталымдарды сақтау

source: Password Reset Email Sent
kk_kz: Парольді ысыру бойынша нұсқаулықтармен электрондық хат жіберілді

source: An email has been sent to {email}. Follow the link in the email to change your password.
kk_kz: Хат {email} жіберілді. Сіздің пароліңізді ауыстыру үшін осы хаттағы сілтемеге басыңыз.

source: Change Email
kk_kz: Электрондық почта мекенжайын ауыстыру

source: Please enter your new email address:
kk_kz: Сіздің электрондық почтаңыздың жаңа мекенжайын енгізіңіз.

source: Please confirm your password:
kk_kz: Сіздің пароліңізді растаңыз

source: We will send a confirmation to both {email} and your new email as part of the process.
kk_kz: Біз {email} және осы процестің барысында сіздің жаңа мекенжайыңызға растауды жібереміз.

source: Change your name
kk_kz: Сіздің атыңызды ауыстыру

source: To uphold the credibility of your {platform} {cert_name_short}, all name changes will be logged and recorded.
kk_kz: {platform} {cert_name_short} сенімділігін растау үшін атты ауыстырудың барлық фактілері тіркелген және сақталған болады.

source: Enter your desired full name, as it will appear on your {platform} {cert_name_short}:
kk_kz: Сіздің {platform} {cert_name_short} көрсетілетін өз толық атыңызды енгізіңіз:

source: Reason for name change:
kk_kz: Атты ауыстыру себебі:

source: Change My Name
kk_kz: Менің атымды ауыстыру

source: Unregister
kk_kz: Тіркеуді болдырмау

source: View Unit in Studio
kk_kz: Studio Блокты қарау

source: E-mail change failed
kk_kz: Электрондық почтаның мекенжайын ауыстыру мүмкін болады

source: We were unable to send a confirmation email to {email}
kk_kz: Бізге {email} растауды жіберу мүмкін болмады

source: Go back to the {link_start}home page{link_end}.
kk_kz: {link_end} үй бетінің {link_start} қайту

source: E-mail change successful!
kk_kz: Электрондық мекенжайды ауыстыру ойдағыдай өтті!

source: You should see your new email in your {link_start}dashboard{link_end}.
kk_kz: Енді сіздің электрондық почтаңыздың жаңа мекенжайы {link_end} үстелінің сіздің {link_start} пайда болуы тиіс

source: An account with the new e-mail address already exists.
kk_kz: Электрондық почтаның осындай мекенжайымен есептік жазба бар.

source: Student Enrollment Form
kk_kz: Студент ретінде курсқа жазылу үшін нысан

source: Course:
kk_kz: Курс:

source: Add new students
kk_kz: Жаңа студенттерді қосу

source: Existing students:
kk_kz: Бар студенттер:

source: New students added:
kk_kz: Жаңа студенттер қосылды:

source: Students rejected:
kk_kz: Рұқсат алмаған студенттер:

source: Debug:
kk_kz: Жөнге келтіру:

source: External Authentication failed
kk_kz: Сыртқы Авторландыру қателігі

source: Due:
kk_kz: Мерзім

source: Status:
kk_kz: Мәртебе:

source: You have successfully gotten to level {goal_level}.
kk_kz: Сіз {goal_level} деңгейіне ойдағыдай жеттіңіз

source: You have not yet gotten to level {goal_level}.
kk_kz: Сіз {goal_level} деңгейіне әлі жетпедіңіз

source: Completed puzzles
kk_kz: Аяқталған жұмбақтар

source: Level
kk_kz: Деңгей

source: Submitted
kk_kz: Қарастырылуға жіберілген

source: Puzzle Leaderboard
kk_kz: Жұмбақтардың рейтингтік кестесі

source: User
kk_kz: Пайдаланушы

source: About
kk_kz: Біз туралы

source: Jobs
kk_kz: Бос орындар

source: FAQ
kk_kz: ЖҚС

source: {platform_name} Logo
kk_kz: {platform_name} айдарбелгісі

source: {platform_name} is a non-profit created by founding partners {Harvard} and {MIT} whose mission is to bring the best of higher education to students of all ages anywhere in the world, wherever there is Internet access. {platform_name}'s free online MOOCs are interactive and subjects include computer science, public health, and artificial intelligence.
kk_kz: {platform_name} — {Harvard} және {MIT} серіктестігінің арқасында құрылған коммерциялық емес тұғыр. Оның міндеті Интернетке қолжетімділігі бар бүкіл әлем бойынша барлық жастағы студенттерге ең жақсы жоғары білімге қолжеткізуді ұсыну болып табылады. {platform_name} ақысыз онлайн курстары интерактивті және computer science, денсаулық сақтау және жасанды интеллектті қосқанда нысандардың қатарын қамтиды.

source: &copy; 2014 {platform_name}, some rights reserved.
kk_kz: &copy; 2014 {platform_name}, кейбір құқықтар қорғалған.

source: Terms of Service and Honor Code
kk_kz: Қызметтерді ұсыну шарттары және ар-намыс кодексі

source: Password Reset
kk_kz: Парольді ысыру

source: Please enter your e-mail address below, and we will e-mail instructions for setting a new password.
kk_kz: Өзіңіздің электрондық почтаңыздың мекенжайын төмендегі алапқа енгізіңіз және біз сізге парольді ысыру жөніндегі нұсқаулықты жібереміз

source: Your E-mail Address
kk_kz: Сіздің электрондық почтаңыздың мекенжайы

source: This is the e-mail address you used to register with {platform}
kk_kz: Бұл e-mail мекенжайы, оның көмегімен сіз {platform} тілкелдіңіз

source: Reset My Password
kk_kz: Менің паролімді ысыру

source: Email is incorrect.
kk_kz: Электрондық почтаның мекенжайы дұрыс енгізілмеді

source: {platform_name} Help
kk_kz: {platform_name} көмегі

source: For <strong>questions on course lectures, homework, tools, or materials for this course</strong>, post in the {link_start}course discussion forum{link_end}.
kk_kz: Егер сізде курс лекциялары, үй тапсырмалары, </strong> осы курс бойынша құралдар немесе материалдар туралы <strong> сұрақтар болса, {link_end} курсты талқылау үшін {link_start} форумында осы туралы жазыңыз.

source: Have <strong>general questions about {platform_name}</strong>? You can find lots of helpful information in the {platform_name} {link_start}FAQ{link_end}.
kk_kz: {platform_name}</strong> туралы <strong> жалпы сұрақтар пайда болды ма? Сіз {link_end} FAQ {platform_name} {link_start} ең көп пайдалы ақпаратты таба аласыз

source: Have a <strong>question about something specific</strong>? You can contact the {platform_name} general support team directly:
kk_kz: </strong> нақты бір нәрсе туралы <strong> сұрақтары бар ма? Олай болса сіз тікелей {platform_name} қолдауымен байланыса аласыз.

source: Report a problem
kk_kz: Проблема туралы хабарлау

source: Make a suggestion
kk_kz: Ұсынысты енгізу

source: Ask a question
kk_kz: Сұрақ қою

source: Please note: The {platform_name} support team is English speaking. While we will do our best to address your inquiry in any language, our responses will be in English.
kk_kz: Назарға алуыңызды өтінеміз: {platform_name} қолдау командасының тілі – ағылшын. Біз сұраныс тілінен тәуелсіз Сізге көмек көрсету үшін әлімізде келгеннің бәрін істейміз, бірақ сұраныстарға біз ағылшын тілінде жауап береміз.

source: E-mail
kk_kz: Электрондық почта

source: Briefly describe your issue
kk_kz: Проблеманы қысқаша сипаттаңыз

source: Tell us the details
kk_kz: Бізге егжей-тегжейлерді хабарлаңыз

source: Include error messages, steps which lead to the issue, etc
kk_kz: Қателіктер туралы хабарда осы проблемаға келтірген қадамдарды еске салыңыз

source: Submit
kk_kz: Жіберу

source: Thank You!
kk_kz: Рахмет!

source: Thank you for your inquiry or feedback. We typically respond to a request within one business day (Monday to Friday, {open_time} UTC to {close_time} UTC.) In the meantime, please review our {link_start}detailed FAQs{link_end} where most questions have already been answered.
kk_kz: Сіздің сұрағыңызға немесе ұсынысыңызға рахмет. Біз бір жұмыс күні ішінде (дүйсенбіден бастап жұманы қоса алғанда, {open_time} UTC бастап {close_time} UTC қоса алғанда) жауап береміз. Сіз {link_end} егжей тегжейлі FAQs біздің {link_start} оқи аласыз, мұнда көптеген сұрақтарға жауаптар бар.

source: problem
kk_kz: проблема

source: Report a Problem
kk_kz: Проблема туралы хабарлау

source: Brief description of the problem
kk_kz: Проблеманың қысқаша сипаттамасы

source: Details of the problem you are encountering
kk_kz: Сізге тап болған проблеманы егжей-тегжейлі сипаттау

source: Include error messages, steps which lead to the issue, etc.
kk_kz: Олардың әрекеттері проблемаға және т.б. әкеліп соққан қателік туралы хабардың мәтінін қосыңыз

source: suggestion
kk_kz: ұсыныс

source: Make a Suggestion
kk_kz: Ұсыныс енгізу

source: Brief description of your suggestion
kk_kz: Сіздің ұсынысыңыздың қысқаша сипаттамасы

source: Details
kk_kz: Егжей-тегжейлер

source: question
kk_kz: сұрақ

source: Ask a Question
kk_kz: Сұрақ қою

source: Brief summary of your question
kk_kz: Сіздің сұрағыңыздың қысқаша сипаттамасы

source: An error has occurred.
kk_kz: Қателік пайда болды.

source: Please {link_start}send us e-mail{link_end}.
kk_kz: {link_start} бізге {link_end} хатын жіберуді өтінеміз.

source: Please try again later.
kk_kz: Кейін тағы да талпынуыңызды өтінеміз

source: Free courses from <strong>{university_name}</strong>
kk_kz: <strong>{university_name}</strong> ақысыз курстар

source: The Future of Online Education
kk_kz: Келешектегі онлайн-білім

source: For anyone, anywhere, anytime
kk_kz: Балығы үшін, барлық жерде, әрқашан

source: Stay up to date with all {platform_name} has to offer!
kk_kz: {platform_name} ұсына алатын барлық жағдайдан хабардар болыңыз!

source: Invalid email change key
kk_kz: Электрондық почтаны ауыстырудың дұрыс емес кілті

source: This e-mail key is not valid. Please check:
kk_kz: Электрондық почтаның осы кілті жарамсыз. Тексеруді өтінеміз:

source: Was this key already used? Check whether the e-mail change has already happened.
kk_kz: Осы кілт бұдан бұрын пайдаланылмады ма? Сіз электрондық почтаның мекенжайын ауыстырмадыңыз ба екеніне көз жеткізіңіз.

source: Did your e-mail client break the URL into two lines?
kk_kz: Сіздің почта клиентіңіз сілтемені екі бөлікке бөліп тастамады ма?

source: The keys are valid for a limited amount of time. Has the key expired?
kk_kz: Кілттер шектеулі уақытта қолданылады. Сіздің кілтіңіздің қолданылу мерзімі өтпеді ме?

source: Helpful Information
kk_kz: Пайдалы ақпарат

source: Login via OpenID
kk_kz: OpenID көмегімен кіру

source: You can now start learning with {platform_name} by logging in with your <a rel="external" href="http://openid.net/">OpenID account</a>.
kk_kz: Енді сіз өзіңіздің сыртқы <a rel="external" href="http://openid.net/">OpenID account</a> пайдаланып {platform name} курстарын оқи аласыз

source: Not Enrolled?
kk_kz: Курсқа тіркелмедіңіз бе?
