Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Open Ended Panel
kk_kz: Панельдің құрамын ашу

source: Discussion
kk_kz: Талқылау

source: Problem
kk_kz: Тапсырма

source: Advanced
kk_kz: Кеңейтілген

source: Honor Code Certificate
kk_kz: Ар-намыс кодексінің сертификаты

source: Enrollment is closed
kk_kz: Тіркеу жабық

source: Enrollment mode not supported
kk_kz: Курсқа жазылу режимі қолдау таппайды

source: Invalid amount selected.
kk_kz: Қате сома таңдалды.

source: No selected price or selected price is too low.
kk_kz: Баға таңдалмады немесе таңдалған баға өте төмен.

source: Administrator
kk_kz: Әкімші

source: Moderator
kk_kz: Модератор

source: Community TA
kk_kz: Қоғамдастықтың техникалық ассистенті

source: Student
kk_kz: Студент

source: Your account has been disabled. If you believe this was done in error, please contact us at {link_start}{support_email}{link_end}
kk_kz: Сіздің есептік жазбаңыз бұғатталған. Егер Сіз қате орын алды деп ойласаңыз, бізбен мынадай мекенжай бойынша хабарласыңызшы {link_start}{support_email}{link_end}

source: Disabled Account
kk_kz: Есептік жазба бұғатталды

source: Male
kk_kz: Еркек

source: Female
kk_kz: Әйел

source: Other
kk_kz: Басқа

source: Doctorate
kk_kz: Докторлық дәреже

source: Master's or professional degree
kk_kz: Магистратура немесе специалитет

source: Bachelor's degree
kk_kz: Бакалавриат

source: Associate's degree
kk_kz: Аяқталмаған жоғары білім

source: Secondary/high school
kk_kz: Орташа/Толық орташа

source: Junior secondary/junior high/middle school
kk_kz: Аяқталмаған орташа/жоғарғы сыныптар/орташа сыныптар

source: Elementary/primary school
kk_kz: Бастауыш

source: None
kk_kz: Жоқ

source: Course id not specified
kk_kz: Курс сәйкестендіргіші көрсетілмеген

source: Course id is invalid
kk_kz: Курстың рұқсат етілмеген сәйкестендіргіші

source: You are not enrolled in this course
kk_kz: Сіз осы курсқа тіркелмегенсіз

source: Enrollment action is invalid
kk_kz: Тіркеу қол жетімсіз

source: There was an error receiving your login information. Please email us.
kk_kz: Тіркеу ақпаратын алу қатесі орын алды. Бізге жазыңыз.

source: This account has been temporarily locked due to excessive login failures. Try again later.
kk_kz: Осы есептік жазба жүйеге көптеген сәтсіз кіру әрекеттеріне байланысты уақытша бұғатталды. Кейінірек әрекет етіп көріңіз.

source: Too many failed login attempts. Try again later.
kk_kz: Сәтсәз кіру әрекеттері тым көп. Кейінірек әрекет етіңіз

source: This account has not been activated. We have sent another activation message. Please check your e-mail for the activation instructions.
kk_kz: Осы аккаунт белсендендірілмеген. Біз сізге басқа белсендендіру хатын жолдадық. Өз электрондық почтаңызды тексеріңізші.

source: Please enter a username
kk_kz: Қолданушы атын енгізіңіз

source: Please choose an option
kk_kz: Опцияны таңдаңыз

source: User with username {} does not exist
kk_kz: Аты {} пайдаланушы жоқ

source: Successfully disabled {}'s account
kk_kz: {} пайдаланушының есептік жазбасы ойдағыдай бұғатталды

source: Successfully reenabled {}'s account
kk_kz: {} пайдаланушының есептік жазбасы ойдағыдай бұғаттаудан шығарылды

source: Unexpected account status
kk_kz: Есептік жазбаның күтпеген мәртебесі

source: An account with the Public Username '{username}' already exists.
kk_kz: Жария аты '{username}' аккаунт жоқ.

source: An account with the Email '{email}' already exists.
kk_kz: Электрондық мекенжайы '{email}' есептік жазба бар.

source: Error (401 {field}). E-mail us.
kk_kz: (401 {field}) қатесі. Бізге жазыңыз.

source: To enroll, you must follow the honor code.
kk_kz: Тіркелу үшін сіз Ар-намыс кодексін ұстануыңыз қажет.

source: You must accept the terms of service.
kk_kz: Сіз қызметтер көрсету шарттарын қабылдауыңыз тиіс.

source: Username must be minimum of two characters long
kk_kz: Пайдаланушының аты кемінде екі белгіден тұруы тиіс

source: A properly formatted e-mail is required
kk_kz: Белгіленген нысандағы электрондық мекенжай талап етіледі

source: Your legal name must be a minimum of two characters long
kk_kz: Сіздің құжаттар бойынша атыңыз кемінде екі белгіден тұруы тиіс

source: A valid password is required
kk_kz: Жарамды пароль талап етіледі

source: Accepting Terms of Service is required
kk_kz: Қызметтер Көрсету Шарттарын қабылдау қажет

source: Agreeing to the Honor Code is required
kk_kz: Ар-намыс кодексін ұстануға келісім – міндетті толтыруға арналған алап

source: A level of education is required
kk_kz: Білім деңгейі – міндетті толтыруға арналған алап

source: Your gender is required
kk_kz: Сіздің жынысыңыз – міндетті толтыруға арналған алап

source: Your year of birth is required
kk_kz: Сіздің туған жылыңыз – міндетті толтыруға арналған алап

source: Your mailing address is required
kk_kz: Сіздің почталық мекенжайыңыз – міндетті толтыруға арналған алап

source: A description of your goals is required
kk_kz: Сіздің мақсаттарыңыздың сипаттамасы – міндетті толтыруға арналған алап

source: A city is required
kk_kz: Қала – міндетті толтыруға арналған алап

source: A country is required
kk_kz: Ел – міндетті толтыруға арналған алап

source: Username cannot be more than {0} characters long
kk_kz: Пайдаланушының аты {0} артық белгіден тұрмауы керек

source: Email cannot be more than {0} characters long
kk_kz: Электрондық мекенжай {0} артық белгіден тұрмауы керек

source: Valid e-mail is required.
kk_kz: Жарамды электрондық почта мекенжайы талап етіледі.

source: Username should only consist of A-Z and 0-9, with no spaces.
kk_kz: Пайдаланушының аты A-Z дейінгі әріптерді және 0-9 дейінгі цифрларды ғана, бос орынсыз, қамтуы тиіс

source: Password:
kk_kz: Пароль:

source: Could not send activation e-mail.
kk_kz: Есептік жазбаны белсендендіруге арналған хатты жолдау мүмкін болмады.

source: Unknown error. Please e-mail us to let us know how it happened.
kk_kz: Белгісіз қате. Бізге хабарласыңыз, бұның қалай болғанын білдіріңіз.

source: Password reset unsuccessful
kk_kz: Парольді шығарып тастау мүмкін болмады

source: No inactive user with this e-mail exists
kk_kz: Осындай электрондық мекенжайы бар белсенді емес пайдаланушылар жоқ.

source: Unable to send reactivation email
kk_kz: Қайта белсендендіру хатын жолдау мүмкін болмады

source: Invalid password
kk_kz: Қате пароль

source: Valid e-mail address required.
kk_kz: Жарамды электрондық почта мекенжайы талап етіледі.

source: An account with this e-mail already exists.
kk_kz: Осындай электрондық почта мекенжайы бар аккаунт бар.

source: Old email is the same as the new email.
kk_kz: Электрондық почтаның бұрынғы және жаңа мекенжайлары дәл келеді.

source: Name required
kk_kz: Аты талап етіледі

source: Invalid ID
kk_kz: Қате ID

source: LONG_DATE_FORMAT
kk_kz: %d %m %Y

source: DATE_TIME_FORMAT
kk_kz: %d %m %Y %H:%M

source: SHORT_DATE_FORMAT
kk_kz: %d %m %Y

source: TIME_FORMAT
kk_kz: %H:%M:%S

# weekday name
source: Monday
kk_kz: Дүйсенбі

# weekday name
source: Tuesday
kk_kz: Сейсенбі

# weekday name
source: Wednesday
kk_kz: Сәрсенбі

# weekday name
source: Thursday
kk_kz: Бейсенбі

# weekday name
source: Friday
kk_kz: Жұма

# weekday name
source: Saturday
kk_kz: Сенбі

# weekday name
source: Sunday
kk_kz: Жексенбі

# abbreviated weekday name
source: Mon
kk_kz: Дс

# abbreviated weekday name
source: Tue
kk_kz: Сс

# abbreviated weekday name
source: Wed
kk_kz: Ср

# abbreviated weekday name
source: Thu
kk_kz: Бс

# abbreviated weekday name
source: Fri
kk_kz: Жм

# abbreviated weekday name
source: Sat
kk_kz: Сн

# abbreviated weekday name
source: Sun
kk_kz: Жс

# abbreviated month name
source: Jan
kk_kz: қаң

# abbreviated month name
source: Feb
kk_kz: ақпа.

# abbreviated month name
source: Mar
kk_kz: наурыз

# abbreviated month name
source: Apr
kk_kz: сәу

# abbreviated month name
source: May
kk_kz: мамыр

# abbreviated month name
source: Jun
kk_kz: маусым

# abbreviated month name
source: Jul
kk_kz: шілде

# abbreviated month name
source: Aug
kk_kz: там

# abbreviated month name
source: Sep
kk_kz: қырқ

# abbreviated month name
source: Oct
kk_kz: қаз.

# abbreviated month name
source: Nov
kk_kz: қара.

# abbreviated month name
source: Dec
kk_kz: желт.

# month name
source: January
kk_kz: қаңтар

# month name
source: February
kk_kz: ақпан

# month name
source: March
kk_kz: наурыз

# month name
source: April
kk_kz: сәуір

# month name
source: May
kk_kz: мамыр

# month name
source: June
kk_kz: маусым

# month name
source: July
kk_kz: шілде

# month name
source: August
kk_kz: тамыз

# month name
source: September
kk_kz: қыркүйек

# month name
source: October
kk_kz: қазан

# month name
source: November
kk_kz: қараша

# month name
source: December
kk_kz: желтоқсан

source: Invalid Length ({0})
kk_kz: Рұқсат етілмеген ұзындық ({0})

source: must be {0} characters or more
kk_kz: {0} немесе одан артық белгіден тұруы тиіс

source: must be {0} characters or less
kk_kz: {0} немесе одан кем белгіден тұруы тиіс

source: Must be more complex ({0})
kk_kz: Анағұрлым күрделі болуы тиіс ({0})

source: must contain {0} or more uppercase characters
kk_kz: Жоғарғы регистрдің{0} немесе одан артық белгісінен тұруы тиіс

source: must contain {0} or more lowercase characters
kk_kz: Төменгі регистрдің{0} немесе одан артық белгісінен тұруы тиіс

source: must contain {0} or more digits
kk_kz: {0} немесе одан артық цифрлардан тұруы тиіс

source: must contain {0} or more punctuation characters
kk_kz: {0} немесе одан артық тыныс белгілерінен тұруы тиіс

source: must contain {0} or more non ascii characters
kk_kz: ascii кірмейтін {0} немесе одан артық белгілерді қамтуы тиіс

source: must contain {0} or more unique words
kk_kz: {0} немесе одан артық қайталанбайтын сөздерді қамтуы тиіс

source: Too similar to a restricted dictionary word.
kk_kz: Жалпы қолданымдағы сөзге өте ұқсайды.

source: Cannot rescore problems with possible file submissions
kk_kz: Жіберіліп қойылуы мүмкін файлдары бар тапсырманы қайта бағалай алмаймын

source: correct
kk_kz: дұрыс

source: incorrect
kk_kz: қате

source: incomplete
kk_kz: аяқталмаған

source: unanswered
kk_kz: жауап жоқ

source: processing
kk_kz: орындалу үстінде

source: Your answer has been submitted. As soon as your submission is graded, this message will be replaced with the grader's feedback.
kk_kz: Сіздің жауап қабылданды. Ол бағаланған бойдан осы хабардың орнына Сіздің бағаңыз пайда болады.

source: Submitted. As soon as a response is returned, this message will be replaced by that feedback.
kk_kz: Қабылданды. Жауап алынған бойдан осы хабардың орнына жауаптың мазмұны пайда болады.

source: No response from Xqueue within {xqueue_timeout} seconds. Aborted.
kk_kz: Xqueue-ден {xqueue_timeout} секунд жауап жоқ. Кері қайтарылды.

source: Error {err} in evaluating hint function {hintfn}.
kk_kz: {hintfn} еске түсіру функциясын бағалаудағы {err} қатесі.

source: (Source code line unavailable)
kk_kz: (Бастапқы код жолы қол жетімді емес)

source: See XML source line {sourcenum}.
kk_kz: XML {sourcenum} бастапқы жолын көрсету.

source: Do not use shuffle and answer-pool at the same time
kk_kz: shuffle және answer-pool бір уақытта пайдаланбаңыз

source: answer-pool value should be an integer
kk_kz: answer-pool мәні бүтін сан болу тиіс

source: Choicegroup must include at least 1 correct and 1 incorrect choice
kk_kz: Choicegroup ең болмағанда 1 дұрыс және 1 қате таңдауды қамту тиіс

source: There was a problem with the staff answer to this problem.
kk_kz: Осы тапсырмаға қызметкерлердің жауабы бар проблема анықталды

source: Could not interpret '{student_answer}' as a number.
kk_kz: '{student_answer}' сандық мәнін анықтау мүмкін болмады.

source: You may not use variables ({bad_variables}) in numerical problems.
kk_kz: Сандық есептерде ({bad_variables}) айнымалыларын пайдалануға рұқсат етілмейді.

source: factorial function evaluated outside its domain:'{student_answer}'
kk_kz: факториалдың мәні оның анықталу облысынан тыс орналасқан: '{student_answer}'

source: Invalid math syntax: '{student_answer}'
kk_kz: Рұқсат етілмеген математикалық белгі:'{student_answer}'

source: You may not use complex numbers in range tolerance problems
kk_kz: Сіз тапсырманың рұқсат етілген мәндері ауқымында комплексті сандарды пайдалана алмайсыз

source: There was a problem with the staff answer to this problem: complex boundary.
kk_kz: Курс қызметкерлерінің осы тапсырмаға жауабы бар проблема анықталды: жиынтықтың шекарасы.

source: There was a problem with the staff answer to this problem: empty boundary.
kk_kz: Курс қызметкерлерінің осы тапсырмаға жауабы бар проблема анықталды: бос шекара.

source: error
kk_kz: қате

source: error getting student answer from {student_answers}
kk_kz: {student_answers}-дан оқушы жауабын алғанда қате

source: No answer entered!
kk_kz: Жауап енгізілмеді!

source: CustomResponse: check function returned an invalid dictionary!
kk_kz: Пікір: тексеру функциясы сөздіктің қате мәнін қайтарды

source: An error occurred with SymbolicResponse. The error was: {error_msg}
kk_kz: SymbolicResponse-те қате пайда болды. Мындай қате: {error_msg}

source: No answer provided.
kk_kz: Жауап берілмеді.

source: Unable to deliver your submission to grader (Reason: {error_msg}). Please try again later.
kk_kz: Сіздің бағаға жауабыңызды тапсыру мүмкін болмады (Себеп: {error_msg}). Кейінірек қайталап көріңіз.

source: Invalid grader reply. Please contact the course staff.
kk_kz: Жауап алу мүмкін емес. Курс үшін жауаптылармен хабарласыңыз.

source: Invalid input: {bad_input} not permitted in answer.
kk_kz: Қате енгізу: {bad_input} жауап бола алмайды.

source: factorial function not permitted in answer for this problem. Provided answer was: {bad_input}
kk_kz: Осы тапсырмаға жауапта факториалды пайдалануға рұқсат етілмейді. Сіз берген жауап: {bad_input}

source: Invalid input: Could not parse '{bad_input}' as a formula.
kk_kz: Қате енгізу: '{bad_input}' формула ретінде белгілеу мүмкін емес.

source: Invalid input: Could not parse '{bad_input}' as a formula
kk_kz: Қате енгізу: '{bad_input}' формула ретінде белгілеу мүмкін емес.

source: Error in evaluating SchematicResponse. The error was: {error_msg}
kk_kz: Пікірді бағалаудағы қате. Мынай қате болып табылады: {error_msg}

source: The Staff answer could not be interpreted as a number.
kk_kz: Қызметкердің жауабы сан ретінде қабылдана алмайды.

source: Could not interpret '{given_answer}' as a number.
kk_kz: '{given_answer}' сандық мәнін анықтау мүмкін болмады.

source: XML data for the annotation
kk_kz: Аңдатпа үшін XML мәліметтер

source: Display Name
kk_kz: Атын көрсету

source: Display name for this module
kk_kz: Осы модульдің атын көрсету

source: This name appears in the horizontal navigation at the top of the page.
kk_kz: Бұл есім беттің жоғарғы жағында жатық навигациясында көрінеді

source: Show Answer
kk_kz: Жауапты көрсету

source: Check
kk_kz: Тексеру

source: Final Check
kk_kz: Қорытынды тексеру

source: Checking...
kk_kz: Тексеру...

source: Warning: The problem has been reset to its initial state!
kk_kz: Назар аударыңыз: Тапсырма бастапқы жай-күйге шығарып тасталды!

source: The problem's state was corrupted by an invalid submission. The submission consisted of:
kk_kz: Тапсырма жарамсыз өтінімге байланысты зақымдалған болатын. Тапсырма мыналардан тұратын:

source: If this error persists, please contact the course staff.
kk_kz: Егер қате туралы осы хабар пайда бола берсе, курстың қызметкерлерімен хабарласыңыз.

source: Problem is closed.
kk_kz: Тапсырманы тапсыру мерзімі өтіп кетті.

source: Problem must be reset before it can be checked again.
kk_kz: Тапсырма тағы да бір рет тексерілместен бұрын шығарып тасталуы тиіс.

source: You must wait at least {wait} seconds between submissions.
kk_kz: Әрекеттер арасында ең болмағанда {wait} секунд күтіңіз.

source: You must wait at least {wait_secs} between submissions. {remaining_secs} remaining.
kk_kz: Әрекеттер арасында ең болмағанда {wait_secs} секунд күтіңіз. {remaining_secs}қалды.

source: Error: {msg}
kk_kz: Қате: {msg}

source: {num_hour} hour
kk_kz: {num_hour} сағат

source: {num_minute} minute
kk_kz: {num_minute} минут

source: {num_second} second
kk_kz: {num_second} секунд

source: Problem's definition does not support rescoring.
kk_kz: Тапсырманың шарттары оны қайта бағалауға мүмкіндік бермейді.

source: Problem must be answered before it can be graded again.
kk_kz: Тапсырма қайта бағаланғанға дейін оған жауап берілуі тиіс.

source: Problem needs to be reset prior to save.
kk_kz: Тапсырманы сақтамастан бұрын шығарып тастау керек.

source: Your answers have been saved.
kk_kz: Сіздің жауаптарыңыз сақталды.

source: Your answers have been saved but not graded. Click 'Check' to grade them.
kk_kz: Сіздің жауаптарыңыз сақталды, бірақ бағаланған жоқ. Бағаны алу үшін 'Тексеру'-ді басыңыз.

source: Refresh the page and make an attempt before resetting.
kk_kz: Бетті жаңартыңыз және шығарып тастаудың алдында әрекет етіңіз.

source: We're sorry, there was an error with processing your request. Please try reloading your page and trying again.
kk_kz: Өкінішке орай Сіздің сауалды өңдеу кезінде қате орын алды. Бетті қайта жүктеңіз және тағы да әрекет етіп көріңіз.

source: The state of this problem has changed since you loaded this page. Please refresh your page.
kk_kz: Сіз бетті жүктегеннен кейін осы тапсырманың мәртебесі өзгерді. Бетті қайта жүктеңіз.

source: Graded
kk_kz: Бағаланды

source: General
kk_kz: Жалпы

source: TBD
kk_kz: Белгіленбеген күн

source: Editor
kk_kz: Редактор

source: Could not parse custom parameter: {custom_parameter}. Should be "x=y" string.
kk_kz: Арнайы параметрді тану мүмкін болмады:{custom_parameter}. "x=y" жолды пайдалану ұсынылады.

source: Could not parse LTI passport: {lti_passport}. Should be "id:key:secret" string.
kk_kz: LTI кілтін тану мүмкін болмады:{lti_passport}. "id:key:secret" жолды пайдалану ұсынылады.

source: Error
kk_kz: Қателік

source: Course Info
kk_kz: Курс туралы ақпарат

source: Wiki
kk_kz: Вики

source: Textbooks
kk_kz: Оқулықтар

source: Peer grading
kk_kz: Өзара бағалауларды қарау

source: Syllabus
kk_kz: Оқыту бағдарламасы

source: Instructor
kk_kz: Оқытушы

source: Self
kk_kz: Өз-өзін бағалау

source: Peer
kk_kz: Өзара бағалау

source: Not started.
kk_kz: Әлі бағаланбады.

source: Being scored.
kk_kz: Бағалау барысында.

source: Scoring finished.
kk_kz: Бағалау аяқталды.

source: Complete.
kk_kz: Орындалды.

source: Scored rubric
kk_kz: Бағаланған айдарлар.

source: You have attempted this question {number_of_student_attempts} times. You are only allowed to attempt it {max_number_of_attempts} times.
kk_kz: Сіз осы сұраққа жауап беру үшін {number_of_student_attempts} әрекет жасадыңыз. Сізге барлығы {max_number_of_attempts} әрекет жасауға рұқсат етілген.

source: The problem state got out-of-sync. Please try reloading the page.
kk_kz: Тапсырма мәртебесін синхрондау бұзылған. Бетті қайта жүктеуге әрекет жасаңыз.

source: Self-Assessment
kk_kz: Өз-өзін бағалау

source: Peer-Assessment
kk_kz: Қатысушылардың бағалауы

source: Instructor-Assessment
kk_kz: Нұсқаушының бағалауы

source: AI-Assessment
kk_kz: AI бағалауы

source: Could not find needed tag {tag_name} in the survey responses. Please try submitting again.
kk_kz: Сауалнама сұрақтарына берілген жауаптарда қажетті тегті {tag_name} табу мүмкін болмады. Тағы бір әрекет жасаңыз.

source: There was an error saving your feedback. Please contact course staff.
kk_kz: Сіздің пікіріңізді сақтау кезінде қате орын алды. Курстың қызметкерлерімен хабарласыңыз.

source: Couldn't submit feedback.
kk_kz: Пікірді жөнелту мүмкін болмады.

source: Successfully saved your feedback.
kk_kz: Сіздің пікіріңіз ойдағыдай сақталды.

source: Unable to save your feedback. Please try again later.
kk_kz: Сіздің пікіріңізді сақтау мүмкін болмады. Әрекетті кейінірек қайталап көріңіз.

source: Successfully saved your submission.
kk_kz: Сіздің жауабыңыз ойдағыдай сақталды.

source: Unable to submit your submission to the grader. Please try again later.
kk_kz: Сіздің жауабыңызды бағалауға тапсыру мүмкін болмады. Әрекетті кейінірек қайталап көріңіз.

source: Error getting feedback from grader.
kk_kz: Бағалаушыдан жауап алу қатесі.

source: No feedback available from grader.
kk_kz: Бағалаушыдан қол жетімді жауаптар жоқ.

source: Error handling action. Please try again.
kk_kz: Команданы орындау кезіндегі қате. Тағы да әрекет етіп көріңіз.

source: Your response has been submitted. Please check back later for your grade.
kk_kz: Сіздің жауабыңыз қабылданды. Өз бағаңызды білу үшін осы бетке кейінірек оралыңыз.

source: Not started
kk_kz: Әлі бағаланған жоқ

source: In progress
kk_kz: Барысында

source: Done
kk_kz: Аяқталды

source: We could not find a file in your submission. Please try choosing a file or pasting a URL to your file into the answer box.
kk_kz: Сіздің өтінімде қоса тіркелген файл жоқ. Өз компьютеріңізде файлды таңдаңыз немесе жауапқа арналған алапта сілтемені кірістіріңіз.

source: We are having trouble saving your file. Please try another file or paste a URL to your file into the answer box.
kk_kz: Біз сіздің файлды сақтай алмаймыз. Басқа файлды көрсетіңіз немесе жауапқа арналған алапта сілтемені кірістіріңіз.

source: Error saving your score. Please notify course staff.
kk_kz: Сіздің бағаны сақтау кезіндегі қате. Курстың қызметкерлеріне хабарлаңыз.

source: Can't receive transcripts from Youtube for {youtube_id}. Status code: {status_code}.
kk_kz: Youtube сервисінен {youtube_id} үшін субтитрлер алу мүмкін емес. {status_code}.

source: We support only SubRip (*.srt) transcripts format.
kk_kz: SubRip (*.srt) субтитрлерінің форматы ғана қолдау табады.

source: Something wrong with SubRip transcripts file during parsing. Inner message is {error_message}
kk_kz: SubRip субтитрлерін іске қосу кезінде әлдене дұрыс болмады. Ішкі хабар{error_message}

source: Something wrong with SubRip transcripts file during parsing.
kk_kz: SubRip субтитрлерін іске қосу кезінде әлдене дұрыс болмады.

source: {exception_message}: Can't find uploaded transcripts: {user_filename}
kk_kz: {exception_message}: Жүктелген стенограммаларды табу мүмкін болмады: {user_filename}

source: The URL for your video. This can be a YouTube URL or a link to an .mp4, .ogg, or .webm video file hosted elsewhere on the Internet.
kk_kz: Сіздің бейне жазбаңыздың URL-ы. Бұл YouTube URL-ы немесе Интернетте басқа жерде орналасқан .mp4, .ogg, әлде .webm бейне файлына сілтеме болуы мүмкін.

source: SubRip (.srt) file
kk_kz: Субтитр (.srt) файлы

source: Text (.txt) file
kk_kz: Тексттік (.txt) файл

source: Navigation
kk_kz: Навигация

source: About these documents
kk_kz: Осы құжаттар туралы

source: Index
kk_kz: Мазмұны

source: Search
kk_kz: Іздеу

source: Copyright
kk_kz: Авторлық құқық

source: Name
kk_kz: Аты

source: Username
kk_kz: Пайдаланушының аты

source: Grade
kk_kz: Баға

source: Subsection
kk_kz: Кіші бөлім

source: Opened by this number of students
kk_kz: Осынша оқушылармен ашылған

source: subsections
kk_kz: кіші бөлім

source: Count of Students
kk_kz: Оқушыларды есептеу

source: problems
kk_kz: тапсырмалар

source: This is the wiki for **{organization}**'s _{course_name}_.
kk_kz: Бұл мыналарға арналған Вики**{organization}**'s _{course_name}_.

source: Course page automatically created.
kk_kz: Курстың беті автоматты түрде құрылды.

source: Welcome to the edX Wiki
kk_kz: Вики edX хош келдіңіз

source: Visit a course wiki to add an article.
kk_kz: Бапты қосу үшін курстың вики бетіне кіріңіз.

source: User {username} does not exist.
kk_kz: {username} пайдаланушы аты жоқ.

source: User {username} has never accessed problem {location}
kk_kz: {username} пайдаланушы {location} тапсырмасын қараған жоқ

source: ERROR: No playable video sources found!
kk_kz: ҚАТЕ: бейненің қалпына келтірілетін көздері табылмады!

source: Path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_DIR
kk_kz: {0} бағдары жоқ. Оны құрыңыз немесе GIT_REPO_DIR көмегімен басқа жолды көрсетіңіз
