Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Advanced settings control specific course functionality. On this page, you can edit manual policies, which are JSON-based key and value pairs that control specific course settings.
kk_kz: Озық баптаулар курстың айрықша функционалын бақылайды. Осы бетте сіз JSON негізделген саясатты және курстың баптауларын басқаратын айнымалыларды қолмен редакциялай аласыз.

source: Any policies you modify here override all other information you've defined elsewhere in Studio. Do not edit policies unless you are familiar with both their purpose and syntax.
kk_kz: Сіз осы жерде өзгертетін кез келген саясаттар сіз Студияда қайда болмасын көрсеткен барлық басқа ақпаратты қайта жазады. Саясаттардың мәнін және синтаксисін жақсы игергенге дейін оларды ауыстырмаңыз.

source: {em_start}Note:{em_end} When you enter strings as policy values, ensure that you use double quotation marks (&quot;) around the string. Do not use single quotation marks (&apos;).
kk_kz: {em_start}Назар аударыңыз:{em_end} Сіз жолдарды саясаттардың мәні ретінде енгізген кезде жолға дейін және одан кейін қос тырнақшаны пайдаланатындығыңызға көз жеткізіңіз (&quot;). Дара тырнақшаларды пайдаланбаңыз (&apos;).

source: Details &amp; Schedule
kk_kz: Бөлшектер және Кесте

source: Grading Settings
kk_kz: Бағалау баптаулары

source: Overall Grade Range
kk_kz: Бағалардың жалпы шектері

source: Your overall grading scale for student final grades
kk_kz: Студенттерді қорытынды бағалауға арналған сіздің жалпы бағалау шәкіліңіз

source: Grading Rules &amp; Policies
kk_kz: Бағалау ережесі және басқа ережелер

source: Deadlines, requirements, and logistics around grading student work
kk_kz: Студенттік жұмыстарды бағалау мерзімдері, талаптары және оны ұйымдастыру

source: Grace Period on Deadline:
kk_kz: Мерзімге арналған грейд-кезең:

source: Leeway on due dates
kk_kz: Белгіленген мерзімдерден қалып қою

source: Assignment Types
kk_kz: Тапсырмалардың үлгілері

source: Categories and labels for any exercises that are gradable
kk_kz: Кез келген бағаланатын жаттығуларға арналған санаттар мен белгілер

source: New Assignment Type
kk_kz: Жаңа үлгідегі тағайындау

source: You can use the slider under Overall Grade Range to specify whether your course is pass/fail or graded by letter, and to establish the thresholds for each grade.
kk_kz: Сіздің курс қаншалықты өтетіндігін/өтпейтіндігін немесе әріптер бойынша бағаланатындығын көрсету үшін Сіз Бағалардың Жалпы Рангы жөніндегі слайдерді пайдалана аласыз және әрбір баға үшін шекараларды көрсете аласыз.

source: You can specify whether your course offers students a grace period for late assignments.
kk_kz: Сіздің курс студенттерге кеш тапсырмалар үшін жеңілдің кезеңін ұсынатындығын көрсете аласыз.

source: You can also create assignment types, such as homework, labs, quizzes, and exams, and specify how much of a student's grade each assignment type is worth.
kk_kz: Сіз үй тапсырмасы, зертханалық тапсырмалар және емтихандар сияқты тапсырмалардың үлгілерін құра аласыз және тапсырманың әрбір түрі студент бағасының қай бөлігін білдеретіндігін көрсете аласыз.

source: Expand or Collapse
kk_kz: Ашу немесе Жиыру

source: No Actions
kk_kz: Әрекеттер жоқ

source: You have unsaved changes. Do you really want to leave this page?
kk_kz: Сізде сақталмаған өзгерістер бар. Сіз шынымен де осы беттен шыққыңыз келе ме?

source: New Textbook
kk_kz: Жаңа оқулық

source: Why should I break my textbook into chapters?
kk_kz: Оқулықты тарауларға бөлу не үшін керек?

source: Breaking your textbook into multiple chapters reduces loading times for students, especially those with slow Internet connections. Breaking up textbooks into chapters can also help students more easily find topic-based information.
kk_kz: Оқулықты бірнеше тарауларға бөлу арқылы Сіз оны жүктеу үшін талап етілетін уақытты әсіресе интернетпен байланыс жасау жылдамдығы төмен студенттер үшін қысқартасыз. Оқулықты тарауларға бөлу студенттерге берілген тақырып бойынша ақпаратты оңай табуға да көмегін тигізеді.

source: What if my book isn't divided into chapters?
kk_kz: Менің кітабым тарауларға бөлінбейтін болса не істеуге болады?

source: If your textbook doesn't have individual chapters, you can upload the entire text as a single chapter and enter a name of your choice in the Chapter Name field.
kk_kz: Егер сіздің оқулық жеке тарауларға бөлінбеген болса, Сіз Тараудың Атауы алабында еркін атауды көрсетіп, барлық мәтінді бір тарау ретінде жүктей аласыз.

source: You are editing a draft.
kk_kz: Сіз шимайжазбаны редакциялаудасыз.

source: This unit was originally published on {date}.
kk_kz: Осы кіші бөлім бастапқыда {date} жарияланған болатын

source: View the Live Version
kk_kz: Ағымдағы нұсқаны қарау

source: Unit Settings
kk_kz: Кіші бөлімнің баптаулары

source: Visibility:
kk_kz: Көзге көрінуі:

source: Public
kk_kz: Ашық

source: Private
kk_kz: Бейресми

source: This unit has been published. To make changes, you must {link_start}edit a draft{link_end}.
kk_kz: Бұл кіші бөлім жарияланды. Қажетті өзгерістерді жасау үшін сіз {link_start} жобаны редакциялауыңыз керек {link_end}.

source: This is a draft of the published unit. To update the live version, you must {link_start}replace it with this draft{link_end}.
kk_kz: Бұл жарияланған кіші бөлімнің жобасы. Ағымдағы нұсқаны жаңарту үшін сіз {link_start}жобадағы {link_end} ауыстыруыңыз керек.

source: This unit is scheduled to be released to <strong>students</strong> on <strong>{date}</strong> with the subsection {link_start}{name}{link_end}
kk_kz: Тақырып<strong>студенттер үшін</strong> <strong>{date}</strong> кіші бөліммен{link_start}{name}{link_end} жариялауға жоспарланған

source: This unit is scheduled to be released to <strong>students</strong> with the subsection {link_start}{name}{link_end}
kk_kz: Тақырып <strong> студенттер үшін </strong> кіші бөліммен {link_start}{name}{link_end} жариялауға жоспарланған

source: Delete Draft
kk_kz: Шимайжазбаны жою

source: Unit Location
kk_kz: Кіші бөлімнің орналасқан орны

source: Unit Identifier:
kk_kz: Кіші бөлімнің сәйкестендіргіші:

source: Thank you for signing up for edX Studio! To activate your account, please copy and paste this address into your web browser's address bar:
kk_kz: edx Studio жүйесінде тіркелгеніңіз үшін рахмет! Сіздің есептік жазбаны белсендендіру үшін мына мекенжайды сіздің браузердің мекенжай жолына көшіріп алыңыз:

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the edX web site.
kk_kz: Егер сіз осындай сауал жасамасаңыз, бұдан әрі әрекет қажет емес. Осы хатқа жауап бермей-ақ қойыңыз; егер сізге көмек керек болса, edX сайтындағы көмек секциясына көз салып көріңіз.

source: Your account for edX Studio
kk_kz: Сіздің edX Studio есептік жазбаңыз

source: {email} has requested Studio course creator privileges on edge
kk_kz: {email} Studio курстар құрушының артықшылықтарына жедел сұрау салды

source: User '{user}' with e-mail {email} has requested Studio course creator privileges on edge.
kk_kz: ' Мекенжайы e-mail {email} пайдаланушы '{user} Studio курстар құрушының артықшылықтарына жедел сұрау салды

source: To grant or deny this request, use the course creator admin table.
kk_kz: Осы сауалды мақұлдау немесе одан бас тарту үшін курсты құрушының әкімшілік кестесін пайдаланыңыз.

source: Your request for course creation rights to edX Studio have been denied. If you believe this was in error, please contact:
kk_kz: Сізге еdX Studio курстарын құру құқығын ұсынудан бас тартылды. Егер сіз қандай бір қателік орын алды деп есептесеңіз, бізбен хабарласыңыз:

source: Your request for course creation rights to edX Studio have been granted. To create your first course, visit:
kk_kz: Сізге еdX Studio курстарын құру құқығы ұсынылды. Өзіңіздің бірінші курсты құру үшін мұнда кіріңіз:

source: Your course creation rights to edX Studio have been revoked. If you believe this was in error, please contact:
kk_kz: Сіз еdX Studio курстарын құру құқығынан айрылдыңыз. Егер сіз қандай бір қателік орын алды деп есептесеңіз, бізбен хабарласыңыз:

source: Your course creator status for edX Studio
kk_kz: Сіздің курстар авторы мәртебеңіз еdX Studio

source: You can now {link_start}login{link_end}.
kk_kz: Сіз қазір {link_start}кіре аласыз{link_end}.

source: An activation link has been sent to {email}, along with instructions for activating your account.
kk_kz: Белсендендіруге арналған сілтеме Сіздің есептік жазбаны белсендендіру жөніндегі нұсқаулықпен бірге {email} жіберілді.

source: All rights reserved.
kk_kz: Барлық құқықтар қорғалған.

source: Contact Us
kk_kz: Бізбен хабарласыңыз

source: Current Course:
kk_kz: Ағымдағы курс:

source: {course_name}'s Navigation:
kk_kz: {course_name} навигация:

source: Outline
kk_kz: Мазмұны

source: Updates
kk_kz: Жаңартулар

source: Schedule &amp; Details
kk_kz: Кесте&Бөлшектер

source: Checklists
kk_kz: Бақылау тізімдері

source: Import
kk_kz: Импорт

source: Export
kk_kz: Экспорт

source: Help &amp; Account Navigation
kk_kz: Аккаунт бойынша көмек және навигация

source: Currently signed in as:
kk_kz: Сіз мынадай ретінде кірдіңіз:

source: Sign Out
kk_kz: Шығу

source: You're not currently signed in
kk_kz: Сіз тіркелмегенсіз

source: Launch Latex Source Compiler
kk_kz: Latex компиляторын іске қосу

source: Heading 1
kk_kz: 1 тақырып

source: Multiple Choice
kk_kz: Көптік таңдау

source: Checkboxes
kk_kz: Жалаушалар

source: Text Input
kk_kz: Бастапқы мәтін

source: Numerical Input
kk_kz: Цифрлық енгізу

source: Dropdown
kk_kz: Ашылма

source: Explanation
kk_kz: түсіндірме

source: Advanced Editor
kk_kz: Кеңейтілген редактор

source: Toggle Cheatsheet
kk_kz: Шпаргалканы ауыстыру

source: Label
kk_kz: Белгі

source: Enroll in edX101
kk_kz: edX101 тіркелу

source: name
kk_kz: аты

source: Delete this unit
kk_kz: Осы тақырыпты жою

source: Delete unit
kk_kz: Тақырыпты жою

source: Drag to sort
kk_kz: Сұрыптау үшін тарту

source: Drag to reorder unit
kk_kz: Тақырыптарды қайта ұйымдастыру үшін тарту

source: This is a key string.
kk_kz: Бұл негізгі жолы.

source: created
kk_kz: құрылды

source: Only localhost... muahahaha
kk_kz: Жергілікті компьютер ғана ... муахахаха

source: Initial title of the article. May be overridden with revision titles.
kk_kz: Мақаланың алғашқы атауы. Ревизиялық тақырыптармен жабылуы мүмкін.

source: Type in some contents
kk_kz: Азғана мазмұнды теріңіз

source: This is just the initial contents of your article. After creating it, you can use more complex features like adding plugins, meta data, related articles etc...
kk_kz: Бұл сіздің мақаланың бастапқы мазмұны ғана. Оны құрғаннан кейін сіз плагиндер, метадеректер, байланысқан мақалаларды қосу және т.б. сияқты анағұрлым күрделі функцияларды пайдалана аласыз

source: Contents
kk_kz: Мазмұны

source: Summary
kk_kz: Қысқаша

source: Give a short reason for your edit, which will be stated in the revision log.
kk_kz: Ревизия журналында жазылатын редакциялау себебін қысқаша көрсетіңіз.

source: While you were editing, someone else changed the revision. Your contents have been automatically merged with the new contents. Please review the text below.
kk_kz: Сіз редакциялап жатқанда басқа біреу ревизияны өзгертті. Сіздің мазмұныңыз жаңа мазмұнмен бірге автоматты түрде шығарып тасталды. Төмендегі мәтінді тексеріңіз.

source: No changes made. Nothing to save.
kk_kz: Өзгерістер болған жоқ. Сақтайтын ештеңе жоқ.

source: Select an option
kk_kz: Опцияны таңдаңыз

source: Slug
kk_kz: Қысқаша атауы

source: This will be the address where your article can be found. Use only alphanumeric characters and - or _. Note that you cannot change the slug after creating the article.
kk_kz: Бұл сіздің мақала орналасатын мекенжай болады. Цифрларды, латын әліпбиінің символдарын және тире мен төменгі астын сызу символдарын ғана пайдаланыңыз. Мақаланы құрғаннан кейін сіз сілтемені өзгерте алмайтындығыңыз есіңізде болсын.

source: Write a brief message for the article's history log.
kk_kz: Журнал үшін мақала тарихының қысқаша хабарламасын жазыңыз.

source: A slug may not begin with an underscore.
kk_kz: Қысқаша атау астын сызу символынан бастала алмайды

source: A deleted article with slug "%s" already exists.
kk_kz: Қысқаша атауы \"%s\" алыстағы мақала бар.

source: A slug named "%s" already exists.
kk_kz: Қысқаша атауы \"%s\" мақала бар.

source: Yes, I am sure
kk_kz: Иә, мен сенімдімін

source: Purge
kk_kz: Тазарту

source: Purge the article: Completely remove it (and all its contents) with no undo. Purging is a good idea if you want to free the slug such that users can create new articles in its place.
kk_kz: Мақаланы тазарту. Оны қалпына келтіру мүмкіндігісіз оны толық жоюды (оның барлық толтыруын қоса алғанда) жүргізеді. Сіз пайдаланушылар тиісті орында жаңа мақалалар құра алуы үшін қысқаша атауды босатқыңыз келген жағдайда ғана тазарту орынды.

source: You are not sure enough!
kk_kz: Сіз жеткілікті сенімді емессіз!

source: While you tried to delete this article, it was modified. TAKE CARE!
kk_kz: Сіз осы мақаланы жоюға әрекет жасағанша, ол өзгертілді. САҚ БОЛЫҢЫЗ!

source: Lock article
kk_kz: Мақаланы бұғаттау

source: Deny all users access to edit this article.
kk_kz: Барлық пайдаланушыларға осы мақаланы редакциялауға тыйым салынсын.

source: Permissions
kk_kz: Қол жеткізу құқығы

source: Owner
kk_kz: Ие

source: Enter the username of the owner.
kk_kz: Ие пайдаланушысының атын енгізіңіз

source: (none)
kk_kz: (жоқ)

source: Inherit permissions
kk_kz: Қол жеткізу құқықтарына мұрагер болу

source: Check here to apply the above permissions recursively to articles under this one.
kk_kz: Осы мақаланың астындағы мақалаларға қол жеткізудің жоғарыда тұрған құқықтарын рекурсивті қолдану үшін осында шертіңіз.

source: Permission settings for the article were updated.
kk_kz: Осы мақалаға арналған қол жеткізу құқықтарын баптау жаңартылды.

source: Your permission settings were unchanged, so nothing saved.
kk_kz: Сіздің қол жеткізу құқықтарыңызды баптау өзгертілген жоқ, сақтайтын ештеңе жоқ.

source: No user with that username
kk_kz: Пайдаланушының осындай аты бар пайдаланушылар жоқ.

source: Article locked for editing
kk_kz: Мақала редакциялау үшін бұғатталды

source: Article unlocked for editing
kk_kz: Мақала редакциялау үшін бұғаттаудан алынды

source: Filter...
kk_kz: Сүзгі

source: Settings for plugin
kk_kz: Плагинді баптау

source: current revision
kk_kz: Ағымдағы ревизия

source: The revision being displayed for this article. If you need to do a roll-back, simply change the value of this field.
kk_kz: Ревизия осы мақала үшін бейнеленеді. Егер сізге кері шегіну қажет болса, осы алаптың мәнін жай өзгертіңіз.

source: modified
kk_kz: өзгертілді

source: Article properties last modified
kk_kz: Мақаланың қасиеттері соңғы ретте өзгертілген болатын

source: owner
kk_kz: ие

source: The owner of the article, usually the creator. The owner always has both read and write access.
kk_kz: Әдетте құрушы мақаланың иесі. Ие оқуға және жазуға құқылы.

source: group
kk_kz: топ

source: Like in a UNIX file system, permissions can be given to a user according to group membership. Groups are handled through the Django auth system.
kk_kz: UNIX файлдық жүйесінде рұқсаттар пайдаланушыға оның пайдаланымдық тобына сай берілуі мүмкін. Топтар Django авторландыру жүйесі арқылы басқарылады.

source: group read access
kk_kz: топ үшін оқуға қол жеткізу

source: group write access
kk_kz: топ үшін жазуға қол жеткізу

source: others read access
kk_kz: басқалар үшін оқуға қол жеткізу

source: others write access
kk_kz: басқалар үшін жазуға қол жеткізу

source: Article without content (%(id)d)
kk_kz: (%(id)d) мазмұны жоқ мақала

source: content type
kk_kz: Мазмұн үлгісі

source: object ID
kk_kz: Объектінің ID

source: Article for object
kk_kz: Объектіге арналған мақала

source: Articles for object
kk_kz: Объектіге арналған мақалалар

source: revision number
kk_kz: ревизиялық нөмір

source: IP address
kk_kz: IP мекенжайы

source: user
kk_kz: пайдаланушы

source: locked
kk_kz: бұғатталды

source: article
kk_kz: мақала

source: article contents
kk_kz: мақаланың мазмұны

source: article title
kk_kz: мақаланың атауы

source: Each revision contains a title field that must be filled out, even if the title has not changed
kk_kz: Әрбір ревизия тақырып алабынан тұрады, ол тақырып өзгерілмесе де толтырылуы тиіс

source: original article
kk_kz: түпнұсқалық мақала

source: Permissions are inherited from this article
kk_kz: Рұқсаттар осы мақаладан мұраға алынды

source: A plugin was changed
kk_kz: Плагин өзгертілген болатын

source: The revision being displayed for this plugin.If you need to do a roll-back, simply change the value of this field.
kk_kz: Ревизия осы плагин үшін көрсетіледі. Егер сізге кері шегіну қажет болса, осы алаптың мазмұнын жай өзгерте салыңыз.

source: Cache lookup value for articles
kk_kz: Мақалаларға арналған кэштан алынған мән

source: slug
kk_kz: қысқаша атауы

source: URL path
kk_kz: URL жол

source: URL paths
kk_kz: URL жолдар

source: Sorry but you cannot have a root article with a slug.
kk_kz: Өкінішке орай түбірлік мақала үшін қысқаша атауы беріле алмайды.

source: A non-root note must always have a slug.
kk_kz: Түбірлік емес мақала әрқашан да қысқаша атауға ие болуы тиіс.

source: There is already a root node on %s
kk_kz: Түбірлік торап %s бар.

source: Articles who lost their parents =============================== The children of this article have had their parents deleted. You should probably find a new home for them.
kk_kz: Өз ата-аналарын жоғалтқан мақалалар\n ===============================\n \n \n Осы мақала балаларының ата-аналары жойылған болатын. Сіз оларға жаңа үй тауып беруіңіз керек шығар

source: Lost and found
kk_kz: Табылған заттар бюросы

source: A short summary of what the file contains
kk_kz: Ққысқаша файлдың мазмұны туралы

source: Yes I am sure...
kk_kz: Иә, мен сенімдімін...

source: Click to download file
kk_kz: Файлды көшіріп жүктеу үшін басыңыз

source: The revision of this attachment currently in use (on all articles using the attachment)
kk_kz: Осы қосымшаның нұсқасы қазіргі сәтте пайдаланылуда (осы қосымшаны пайдаланатын барлық мақалаларда)

source: original filename
kk_kz: файлдың бастапқы атауы

source: attachment
kk_kz: тіркеме

source: attachments
kk_kz: тіркемелер

source: file
kk_kz: файл

source: attachment revision
kk_kz: тіркемені тексеру

source: attachment revisions
kk_kz: тіркемелерді тексеру

source: %s was successfully added.
kk_kz: %s ойдағыдай қосылды.

source: Your file could not be saved: %s
kk_kz: Сіздің файл сақталмайды: %s

source: Your file could not be saved, probably because of a permission error on the web server.
kk_kz: Сіздің файл сақталмайды, мүмкін веб-сервердегі қол жеткізу құқықтарының қателері нәтижесінде болар.

source: %s uploaded and replaces old attachment.
kk_kz: %s жүктелді және тіркеменің көне нұсқасын ауыстырды

source: Your new file will automatically be renamed to match the file already present. Files with different extensions are not allowed.
kk_kz: Сіздің жаңа файлға қолданыстағы файлға сәйкес автоматты түрде қайта атау берілетін болады. Кеңейтулері әртүрлі файлдарға жол берілмейді.

source: Current revision changed for %s.
kk_kz: Ағымдағы нұсқа өзгертілді %s.

source: Added a reference to "%(att)s" from "%(art)s".
kk_kz: \"%(art)s\"-дан\"%(att)s\" сілтеу қосылды

source: The file %s was deleted.
kk_kz: %s файл жойылған болатын.

source: This article is no longer related to the file %s.
kk_kz: Бұл мақала енді %s жатпайды.

source: A file was changed: %s
kk_kz: Файл өзгертілген болатын: %s

source: A file was deleted: %s
kk_kz: Файл жойылған болатын: %s

source: New image %s was successfully uploaded. You can use it by selecting it from the list of available images.
kk_kz: %s жаңа бейнесі ойдағыдай жүктелді. Сіз оны қол жетімді бейнелер тізімінен таңдап пайдалана аласыз.

source: Are you sure?
kk_kz: Сіз сенімдісіз бе?

source: image
kk_kz: бейне

source: images
kk_kz: бейнелер

source: Image: %s
kk_kz: Бейне: %s

source: Current revision not set!!
kk_kz: Ағымдағы нұсқа көрсетілмеген!!

source: image revision
kk_kz: бейне нұсқасы

source: image revisions
kk_kz: бейне нұсқасы

source: Image Revsion: %d
kk_kz: Бейне нұсқасы: %d

source: %s has been restored
kk_kz: %s қалпына келтірілген болатын

source: %s has been marked as deleted
kk_kz: %s жойылған ретінде белгіленген болатын

source: %(file)s has been changed to revision #%(revision)d
kk_kz: %(file)s мына нұсқаға өзгертілді #%(revision)d

source: %(file)s has been saved.
kk_kz: %(file)s сақталған болатын.

source: Images
kk_kz: Бейнелер

source: An image was added: %s
kk_kz: Бейне қосылған болатын: %s

source: Links
kk_kz: Сілтемелер

source: Notifications
kk_kz: Хабарламалар

source: When this article is edited
kk_kz: Осы мақала қашан редакцияланды

source: Also receive emails about article edits
kk_kz: Мақаланы түзету туралы хаттар да алу

source: Your notification settings were updated.
kk_kz: Сіздің хабарламаларды баптауларыңыз жаңартылған болатын.

source: %(user)s subscribing to %(article)s (%(type)s)
kk_kz: %(user)s жазылады %(article)s (%(type)s)

source: Article deleted: %s
kk_kz: Мақала жойылды: %s

source: Article modified: %s
kk_kz: Мақала өзгертілді: %s

source: New article created: %s
kk_kz: Жаңа мақала құрылды: %s

source: You are now sign up... and now you can sign in!
kk_kz: Сіз тіркелдіңіз... енді кіре аласыз!

source: You are no longer logged in. Bye bye!
kk_kz: Сіз жүйеден шықтыңыз. Сау болыңыз!

source: You are now logged in! Have fun!
kk_kz: Сіз кірдіңіз! Көңіл көтеріңіз!

source: New article '%s' created.
kk_kz: Жаңа '%s' мақала құрылды.

source: There was an error creating this article: %s
kk_kz: Осы мақаланы құруда қате орын алды: %s

source: There was an error creating this article.
kk_kz: Осы мақаланы құруда қате орын алды.

source: This article cannot be deleted because it has children or is a root article.
kk_kz: Осы мақала еншілес немесе түбірлік болып табылатын болғандықтан, жойылмайды.

source: This article together with all its contents are now completely gone! Thanks!
kk_kz: Осы мақала оның мазмұнымен бірге толық жойылған болатын! Рахмет!

source: The article "%s" is now marked as deleted! Thanks for keeping the site free from unwanted material!
kk_kz: "%s" мақала жойылған ретінде белгіленген! Осы сайттың жағымсыз материалдан бос мазмұны үшін рахмет!

source: Your changes were saved.
kk_kz: Сіздің өзгертулеріңіз сақталған болатын.

source: A new revision of the article was succesfully added.
kk_kz: Мақаланың жаңа ревизиясы ойдағыдай қосылған болатын.

source: Restoring article
kk_kz: Мақаланы қалпына келтіру

source: The article "%s" and its children are now restored.
kk_kz: \"%s\" мақала және оның еншілес мақалалары қалпына келтірілген болатын.

source: The article %s is now set to display revision #%d
kk_kz: %s мақала қазір #%d ревизияны бейнелейді

source: New title
kk_kz: Жаңа атауы

source: Merge between Revision #%(r1)d and Revision #%(r2)d
kk_kz: #%(r1)d және #%(r2)d ревизиялардың қосылуы

source: A new revision was created: Merge between Revision #%(r1)d and Revision #%(r2)d
kk_kz: Жаңа ревизия құрылған болатын: #%(r1)d және #%(r2)d ревизиялардың қосылуы
