Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: If you perform an import while your course is running, and you change the URL names (or url_name nodes) of any Problem components, the student data associated with those Problem components may be lost. This data includes students' problem scores.
kk_kz: Егер сіз импорттауды курсты қолдану кезінде іске қосатын және тапсырманың кез келген компонентінің URL аттарын (немесе жазбаның url_name) өзгертетін болсаңыз, тапсырманың осы компонентімен жұмыс істейтін студенттер туралы ақпарат жоғалуы мүмкін. Осы ақпарат студенттердің тапсырмалар бойынша бағаларын қамтиды.

source: There was an error during the upload process.
kk_kz: Жүктеу кезінде қате туындады.

source: There was an error while unpacking the file.
kk_kz: Файлды ашу кезінде қате туындады.

source: There was an error while verifying the file you submitted.
kk_kz: Сіз жіберген файлды растау кезінде қате туындады.

source: There was an error while importing the new course to our database.
kk_kz: Жаңа курсты біздің деректер қорына импорттау кезінде қате туындады.

source: Your import has failed.
kk_kz: Импорттау кезіндегі қате.

source: Choose new file
kk_kz: Жаңа файлды таңдаңыз

source: Your import is in progress; navigating away will abort it.
kk_kz: Сіздің импорт орындалуда, беттен кетсеңіз, Сіз оны болдырмайсыз.

source: My Courses
kk_kz: Менің курстарым

source: New Course
kk_kz: Жаңа курс

source: Email staff to create course
kk_kz: Курсты құру үшін қызметкерлерге электрондық хат жолдаңыз

source: Welcome, {0}!
kk_kz: Хош келдіңіз, {0}!

source: Here are all of the courses you currently have access to in Studio:
kk_kz: Осында сіздің осы сәтте Studio қол жеткізе алатын барлық курстарыңыз орналасқан:

source: You currently aren't associated with any Studio Courses.
kk_kz: Осы сәтте сіз Studio бір де бір курсқа жазылмағансыз:

source: Please correct the highlighted fields below.
kk_kz: Төменде белгіленген алаптарды түзетіңіз.

source: Create a New Course
kk_kz: Жаңа курс құрыңыз

source: Required Information to Create a New Course
kk_kz: Жаңа курсты құру үшін талап етілетін ақпарат

source: e.g. Introduction to Computer Science
kk_kz: Мысалы: «Computer Science кіріспе».

source: The public display name for your course.
kk_kz: Сіздің курстың көпшілік үшін бейнеленетін аты.

source: Organization
kk_kz: Ұйым

source: e.g. UniversityX or OrganizationX
kk_kz: Мысалы: Х Университеті немесе Х Ұйымы

source: The name of the organization sponsoring the course.
kk_kz: Курсқа демеушілік көрсететін ұйымның атауы

source: Note: This is part of your course URL, so no spaces or special characters are allowed.
kk_kz: Ескерту: бұл Сіздің курстың URL бөлігі, мұнда бос орындар мен арнайы нышандарды пайдалануға рұқсат берілмейді.

source: This cannot be changed, but you can set a different display name in Advanced Settings later.
kk_kz: Бұл өзгертіле алмайды, бірақ сіз жаңа бейнелетін атты кейінірек Озық Баптаулар мәзірінде орната аласыз.

source: e.g. CS101
kk_kz: мысалы, CS101

source: The unique number that identifies your course within your organization.
kk_kz: Сіздің ұйымның курсына меншіктелген бірегей нөмір.

source: Note: This is part of your course URL, so no spaces or special characters are allowed and it cannot be changed.
kk_kz: Ескерту: бұл Сіздің курстың URL бөлігі, мұнда бос орындар мен арнайы нышандарды пайдалануға рұқсат берілмейді; оны кейіннен өзгерту мүмкін болмайды.

source: Course Run
kk_kz: Курс барысы

source: e.g. 2014_T1
kk_kz: мысалы: 2014_С1

source: The term in which your course will run.
kk_kz: Курс жүргізілетін семестр.

source: Create
kk_kz: Құру

source: Course Run:
kk_kz: Курс барысы:

source: Are you staff on an existing Studio course?
kk_kz: Сіз Studio бар қандай да болмасын курспен жұмыс істейсіз бе?

source: You will need to be added to the course in Studio by the course creator. Please get in touch with the course creator or administrator for the specific course you are helping to author.
kk_kz: Курсты құрушы сізді Studio курсқа қосуы тиіс. Оны құруға қатысқыңыз келетін курстың авторымен немесе әкімшісімен хабарласыңыз.

source: Create Your First Course
kk_kz: Сіздің бірінші курсыңызды құрыңыз

source: Your new course is just a click away!
kk_kz: Сіздің жаңа курсыңыз сізден бір шертімде!

source: Becoming a Course Creator in Studio
kk_kz: Studio курстың бірлескен авторы болу

source: edX Studio is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by edX. Our team will evaluate your request and provide you feedback within 24 hours during the work week.
kk_kz: edX Studio —xConsortium бойынша біздің серіктестерге және кейбір қонақтарға арналған онлайн-өнім. Сізге редакциялау үшін сіз мүшесі болып табылатын командалардың курстары қол жетімді, олардың тізімін осы хабардың үстіңгі жағынан көруге болады; курстардың авторлығы edX бөлек тәртіппен ұсыналады. Біздің команда сіздің сауалыңызды жұмыс аптасы уақытында 24 сағат ішінде қарайды және жауап береді.

source: Your Course Creator Request Status:
kk_kz: Сіздің курс авторлығына өтініміздің мәртебесі

source: Request the Ability to Create Courses
kk_kz: Курсты құру мүмкіндігіне сауал

source: Your Course Creator Request Status
kk_kz: Сіздің курс авторлығына өтініміздің мәртебесі

source: edX Studio is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by edX. Our team is has completed evaluating your request.
kk_kz: edX Studio —xConsortium бойынша біздің серіктестерге және кейбір қонақтарға арналған онлайн-өнім. Сізге редакциялау үшін сіз мүшесі болып табылатын командалардың курстары қол жетімді, олардың тізімін осы хабардың үстіңгі жағынан көруге болады; курстардың авторлығы edX бөлек тәртіппен ұсыналады. Біздің команда сіздің сауалыңызды қарауды аяқтады.

source: Your Course Creator request is:
kk_kz: Сіздің курс авторлығына өтініміңіз:

source: Denied
kk_kz: Бас тартылды

source: Your request did not meet the criteria/guidelines specified by edX Staff.
kk_kz: Сіздің сауал edX қабылданған талаптарды/нормаларды қанағаттандырмайды

source: edX Studio is a hosted solution for our xConsortium partners and selected guests. Courses for which you are a team member appear above for you to edit, while course creator privileges are granted by edX. Our team is currently evaluating your request.
kk_kz: edX Studio —xConsortium бойынша біздің серіктестерге және кейбір қонақтарға арналған онлайн-өнім. Сізге редакциялау үшін сіз мүшесі болып табылатын командалардың курстары қол жетімді, олардың тізімін осы хабардың үстіңгі жағынан көруге болады; курстардың авторлығы edX бөлек тәртіппен ұсыналады. Біздің команда қазіргі сәтте сіздің сауалыңызды қарауда.

source: Your request is currently being reviewed by edX staff and should be updated shortly.
kk_kz: Сіздің сауалыңызды қазіргі сәтте edX қызметкерлері қарауда және жақын арада жаңартылатын болады

source: Can I create courses in Studio?
kk_kz: Мен Studio курстар құра аламын ба?

source: In order to create courses in Studio, you must
kk_kz: Studio курс құру үшін сізге курс құру кезінде көмек алу үшін edX хабарласу қажет

source: In order to create courses in Studio, you must have course creator privileges to create your own course.
kk_kz: Studio курс құру үшін сізге курсты құрушы құқығын иелену қажет

source: Your request to author courses in studio has been denied. Please
kk_kz: Сіздің Studio курстар авторлығына сауалыңыз қабылданбады. Өтінеміз,

source: contact edX Staff with further questions
kk_kz: егер сіздің бұдан әрі сұрақтарыңыз болса, edX қызметкерлерімен хабарласыңыз

source: Thanks for signing up, %(name)s!
kk_kz: %(name)s!, тіркелгеніңіз үшін рахмет!

source: We need to verify your email address
kk_kz: Біз сіздің электрондық мекенжайыңызды растауымыз керек

source: Almost there! In order to complete your sign up we need you to verify your email address (%(email)s). An activation message and next steps should be waiting for you there.
kk_kz: Дайын дерлік! Тіркеуді аяқтау үшін бізге сіздің электрондық мекенжайыңызды (%(email)s) растау керек. Белсендендіру бойынша нұсқаулықтар бар хат онда жіберіліп қойды.

source: Need help?
kk_kz: Көмек керек пе?

source: Please check your Junk or Spam folders in case our email isn't in your INBOX. Still can't find the verification email? Request help via the link below.
kk_kz: Егер біздің хат сіздің «Кіріс»-те жоқ болса, «Спам» папкасын тексеріңіз. Әлі де хатты табу мүмкін болмады ма? Төмендегі сілтеме арқылы көмек сұраңыз.

source: Sign In
kk_kz: Кіру

source: Sign In to edX Studio
kk_kz: edX Studio кіру

source: Don't have a Studio Account? Sign up!
kk_kz: Сіздің Studio аккаунтыңыз жоқ па? Тіркеліңіз!

source: Required Information to Sign In to edX Studio
kk_kz: edX Studio кіру үшін қажетті ақпарат

source: Studio Support
kk_kz: Studio техникалық қолдау

source: Having trouble with your account? Use {link_start}our support center{link_end} to look over self help steps, find solutions others have found to the same problem, or let us know of your issue.
kk_kz: Есептік жазбамен проблемалар бар ма? Қадам бойынша көмекті көру, осындай проблемаға тап болған басқа адамдардың шешімдерін табу үшін {link_start} біздің қолдау орталығымызды{link_end} Пайдаланыңыз немесе бізге өзіңіздің проблемаңыз туралы білдіріңіз.

source: Course Team Settings
kk_kz: Курс командасының баптаулары

source: Course Team
kk_kz: Курс командасы

source: New Team Member
kk_kz: Команданың жаңа мүшесі

source: Add a User to Your Course's Team
kk_kz: Сіздің курстың командасына пайдаланушыны қосу

source: New Team Member Information
kk_kz: Команданың жаңа мүшесі туралы ақпарат

source: User's Email Address
kk_kz: Пайдаланушының электрондық почтасының мекенжайы

source: e.g. jane.doe@gmail.com
kk_kz: мысалы jane.doe@gmail.com

source: Please provide the email address of the course staff member you'd like to add
kk_kz: Сіз қосқыңыз келген курс қызметкерінің электрондық почта мекенжайын көрсетіңіз

source: Add User
kk_kz: Пайдаланушыны қосу

source: Current Role:
kk_kz: Ағымдағы рөл:

source: You!
kk_kz: Сіз!

source: Staff
kk_kz: Қызметкер

source: send an email message to {email}
kk_kz: {email} электрондық хат жолдады

source: Promote another member to Admin to remove your admin rights
kk_kz: Сіздің әкімшінің меншікті құқықтарын алып тастау үшін басқа қатысушыны әкімшіге дейін өсіріңіз

source: Remove Admin Access
kk_kz: Әкімшілік қол жеткізуді жабу

source: Add Admin Access
kk_kz: Әкімшілік қол жеткізуді қосу

source: Delete the user, {username}
kk_kz: {username}пайдаланушыны жою

source: Add Team Members to This Course
kk_kz: Осы курсқа команданың мүшелерін қосу

source: Adding team members makes course authoring collaborative. Users must be signed up for Studio and have an active account.
kk_kz: Командаға жаңа қатысушыларды қосу мүмкіндігінің арқасында курстар құру ұжымдық процесс болуда. Пайдаланушылар Studio тіркелуі және жарамды есептік жазбаға ие болуы тиіс.

source: Add a New Team Member
kk_kz: Команданың жаңа мүшесін қосу

source: Course Team Roles
kk_kz: Оқу курсы командасының ішіндегі рөлдер

source: Course team members, or staff, are course co-authors. They have full writing and editing privileges on all course content.
kk_kz: Курс командасының мүшелері немесе қызметкерлері курстың бірлескен авторлары болып табылады. Олар курстың барлық материалдарын құруға және редакциялауға толық құқылы.

source: Admins are course team members who can add and remove other course team members.
kk_kz: Әкімшілер – команданың басқа мүшелерін қоса және жоя алатын курс командасының мүшелері.

source: Transferring Ownership
kk_kz: Меншік құқықтары беріледі

source: Every course must have an Admin. If you're the Admin and you want transfer ownership of the course, click Add admin access to make another user the Admin, then ask that user to remove you from the Course Team list.
kk_kz: Әрбір курстың әкімшісі болуы тиіс. Егер Сіз әкімші болсаңыз және өз құқықтарыңызда басқаға бергіңіз келсе, басқа пайдаланушыны әкімші ету үшін \"Әкімші ретінде қол жеткізуді қосу\" шертіңіз, сонан соң осы пайдаланушыдан Сізді Курс Командасының тізімінен жоюды сұраңыз.

source: Course Outline
kk_kz: Курстың мазмұны

source: Expand/collapse this section
kk_kz: Осы бөлімді жиыру/ашу

source: New Section Name
kk_kz: Бөлімнің жаңа атауы

source: Add a new section name
kk_kz: Бөлімнің жаңа тақырыбын қосу

source: Delete this section
kk_kz: Осы бөлімді жою

source: Drag to re-order
kk_kz: Тәртіпті өзгерту үшін – орнын ауыстырыңыз

source: New Subsection
kk_kz: Жаңа кіші бөлім

source: New Unit
kk_kz: Жаңа блок

source: You haven't added any sections to your course outline yet.
kk_kz: Сіз өзіңіздің оқу жоспарыңызға бөлімдерді қосқан жоқсыз.

source: Add your first section
kk_kz: Бірінші бөлімді қосыңыз

source: Collapse All Sections
kk_kz: Барлық бөлімдерді жиыру

source: New Section
kk_kz: Жаңа бөлім

source: This section is not scheduled for release
kk_kz: Бұл бөлім әзірге жариялауға жоспарланбаған

source: Schedule
kk_kz: Кесте

source: Release date:
kk_kz: Шығарылған күні:

source: Edit section release date
kk_kz: Бөлімді шығару күнін редакциялау.

source: Delete section
kk_kz: Бөлімді жою

source: Drag to reorder section
kk_kz: Бөлімдердің тәртібін өзгерту үшін, тартыңыз

source: Expand/collapse this subsection
kk_kz: Осы кіші бөлімді жиыру/ашу

source: Delete this subsection
kk_kz: Осы кіші бөлімді жою

source: Delete subsection
kk_kz: Кіші бөлімді жою

source: You can create new sections and subsections, set the release date for sections, and create new units in existing subsections. You can set the assignment type for subsections that are to be graded, and you can open a subsection for further editing.
kk_kz: Сіз жаңа бөлімдер немесе кіші бөлімдер құра алмайсыз, бөлімдер үшін жариялау күнін белгілеңіз немесе қолданыстағы кіші бөлімдерде жаңа тақырыптар құрыңыз. Сіз сондай-ақ бағалануы тиіс кіші бөлімдер үшін тағайындау үлгісін орната және болашақ редакциялау үшін кіші бөлімді аша аласыз.

source: In addition, you can drag and drop sections, subsections, and units to reorganize your course.
kk_kz: Қосымша ретінде, сіз курсты қайта ұйымдастыру үшін бөлімдердіңң, кіші бөлімдердің және тақырыптардың орнын ауыстыра аласыз.

source: Section Release Date
kk_kz: Бөлімнің басталу күні

source: On the date set below, this section - {name} - will be released to students. Any units marked private will only be visible to admins.
kk_kz: Төменде орнатылған күнде осы бөлім - {name} – студенттер үшін жарияланатын болады. Бейресми ретінде белгіленген кез келген тақырып әкімшілер үшін ғана көрінетін болады.

source: Form Actions
kk_kz: Қолданылу нысандары

source: Sign Up for edX Studio
kk_kz: edX Studio тіркелу

source: Already have a Studio Account? Sign in
kk_kz: Studio аккаун бар ма? Кіріңіз

source: Ready to start creating online courses? Sign up below and start creating your first edX course today.
kk_kz: Онлайн-курстарды құра бастауға дайынсыз ба? Төменде тіркеліңіз және өзіңіздің бірінші курсыңызды edX құруды бүгін бастаңыз

source: Required Information to Sign Up for edX Studio
kk_kz: edX Studio тіркелу үшін қажет ақпарат

source: This will be used in public discussions with your courses and in our edX101 support forums
kk_kz: Бұл сіздің курстардың ашық пікірсайыстарында және біздің қолдау edX101 форумымызда пайдаланылатын болады

source: Your Location
kk_kz: Сіздің орналасқан орныңыз

source: I agree to the {a_start} Terms of Service {a_end}
kk_kz: Мен Қызметтер Көрсетудің {a_start} Шарттарымен келісемін {a_end}

source: Create My Account &amp; Start Authoring Courses
kk_kz: Менің аккаунтымды құру және курстар құра бастау

source: Common Studio Questions
kk_kz: Studio туралы жалпы сұрақтар

source: Who is Studio for?
kk_kz: Studio кімге арналған?

source: Studio is for anyone that wants to create online courses that leverage the global edX platform. Our users are often faculty members, teaching assistants and course staff, and members of instructional technology groups.
kk_kz: Studio edX жаһандық платформасында онлайн-курстарын құрғысы келетіндердің әрқайсысына арналған. Көбінесе біздің пайдаланушылар – оқытушылар, ассистенттер, курс қызметкерлері және технологиялық оқу топтарының мүшелері.

source: How technically savvy do I need to be to create courses in Studio?
kk_kz: Studio курс құру үшін мен қаншалықты техникалық жаттыққан болуым тиіс?

source: Studio is designed to be easy to use by almost anyone familiar with common web-based authoring environments (Wordpress, Moodle, etc.). No programming knowledge is required, but for some of the more advanced features, a technical background would be helpful. As always, we are here to help, so don't hesitate to dive right in.
kk_kz: Studio — негізгі желілік ортамен (Wordpress, Moodle және басқа) таныс кез келген адам іс жүзінде жай пайдалануы үшін әзірленген бағдарламалық қамтамасыз ету. Бағдарламалауды білу талап етілмейді, бірақ кейбір кеңейтілген функциялар үшін техникалық білімнің пайдасы болуы мүмкін. Әрекет етуге ұялмаңыз, егер бірдеңе орындай алмасаңыз – сізге көмек көрсететін болады.

source: I've never authored a course online before. Is there help?
kk_kz: Мен бұрын интернет-курс құрған емеспін. Мен сіздің көмегіңізге сене аламын ба?

source: Absolutely. We have created an online course, edX101, that describes some best practices: from filming video, creating exercises, to the basics of running an online course. Additionally, we're always here to help, just drop us a note.
kk_kz: Әрине. Біз edX101 онлайн-курсын құрдық, онда бірнеше ұсынымдар келтірілген: бейне түсірілімдерден және жаттығулар құрудан бастап онлайн-курстар жүргізу негізіне дейін. Және де сіз бізге әрқашан кез келген сұрақтар қоя аласыз.

source: Schedule &amp; Details Settings
kk_kz: &amp кестесі; баптаулардың егжей-тегжейлілігі

source: Schedule & Details
kk_kz: Кесте&Бөлшектер

source: Basic Information
kk_kz: Негізгі ақпарат

source: The nuts and bolts of your course
kk_kz: Сіздің курстың сомындары мен бұрандалары

source: This field is disabled: this information cannot be changed.
kk_kz: Бұл алап қол жетімді емес: бұл ақпарат өзгертіле алмайды.

source: Course Summary Page
kk_kz: Курс бетінің ақпары

source: (for student enrollment and access)
kk_kz: (тіркелген студенттердің қол жеткізуі үшін)

source: Send a note to students via email
kk_kz: Студенттерге электрондық почта арқылы қысқа хат жіберілді

source: Invite your students
kk_kz: Сіздің студенттерді шақырыңыз

source: Promoting Your Course with edX
kk_kz: Өзіңіздің курсты edX жылжытыңыз

source: Your course summary page will not be viewable until your course has been announced. To provide content for the page and preview it, follow the instructions provided by your <abbr title="Program Manager">PM</abbr>.
kk_kz: Сіздің курстың жалпы беті сіздің курс ашық деп жарияланғанға дейін көрінбейді. Бетті толтыру және оның превьюін көру үшін сіздің <abbr title="Program Manager">PM</abbr>ұсынған нұсқаулықтарды ұстаныңыз.

source: Course Schedule
kk_kz: Курс кестесі

source: Dates that control when your course can be viewed
kk_kz: Сіздің курсты қашан қарауға болатындығын бақылайтын күндер

source: First day the course begins
kk_kz: Курстың бірінші күні

source: Course Start Time
kk_kz: Курстың басталу уақыты

source: Course End Date
kk_kz: Курстың аяқталу күні

source: Last day your course is active
kk_kz: Сіздің курстың соңғы күні белсенді

source: Course End Time
kk_kz: Курстың аяқталу уақыты

source: Enrollment Start Date
kk_kz: Тіркеудің басталу күні

source: First day students can enroll
kk_kz: Студенттерді тіркеудің бірінші күні

source: Enrollment Start Time
kk_kz: Тіркеудің басталу уақыты

source: Enrollment End Date
kk_kz: Тіркеудің аяқталу күні

source: Last day students can enroll
kk_kz: Студенттерді тіркеудің соңғыкүні

source: Enrollment End Time
kk_kz: Тіркеудің аяқталу уақыты

source: These Dates Are Not Used When Promoting Your Course
kk_kz: Осы күндер сіздің курсты жылжыту үшін пайдаланылуы мүмкін емес

source: Introducing Your Course
kk_kz: Сіздің курспен танысу

source: Information for prospective students
kk_kz: Абитуриенттерге арналған ақпарат

source: Course Short Description
kk_kz: Курстың Қысқаша Сипаттамасы

source: Appears on the course catalog page when students roll over the course name. Limit to ~150 characters
kk_kz: Студенттер курстың атауын терген кезде курстар каталогы бетінде пайда болады. 150 белгіге дейін шектеу.

source: Course Overview
kk_kz: Курстың Қысқаша Сипаттамасы

source: your course summary page
kk_kz: сіздің курстың қысқаша мазмұны бар бет

source: Introductions, prerequisites, FAQs that are used on %s (formatted in HTML)
kk_kz: %s (formatted in HTML) пайдаланылатын кіріспелер, талаптар, жиі қойылатын сұрақтар

source: Course Image
kk_kz: Курстың бейнеленуі

source: You can manage this image along with all of your other <a href='{}'>files &amp; uploads</a>
kk_kz: Сіз осы бейнені сіздің басқа <a href='{}'>файлдарыңызбен &amp; жүктемелеріңізбен</a> бірге басқара аласыз

source: Your course currently does not have an image. Please upload one (JPEG or PNG format, and minimum suggested dimensions are 375px wide by 200px tall)
kk_kz: Сіздің курстың қазіргі уақытта бейнеленуі жоқ. Оны жүктеңіз (JPEG немесе PNG форматы, ұсынылатын ең аз мөлшері ені 375 пиксель биіктігі 200 пиксель)

source: Please provide a valid path and name to your course image (Note: only JPEG or PNG format supported)
kk_kz: Сіздің курстың бейнесіне жарамды жолды және оның атын енгізіңіз (ескерту: JPEG және PNG форматтары ғана қолдау табады)

source: Upload Course Image
kk_kz: Курстың бейнесін жүктеу

source: Course Introduction Video
kk_kz: Курсқа кіріспе бейне

source: Delete Current Video
kk_kz: Ағымдағы бейнені жою

source: Enter your YouTube video's ID (along with any restriction parameters)
kk_kz: Сіздің YouTube бейнеңіздің ID (сондай-ақ параметрлердің кез келген шектеулерін) енгізіңіз

source: Requirements
kk_kz: Талаптар

source: Expectations of the students taking this course
kk_kz: Осы курстың студенттерінен күтетіні

source: Hours of Effort per Week
kk_kz: Апта сайынғы жүктеме сағатпен

source: Time spent on all course work
kk_kz: Курстың барлық жүктемесі

source: How are these settings used?
kk_kz: Осы баптауларды қалай пайдалану керек?

source: Your course's schedule determines when students can enroll in and begin a course.
kk_kz: Сіздің курстың кестесі студенттердің қашан тіркеле алатындығын және курсты өтуді бастай алатындығын анықтайды.

source: Other information from this page appears on the About page for your course. This information includes the course overview, course image, introduction video, and estimated time requirements. Students use About pages to choose new courses to take.
kk_kz: Осы беттен алынған басқа ақпарат Курс туралы бетте пайда болады. Информация включает в себя обзор Ақпарат шолуды, болжамды уақыт шектерін қамтиды. Студенттер Курс туралы бетті өздеріне жаңа курстар таңдау үшін пайдаланады.

source: Other Course Settings
kk_kz: Курстың басқа баптаулары

source: Grading
kk_kz: Бағалау

source: Advanced Settings
kk_kz: Кеңейтілген баптаулар

source: Your policy changes have been saved.
kk_kz: Сіздің өзгертулеріңіз сақталған болатын.

source: There was an error saving your information. Please see below.
kk_kz: Сіздің ақпаратты сақтау кезінде қате орын алды. Нақтырақ төмендегіні қара.

source: Manual Policy Definition
kk_kz: Саясатты қолмен белгілеу

source: <strong>Warning</strong>: Do not modify these policies unless you are familiar with their purpose.
kk_kz: <strong>Ескерту</strong>: Осы баптаулардың тағайындалуымен таныс болмасаңыз оларды өзгертпеңіз.

source: What do advanced settings do?
kk_kz: Кеңейтілген баптаулар не үшін керек?
