Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Remove beta testers
kk_kz: Бета тестерлерді жою

source: Administration List Management
kk_kz: Әкімшілік тізімін басқару

source: Select an Administrator Group:
kk_kz: Әкімшілер тобын таңдау:

source: Getting available lists...
kk_kz: Қолжетімді тізімдерді алу...

source: Staff cannot modify staff or beta tester lists. To modify these lists, contact your instructor and ask them to add you as an instructor for staff and beta lists, or a discussion admin for discussion management.
kk_kz: Қызметкерлер және бета-тестерлер тізімдеріне қызметкерлер өзгерістер енгізе алмайды. Осы тізімдерді өзгерту үшін курстың оқытушысымен байланысыңыз және тиісті рұқсаттармен оқытушы ретінде Сізді қосып беруді сұраңыз; талқылауларды басқару үшін талқылаулар әкімшісімен байланысыңыз.

source: Course Staff
kk_kz: Курстың персоналы

source: Course staff can help you manage limited aspects of your course. Staff can enroll and unenroll students, as well as modify their grades and see all course data. Course staff are not automatically given access to Studio and will not be able to edit your course.
kk_kz: Курстың персоналы сіздің курстың аспектілер қатарын басқаруда сізге көмек көрсете алады. Персонал тізімге студенттерді енгізе немесе одан жоя алады, сондай-ақ олардың бағаларын өзгерте және курстың барлық деректерін қарай алады. Курстың персоналы Studio автоматты қолжетімділікті алмайды және Сіздің курсты редакциялай алмайды.

source: Add Staff
kk_kz: Персоналды қосу

source: Instructors
kk_kz: Оқытушылар

source: Instructors are the core administration of your course. Instructors can add and remove course staff, as well as administer discussion access.
kk_kz: Оқытушылар Сіздің курсты басқарады. Оқытушылар курстың қызметкерлерін қоса және жоя алады, сондай-ақ форумға қолжетімділікті басқара алады.

source: Add Instructor
kk_kz: Оқытушыны қосу

source: Beta Testers
kk_kz: Beta тестерлер

source: Beta testers can see course content before the rest of the students. They can make sure that the content works, but have no additional privileges.
kk_kz: Beta тестерлерде қалған студенттерден бұрын курстың мазмұнын көруге мүмкіндік бар. Олар контент жұмыс істейтініне көз жеткізе алады, бірақ оларда ешбір қосымша артықшылықтар жоқ.

source: Add Beta Tester
kk_kz: Бета Тестерді қосу

source: Discussion Admins
kk_kz: Талқылау әкімшілері

source: Discussion admins can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all cohorts. They CAN add/delete other moderators and their posts are marked as 'staff'.
kk_kz: Талқылау әкімшілері хабарларды редакциялайды немесе жояды, дұрыс емес пайдалану туралы белгілерді түсіреді, қатысушылар құрған тақырыптарды жабады және ашады және жауаптарды ұсына алады, сондай-ақ студенттердің барлық топтарының хабарларын қарайды. Олар басқа модераторларды қосады немесе жояды; олардың хабарлары \"қызметкер\" сөзімен белгіленген.

source: Add Discussion Admin
kk_kz: Талқылау Әкімшісін қосу

source: Discussion Moderators
kk_kz: Талқылау модераторлары

source: Discussion moderators can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all cohorts. They CANNOT add/delete other moderators and their posts are marked as 'staff'.
kk_kz: Талқылау модераторлары хабарларды редакциялайды немесе жояды, дұрыс емес пайдалану туралы белгілерді түсіреді, қатысушылар құрған тақырыптарды жабады және ашады және жауаптарды ұсына алады, сондай-ақ барлық топтардың хабарларын қарайды. Олар басқа модераторларды қоса немесе жоя алмайды; олардың хабарлары \"қызметкер\" сөзімен белгіленген.

source: Add Moderator
kk_kz: Модераторды қосу

source: Discussion Community TAs
kk_kz: Қоғамдастық топ басыларының талқылауы

source: Community TA's are members of the community whom you deem particularly helpful on the discussion boards. They can edit or delete any post, clear misuse flags, close and re-open threads, endorse responses, and see posts from all cohorts. Their posts are marked 'Community TA'.
kk_kz: Қоғамдастық топ басы- бұл талқылау тарауларында сізге өте пайдалы болуы мүмкін қоғамдастық мүшелері. Олар кез келген орындарды редакциялайды немесе жояды, тарауларды жабады және ашады, жауаптарды қолдайды және барлық орындарды көре алады. Олардың орындары \"Қоғамдастық топ басы\" сөздерімен таңбаланады.

source: Add Community TA
kk_kz: Қоғамдастық топ басын қосу

source: Reload Graphs
kk_kz: Кестелерді жаңарту

source: Download Student Opened as a CSV
kk_kz: CSV форматында осы студенттің деректерін көшіріп жүктеу

source: Download Student Grades as a CSV
kk_kz: CSV форматында студенттің бағаларын көшіріп жүктеу

source: This is a partial list, to view all students download as a csv.
kk_kz: Бұл ішінара тізім; барлық студенттердің деректерін қарау үшін, оларды CSV форматында көшіріп жүктеңіз.

source: Send Email
kk_kz: Электрондық почтаға хабарды жіберу

source: Message:
kk_kz: Хабардың мәтіні:

source: Please try not to email students more than once per week. Before sending your email, consider:
kk_kz: Студенттерге электрондық почтаны аптасына бір реттен жиі жібермеуге тырысыңыз. Хабарды жіберу алдында нақтылаңыз:

source: Email actions run in the background. The status for any active tasks - including email tasks - appears in a table below.
kk_kz: Осы әрекеттер фондық режимде өтеді, және белсенді тапсырмалардың мәртебесі төмендегі кестеде пайда болады. Осы тапсырма үшін жіберілген барлық тапсырмалар үшін мәртебені көру үшін осы бастырманы басыңыз:

source: Email Task History
kk_kz: Жіберілген Хабарлар

source: To see the status for all bulk email tasks ever submitted for this course, click on this button:
kk_kz: Ос курс үшін қандай да бір уақытта электрондық почтамен шығарылған барлық жаппай операциялардың мәртебесін қарау үшін осы бастырмаға басыңыз.

source: Show Email Task History
kk_kz: Жіберілген Хабарларды көрсету

source: Student-specific grade inspection
kk_kz: Нақты студенттердің бағаларын қарау

source: Student Email or Username
kk_kz: Студенттің пайдаланушының e-mail немесе аты

source: Click this link to view the student's progress page:
kk_kz: Студенттің алға басу бетін қарау үшін осы сілтеме бойынша өтіңіз:

source: Student Progress Page
kk_kz: Студенттің алға басу беті

source: Student-specific grade adjustment
kk_kz: Студентке тәуелді бағалауды реттеу

source: Next, select an action to perform for the given user and problem:
kk_kz: Енді осы пайдаланушыға және тапсырмаға қолданылуы тиіс әрекетті таңдаңыз:

source: You may also delete the entire state of a student for the specified problem:
kk_kz: Сіз сондай-ақ осы тапсырмаға байланысты студенттің жағдайын толық жоя аласыз:

source: Delete Student State for Problem
kk_kz: Тапсырмаға байланысты студенттің жағдайын жою

source: Rescoring runs in the background, and status for active tasks will appear in the 'Pending Instructor Tasks' table. To see status for all tasks submitted for this problem and student, click on this button:
kk_kz: Қайта бағалау фондық режимде орындалады, сонымен қатар белсенді тапсырмалардың жағдайы 'Нұсқаушының күтетін тапсырмалары' кестесінде пайда болады. Осы проблемамен байланысты барлық тапсырмалар үшін мәртебені, сондай-ақ оқушы туралы ақпаратты көру үшін мына бастырмаға басыңыз:

source: Show Background Task History for Student
kk_kz: Студент үшін фондық тапсырмалардың тарихын көрсету

source: Then select an action
kk_kz: Енді әрекетті таңдаңыз

source: Reset ALL students' attempts
kk_kz: Студенттердің БАРЛЫҚ талпыныстарын ысыру

source: Rescore ALL students' problem submissions
kk_kz: БАРЛЫҚ жіберілген тапсырмалар шешімдерін қайта бағалау

source: The above actions run in the background, and status for active tasks will appear in a table on the Course Info tab. To see status for all tasks submitted for this problem, click on this button
kk_kz: Әрекеттің сипаттамасы фондық режимде өтеді, және белсенді тапсырмалардың мәртебесі Курс туралы ақпаратпен бетбелгіде пайда болады. Осы тапсырмамен байланысты барлық тапсырмалардың мәртебесін қарау үшін мына бастырмаға басыңыз.

source: Show Background Task History for Problem
kk_kz: Фондық тапсырмалардың міндеттер үшін тарихын көрсету

source: None Available
kk_kz: Ештеңе қолжетімсіз

source: Change Preferred Language
kk_kz: Тіл артықшылықтарын өзгерту

source: Please choose your preferred language
kk_kz: Тіл артықшылықтарын баптаңыз

source: Save Language Settings
kk_kz: Тіл артықшылықтарын сақтау

source: Don't see your preferred language? {link_start}Volunteer to become a translator!{link_end}
kk_kz: Сізге қажетті тілді таба алмадыңыз ба? {link_start} Аудармашы-еріктілер болыңыз!{link_end}

source: modal open
kk_kz: модаль терезе ашық

source: {course_number} Combined Notifications
kk_kz: {course_number} Біріккен хабарламалар

source: Open Ended Console
kk_kz: Аяқталмағандық консолі

source: Here are items that could potentially need your attention.
kk_kz: Міне сіздің назарыңыз талап етілетін оқиғалар.

source: No items require attention at the moment.
kk_kz: Осы уақытта назар аударуды қажет ететін оқиғалар жоқ

source: {course_number} Flagged Open Ended Problems
kk_kz: {course_number} Белгіленген шешілмеген тапсырмалар

source: Flagged Open Ended Problems
kk_kz: Белгіленген шешілмеген тапсырмалар

source: Here are a list of open ended problems for this course that have been flagged by students as potentially inappropriate.
kk_kz: Міне әлеуетті қабылдауға болмайтындар ретінде студенттермен белгіленген, осы курс үшін шешілмеген міндеттер тізімі.

source: No flagged problems exist.
kk_kz: Белгіленген міндеттер жоқ

source: Unflag
kk_kz: Белгіні алып тастау

source: Ban
kk_kz: Бан

source: {course_number} Open Ended Problems
kk_kz: {course_number} орындалмаған міндеттер

source: Open Ended Problems
kk_kz: Шешілмеген міндеттер

source: Here is a list of open ended problems for this course.
kk_kz: Осы курста әлі шешілмеген тапсырмалардың тізімі

source: You have not attempted any open ended problems yet.
kk_kz: Сіз әлі бірде бір қозғалмаған тапсырманың шешімін бастамадыңыз

source: Problem Name
kk_kz: Міндеттің атауы

source: Grader Type
kk_kz: Бағалаушының үлгісі

source: {p_tag}You currently do not have any peer grading to do. In order to have peer grading to do: {ul_tag} {li_tag}You need to have submitted a response to a peer grading problem.{end_li_tag} {li_tag}The instructor needs to score the essays that are used to help you better understand the grading criteria.{end_li_tag} {li_tag}There must be submissions that are waiting for grading.{end_li_tag} {end_ul_tag} {end_p_tag}
kk_kz: {p_tag} Қазір сізде курстасты бағалау бойынша ешбір міндеттер жоқ. Сондай тапсырманы алу үшін: \n {ul_tag}\n {li_tag} Сізге курстастың жұмысын бағалау бойынша тапсырмаға жауап жіберу керек.{end_li_tag}\n {li_tag} Оқытушыға бағалау критерийлерін жақсы түсіну үшін пайдаланылатын материалдарды бағалауға қосу керек.{end_li_tag}\n {li_tag}Бағалауды күтетін жіберілген жұмыстар болуы тиіс. {end_li_tag}\n {end_ul_tag}\n {end_p_tag}\n

source: Peer Grading
kk_kz: Басқа студенттердің бағалауы

source: Here are a list of problems that need to be peer graded for this course.
kk_kz: Осы курс үшін пайдаланушылар бағалауы тиіс міндеттердің тізімі

source: Due date
kk_kz: Мерзімі

source: Available
kk_kz: Қолжетімді

source: Required
kk_kz: Талап етіледі

source: No due date
kk_kz: Мерзімінде емес

source: The due date has passed, and peer grading for this problem is closed at this time.
kk_kz: Мерзімі өтті. Осы міндет үшін пайдаланушылардың бағалауы қазіргі уақытта жабық.

source: The due date has passed, and peer grading is closed at this time.
kk_kz: Мерзімі өтті және пайдаланушылардың бағалауы қазіргі уақытта жабық.

source: Learning to Grade
kk_kz: Бағалауға оқыту

source: Please include some written feedback as well.
kk_kz: Қандай да бір жазбаша пікірді қосыңыз

source: This submission has explicit, offensive, or (I suspect) plagiarized content.
kk_kz: Осы деректер шамадан тыс ашық, қорлаушы немесе плагиатты (менде осылай деп болжау үшін негіз бар) қамтиды.

source: How did I do?
kk_kz: Мен қалай орындадым?

source: Continue
kk_kz: Жалғастыру

source: Ready to grade!
kk_kz: Бағалауға дайынмын!

source: You have finished learning to grade, which means that you are now ready to start grading.
kk_kz: Бағалау жүйесімен танысу аяқталды. Енді сіз оларды қою үшін дайынсыз.

source: Start Grading!
kk_kz: Бағалауды бастау!

source: Learning to grade
kk_kz: Бағалауға оқыту

source: You have not yet finished learning to grade this problem.
kk_kz: Сіз осы міндетті бағалауды оқуды әлі аяқамадыңыз

source: You will now be shown a series of instructor-scored essays, and will be asked to score them yourself.
kk_kz: Енді Сізге оқытушылармен бағаланған эссенің сериясы көрсетілетін болады, және Сізді өздігінен баллдарды қоюды сұрайды

source: Once you can score the essays similarly to an instructor, you will be ready to grade your peers.
kk_kz: Сіз оқытушы сияқты баллдарды қоя алғаннан кейін, Сіз өз оқушыларыңызды бағалауға дайын боласыз.

source: Start learning to grade
kk_kz: Бағалауға оқытуды бастау

source: Are you sure that you want to flag this submission?
kk_kz: Сіз осы материалды белгілегіңіз келетініне сенімдісіз бе?

source: You are about to flag a submission. You should only flag a submission that contains explicit, offensive, or (suspected) plagiarized content. If the submission is not addressed to the question or is incorrect, you should give it a score of zero and accompanying feedback instead of flagging it.
kk_kz: Сіз жіберілген құжатты белгілейін деп жатырсыз. Сіз ашық, қорлаушы немесе плагиат (шамамен) қамтылатын жіберілген деректерді ғана белгілеуіңіз тиіс. Егер жіберілген деректер мәселеге сәйкес болмаса немесе дұрыс емес болса, сіз оларды нөл баллмен бағалауыңыз және белгілеудің орнына пікірмен ілестіруіңіз қажет.

source: Remove Flag
kk_kz: Белгіні алып тастау

source: Keep Flag
kk_kz: Белгіні қалдыру

source: Go Back
kk_kz: Қайту

source: Thanks For Registering!
kk_kz: Тіркелгеніңіз үшін рахмет!

source: Your account is not active yet. An activation link has been sent to {email}, along with instructions for activating your account.
kk_kz: Сіздің аккаунт әлі белсенді емес. Белсендендіру сілтемесі {email} жіберілді, онда аккаунтты белсендендіру бойынша нұсқаулық бар.

source: Activation Complete!
kk_kz: Белсендендіру аяқталды!

source: Account already active!
kk_kz: Есептік жазба белсендендірілді!

source: You can now {link_start}log in{link_end}.
kk_kz: Енді Сіз {link_end} кіре {link_start} аласыз.

source: Activation Invalid
kk_kz: Белсендендіру жарамды емес

source: Something went wrong. Check to make sure the URL you went to was correct -- e-mail programs will sometimes split it into two lines. If you still have issues, e-mail us to let us know what happened at {email}.
kk_kz: Бір нәрсе дұрыс емес. Сіз дұрыс сілтеме бойынша өткеніңізге көз жеткізіңіз. Кейбір кезде почта жүйесі сілтемені екі жолға бөледі. Егер сізде сонда да мәселелер пайда болса, бізге {email} жазыңыз.

source: Or you can go back to the {link_start}home page{link_end}.
kk_kz: Немесе {link_end} үй бетінің {link_start} қайту

source: Password reset successful
kk_kz: Пароль ойдағыдай ысырылды

source: We've e-mailed you instructions for setting your password to the e-mail address you submitted. You should be receiving it shortly.
kk_kz: Біз e-mail нұсқаулықтарды жібердік, Сіз көрсеткен e-mail мекенжайына парольді қалай орнату керек. Сіз оларды жақын арада аласыз.

source: Download CSV Data
kk_kz: CSV форматында деректерді көшіріп жүктеу

source: These reports are delimited by start and end dates.
kk_kz: Осы есептер басталу және аяқталу күндерімен бөлінеді.

source: Start Date:
kk_kz: Басталу күні:

source: End Date:
kk_kz: Аяқталу күні:

source: These reports are delimited alphabetically by university name. i.e., generating a report with 'Start Letter' A and 'End Letter' C will generate reports for all universities starting with A, B, and C.
kk_kz: Осы есептер оқу орнының атауы бойынша әліпби бойынша реттелген, осылай А 'Бастапқы әріпімен' және С 'Соңғы әріпімен' есепті құру A, B және C басталатын барлық оқу орындары үшін есептерді шығарады.

source: Start Letter:
kk_kz: Хаттың басы:

source: End Letter:
kk_kz: Хаттың аяғы:

source: Payment Error
kk_kz: Төлемнің қателігі

source: There was an error processing your order!
kk_kz: Сіздің тапсырмаңызды өткізген кезде қателік пайда болды!

source: Your Shopping Cart
kk_kz: Сіздің қоржыныңыз

source: Your selected items:
kk_kz: Сіз таңдаған атау:

source: Unit Price
kk_kz: Бірлік бағасы

source: Price
kk_kz: Баға

source: Total Amount
kk_kz: Жалпы саны

source: You have selected no items for purchase.
kk_kz: Сіз сатып алу үшін атауларды таңдамадыңыз

source: Register for [Course Name] | Receipt (Order
kk_kz: [Курстың атауы] үшін тіркелу | Чек (Тапсырма

source: () Electronic Receipt
kk_kz: () Электрондық чек

source: Order #
kk_kz: Тапсырма #

source: Date:
kk_kz: Күні:

source: Items ordered:
kk_kz: Тапсырылған атаулар

source: Billed To:
kk_kz: Берілген жүкқұжат

source: Receipt (Order
kk_kz: Чек (Тапсырма

source: You are now registered for:
kk_kz: Енді Сіз ....үшін тіркелдіңіз

source: Registered as:
kk_kz: ретінде тіркелдіңіз

source: ID Verified
kk_kz: Құжат расталды

source: Your Progress
kk_kz: Сіздің алға басуыңыз

source: Current Step:
kk_kz: Ағымдағы қадам:

source: Intro
kk_kz: Кіріспе

source: Take Photo
kk_kz: Сурет түсіру

source: Take ID Photo
kk_kz: Құжаттың суретін түсіру

source: Review
kk_kz: Қарау

source: Make Payment
kk_kz: Төлеу

source: Confirmation
kk_kz: Растау

source: Congratulations! You are now verified on
kk_kz: Құттықтаймыз! Сіз енді расталдыңыз

source: You are now registered as a verified student! Your registration details are below.
kk_kz: Енді Сіз расталған студент ретінде тіркелдіңіз! Сіздің тіркелу бөлшектеріңіз төменде келтірілген.

source: You are registered for:
kk_kz: Сіз ....ретінде тіркелдіңіз

source: A list of courses you have just registered for as a verified student
kk_kz: Сіз дәл қазір расталған студент ретінде тіркелген курстардың тізімі

source: Options
kk_kz: Опциялар

source: Starts: {start_date}
kk_kz: Басы: {start_date}

source: Go to Course
kk_kz: Курсқа өту

source: Go to your Dashboard
kk_kz: Сіздің үстеліңізге өту

source: Verified Status
kk_kz: Расталған мәртебе

source: We have received your identification details to verify your identity. If there is a problem with any of the items, we will contact you to resubmit. You can now register for any of the verified certificate courses this semester without having to re-verify.
kk_kz: Сіздің тұлғаңызды растау үшін біз Сіздің құжаттың деректерін алдық. Егер кез-келген пәнмен проблема болса, жазылуды қайта ресімдеу үшін біз сізбен байланысамыз. Енді Сіз жаңа растау қажеттілігінсіз осы семестрде куәландырылған сертификаттармен курстардың кез келгені үшін тіркеле аласыз.

source: The professor will ask you to periodically submit a new photo to verify your work during the course (usually at exam times).
kk_kz: Курс ішінде сіздің жұмысыңызды растау үшін профессор (Сізден жаңа суретті кезең-кезеңмен қоса жалғауды сұрайды.)

source: Payment Details
kk_kz: Төлемнің егжей-тегжейлері

source: Please print this page for your records; it serves as your receipt. You will also receive an email with the same information.
kk_kz: Есептілік үшін осы бетті басып шығарыңыз; ол Сіздің чегіңіз ретінде пайдаланылады. Сіз сондай-ақ осы ақпаратпен e-mail аласыз.

source: Order No.
kk_kz: Тапсырыс No.

source: Total
kk_kz: Жалпы

source: Billed To
kk_kz: Берілген жүкқұжат

source: The page that you were looking for was not found. Go back to the {link_start}homepage{link_end} or let us know about any pages that may have been moved at {email}.
kk_kz: Сіз іздеген бет жоқ. {link_end} үй бетіне {link_start} оралыңыз немесе e-mail хабарымен{email} ауыстырылуы мүмкін кез келген беттер туралы бізге хабарлаңыз.

source: This page left intentionally blank. It is not used by edx.org but is left here for possible use by installations of Open edX.
kk_kz: Бұл бет әдейі бос қалдырылған. Ол edx.org сайтымен пайдаланылмайды, бірақ мұнда Open edX орнатқан кезде пайдалану үшін қалдырылған.

source: This Course Unavailable In Your Country
kk_kz: Осы курс Сіздің бет үшін қолжетімсіз

source: Our system indicates that you are trying to access an edX course from an IP address associated with a country currently subjected to U.S. economic and trade sanctions. Unfortunately, at this time edX must comply with export controls, and we cannot allow you to access this particular course. Feel free to browse our catalogue to find other courses you may be interested in taking.
kk_kz: АҚШ тарабынан ағымдағы экономикалық және сауда санкцияларына кіретін елмен қауымдасқан сіз IP-мекенжайы арқылы edX курсына қолжетімділікті алуға талпынғаныңызды біздің жүйе көрсетті. Өкінішке орай edX осы уақытта осы шектеулерді толық сақтауы керек, және біз сізге курсқа қолжетімділікті ұсына алмаймыз. Сіз қатысқыңыз келетін басқа курстарды табу үшін біздің каталогтарды пайдаланыңыз.

source: Media Kit
kk_kz: Медиафайлдар пакеті

source: In the Press
kk_kz: Баспасөз басылымы

source: Currently the {platform_name} servers are down
kk_kz: Қазіргі уақытта {platform_name} серверлері қолжетімсіз

source: Our staff is currently working to get the site back up as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
kk_kz: Біздің қызметкерлер сайтқа қолжетімділікті тезірек қалпына келтіруге тырысады. Пайда болған проблемалар және олқылықтар туралы хабарлау үшін {tech_support_email} мекенжайына хабар жіберіңіз.

source: There has been a 500 error on the {platform_name} servers
kk_kz: {platform_name} серверлеріндегі 500 қателік

source: Please wait a few seconds and then reload the page. If the problem persists, please email us at {email}.
kk_kz: Бірнеше секунд күтіңіз, содан кейін бетті қайта жүктеңіз. Егер проблема түзетілмесе, {email} мекенжайы бойынша бізбен байланысыңыз.

source: Currently the {platform_name} servers are overloaded
kk_kz: Қазіргі уақытта {platform_name} серверлердің жүктемесі шамадан көп

source: Edit Your Name
kk_kz: Сіздің атыңызды редакциялаңыз

source: The following error occurred while editing your name:
kk_kz: Сіздің атыңызды редакциялаған кезде мынадай қателік пайда болды:

source: To uphold the credibility of {platform} certificates, all name changes will be logged and recorded.
kk_kz: {platform} сертификаттарының беделін қолдау үшін аттарды ауыстырудың барлық фактілері бақыланатын және жазылатын болады.

source: Change my name
kk_kz: Менің атымды өзгерту

source: Why Do I Need to Re-Verify?
kk_kz: Қайта анықтау неге талап етіледі?

source: At key points in a course, the professor will ask you to re-verify your identity. We will send the new photo to be matched up with the photo of the original ID you submitted when you signed up for the course.
kk_kz: Курстың негізгі кездерінде, профессор сіздің тұлғаңызды растауды сұрайды. Сіз курсқа тіркелу кезінде сіз көрсеткен түпнұсқа ID суретімен салыстыру үшін жаңа суретті жіберуіңіз керек.

source: Having Technical Trouble?
kk_kz: Техникалық проблемалар бар ма?

source: Please make sure your browser is updated to the <strong>{a_start}most recent version possible{a_end}</strong>. Also, please make sure your <strong>web cam is plugged in, turned on, and allowed to function in your web browser (commonly adjustable in your browser settings)</strong>
kk_kz: Сіздің браузеріңіз {a_end}</strong> ең кейінгі қолжетімді нұсқасына дейін <strong>{a_start} жаңартылғанына көз жеткізіңіз. Сондай-ақ, Сіздің <strong> веб камераңыз компьютерге қосылғанына және ажыратылғанына, ал оны пайдалану Сіздің </strong> браузерде рұқсат етілгеніне көз жеткізіңіз (әдетте Сіздің браузердің бапталымдарында қолжетімді).
