Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Sign up for {platform_name} today!
kk_kz: {platform_name} қол жеткізу үшін бүгін тіркеліңіз!

source: Looking for help in logging in or with your {platform_name} account?
kk_kz: Кіру кезінде немесе сіздің {platform_name} аккаунтыңызбен көмек керек пе?

source: View our help section for answers to commonly asked questions.
kk_kz: Жиі қойылатын сұрақтарға жауаптарды оқу үшін біздің көмек бөліміне кіріңіз

source: Log into your {platform_name} Account
kk_kz: Сіздің {platform_name} есептік жазбаңызға кіру

source: Log into My {platform_name} Account
kk_kz: Сіздің {platform_name} есептік жазбаңызға кіру

source: Access My Courses
kk_kz: Менің курстарымды қарау

source: Processing your account information…
kk_kz: Сіздің аккаутыңыздың деректерін пысықтау өтуде

source: Please log in
kk_kz: Жүйеге кіруіңізді өтінеміз

source: to access your account and courses
kk_kz: Өз аккаутыңызға және курстарыңызға қол жеткізуді алу үшін

source: We're Sorry, {platform_name} accounts are unavailable currently
kk_kz: Кешірім өтінеміз, {platform_name} есептік жазбалар осы уақытта қолжетімсіз

source: The following errors occurred while logging you in:
kk_kz: Жүйеге кіру кезінде мынадай қателіктер пайда болды:

source: Your email or password is incorrect
kk_kz: Электрондық мекенжай немесе пароль дұрыс емес енгізілді

source: Please provide the following information to log into your {platform_name} account. Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
kk_kz: Сіздің {platform_name} есептік жазбаңызға қол жеткізу үшін мынадай ақпаратты көрсетіңіз. Міндетті алаптар қара жалпақ мәтінмен <strong class="indicator"> және (*)</strong> жұлдызшамен белгіленген.

source: example: username@domain.com
kk_kz: үлгі: username@domain.com

source: Account Preferences
kk_kz: Есептік жазбаның бапталымдары

source: Remember me
kk_kz: Мені есте сақтау

source: External resource
kk_kz: Сыртқы көз

source: View resource in a new window
kk_kz: Жаңа терезеде қарау

source: Please provide launch_url. Click "Edit", and fill in the required fields.
kk_kz: launch_url ұсыныңыз. \"Редакциялауды\" басыңыз және қажетті алаптарды толтырыңыз.

source: Press to Launch
kk_kz: Іске қосуды басыңыз

source: Disable or Reenable student accounts
kk_kz: Студенттердің аккаунттарын ажырату немесе белсендендіру

source: Username:
kk_kz: Пайдаланушының аты:

source: Disable Account
kk_kz: Есептік жазбаны пайдалануға тыйым салу

source: Reenable Account
kk_kz: Аккаунтты белсендендіру

source: Students whose accounts have been disabled
kk_kz: Есептік жазбалары бұғатталған студенттер. Жаңарту үшін бетті қайта жүктеңіз.

source: working...
kk_kz: орындау...

source: This page features MathJax technology to render mathematical formulae. To make math accessibile, we suggest using the MathPlayer plugin. Please visit the {link_start}MathPlayer Download Page{link_end} to download the plugin for your browser.
kk_kz: Математикалық формулаларды жазу үшін осы бет Mathjax технологиясын пайдаланады. Олар дұрыс бейнелену үшін біз MathPlayer плагинін пайдалануды ұсынамыз. Сіздің браузеріңіз үшін плагинді жүктеу үшін {link_start}MathPlayer Download Page{link_end} сілтемесі бойынша өтіңіз.

source: Your browser does not support the MathPlayer plugin. To use MathPlayer, please use Internet Explorer 6 through 9.
kk_kz: Сіздің браузеріңіз MathPlayer плагинін қолдамайды. MathPlayer пайдалану үшін 6 бастап 9 дейін Internet Explorer пайдаланыңыз.

source: There has been an error on the {platform_name} servers
kk_kz: {platform_name} серверлеріндегі қателік

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible. Please email us at {tech_support_email} to report any problems or downtime.
kk_kz: Өкінішке орай, осы модуль уақытша қолжетімсіз. Біздің қызметкерлеріміз проблеманы тезірек жоюға тырысады. Пайда болған проблемалар және олқылықтар туралы хабарлау үшін {tech_support_email} мекенжайына хабар жіберіңіз.

source: Raw data:
kk_kz: Өңделмеген деректер:

source: Accepted
kk_kz: Қабылданды

source: Rejected
kk_kz: Бас тартылды

source: Pending name changes
kk_kz: Процесте аттарды ауыстыру

source: Confirm
kk_kz: Растау

source: [Reject]
kk_kz: [Бас тарту]

source: Global Navigation
kk_kz: Ғаламдық навигация

source: Find Courses
kk_kz: Курстарды табу

source: Dashboard for:
kk_kz: үшін үстел

source: More options dropdown
kk_kz: Көбірек опциялар, ашылма мәзір

source: Log Out
kk_kz: Шығу

source: How it Works
kk_kz: Бұл қалай жұмыс істейді

source: Courses
kk_kz: Курстар

source: Schools
kk_kz: Университеттер

source: Register Now
kk_kz: Дәл қазір тіркеліңіз

source: Log in
kk_kz: Кіру

source: <strong>Warning:</strong> Your browser is not fully supported. We strongly recommend using {chrome_link_start}Chrome{chrome_link_end} or {ff_link_start}Firefox{ff_link_end}.
kk_kz: <strong>Ескерту:</strong>Сіздің браузерге толық қолдау көрсетілмейді. Біз {chrome_link_start}Chrome{chrome_link_end} или {ff_link_start}Firefox{ff_link_end} пайдалануды ұсынамыз.

source: You do not have any notes.
kk_kz: Сізде бірде бір жазба жоқ.

source: Reset
kk_kz: Ысыру

source: Reveal Answer
kk_kz: Жауапты ашу

source: You have used {num_used} of {num_total} submissions
kk_kz: Сіз қарастыруға өз материалдарыңызды жіберу {num_total} мүмкіндіктерінен {num used} пайдаландыңыз

source: Log In
kk_kz: Кіру

source: Your username, email, and full name will be sent to {destination}, where the collection and use of this information will be governed by their terms of service and privacy policy.
kk_kz: Сіздің пайдаланушы атыңыз, электрондық мекенжайыңыз және толық атыңыз {destination} жіберілетін болады, мұнда егжей-тегжейлі ақпаратты жинау және пайдалану қызметтерді ұсынудың олардың жеке шарттарымен және құпиялылық саясатымен реттелетін болады.

source: Return To %s
kk_kz: %s қайту

source: Preferences for {platform_name}
kk_kz: {platform_name} үшін бапталымдар

source: Update my {platform_name} Account
kk_kz: Менің {platform_name} аккаунтымды жаңарту

source: Processing your account information …
kk_kz: Сіздің аккаунтыңыздың деректерін өңдеу өтуде

source: Welcome {username}! Please set your preferences below
kk_kz: Қош келдіңіз, {username}! Сіздің бапталымдарыңызды төменде көрсетіңіз.

source: We're sorry, {platform_name} enrollment is not available in your region
kk_kz: Кешірім өтінеміз, сіздің өңіріңізде {platform_name} қатысу қолжетімсіз.

source: The following errors occurred while processing your registration:
kk_kz: Сіздің тіркеуге арналған өтініміңізді өңдеу уақытында мынадай қателіктер пайда болды:

source: Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
kk_kz: Толтыру үшін міндетті алаптар қара жалпақ мәтінмен <strong class="indicator"> және (*)</strong> жұлдызшамен белгіленген.

source: Enter a public username:
kk_kz: Пайдаланушының жария атын енгізіңіз:

source: example: JaneDoe
kk_kz: үлгі: JaneDoe

source: Will be shown in any discussions or forums you participate in
kk_kz: Сіз қатысатын кез келген пікірталастарда немесе форумдарда бейнеленетін болады

source: Account Acknowledgements
kk_kz: Есептік жазбаны мойындау

source: I agree to the {link_start}Terms of Service{link_end}
kk_kz: Мен {link_end} қызметтерді ұсынудың шарттарымен {link_start} келісемін

source: I agree to the {link_start}Honor Code{link_end}
kk_kz: Мен {link_end} ар-намыс кодексімен {link_start} келісемін

source: Update My Account
kk_kz: Менің есептік жазбамды жаңарту

source: Registration Help
kk_kz: Тіркеуге көмек

source: Already registered?
kk_kz: Тіркелдіңіз бе?

source: Click here to log in.
kk_kz: Кіру үшін мұнда басыңыз

source: Welcome to {platform_name}
kk_kz: {platform_name} қош келдіңіз

source: Registering with {platform_name} gives you access to all of our current and future free courses. Not ready to take a course just yet? Registering puts you on our mailing list - we will update you as courses are added.
kk_kz: {platform_name} тіркелу сізге біздің барлық ағымдағы және алдағы ақысыз курстарымызға қол жетімділікті береді. Курста қатысуға әлі дайын емессіз бе? Тіркеу сізді біздің таратуымызға жазады – біз сізге жаңа курстардың қосылуы туралы хабарлаймыз

source: Next Steps
kk_kz: Дұдан арғы қадамдар

source: You will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark emails from class.stanford.edu as 'not spam', since you'll want to be able to receive email from your courses.
kk_kz: Сіз белсендендіру үшін хат алдыңыз. Процесті аяқтау үшін, сіз одан алынған сілтеме бойынша өтуіңіз керек. Хатты көріп тұрған жоқсыз ба? Спаммен өз папкаңызды тексеріңіз және class.stanford.edu хаттарын 'спам емес' ретінде белгілеңіз, өйткені сіз қатысатын курстардың хат-хабарларын алғыңыз келетіні сөзсіз.

source: As part of joining {platform_name}, you will receive an activation email. You must click on the activation link to complete the process. Don't see the email? Check your spam folder and mark {platform_name} emails as 'not spam'. At {platform_name}, we communicate mostly through email.
kk_kz: {platform_name} жалғасу процесінде сіз белсендендіру үшін хатты аласыз. Процесті аяқтау үшін, сіз одан алынған сілтеме бойынша өтуіңіз керек. Хатты көріп тұрған жоқсыз ба? Спаммен өз папкаңызды тексеріңіз және {platform_name} хаттарын «спам емес» ретінде белгілеңіз. {platform_name} негізінде электрондық почта арқылы байланысты қолдайды.

source: Need help in registering with {platform_name}?
kk_kz: {platform_name} тіркелуге көмек керек пе?

source: View our FAQs for answers to commonly asked questions.
kk_kz: Жиі қойылатын сұрақтарға жауаптарды оқу үшін ЖҚС бөліміне кіріңіз.

source: Once registered, most questions can be answered in the course specific discussion forums or through the FAQs.
kk_kz: Сіз тіркелгеннен кейін, көптеген сұрақтарға жауаптарды жеке курстардың форумдарында немесе ЖҚС бөлімінде табуға болады.

source: Register for {platform_name}
kk_kz: {platform_name} тіркелу

source: Create My {platform_name} Account
kk_kz: {platform_name} менің есептік жазбамды құру

source: Welcome!
kk_kz: Қош келдіңіз!

source: Register below to create your {platform_name} account
kk_kz: {platform_name} Сіздің аккаутыңызды құру үшін төменде тіркеліңіз

source: Please complete the following fields to register for an account.
kk_kz: Жаңа есептік жазбаны құру үшін мынадай алаптарды толтырыңыз.

source: cannot be changed later
kk_kz: кейін өзгертуге болмайды

source: example: Jane Doe
kk_kz: үлгі: Jane Doe

source: Needed for any certificates you may earn
kk_kz: Сіз ала алатын кез келген сертификаттар үшін қажет

source: Welcome {username}
kk_kz: Қош келдіңіз {username}

source: Enter a Public Display Name:
kk_kz: Пайдаланушының Жария Бейнеленетін Атын енгізіңіз:

source: Public Display Name
kk_kz: Жария Бейнеленетін Ат

source: Extra Personal Information
kk_kz: Қосымша жеке ақпарат

source: City
kk_kz: Қала

source: example: New York
kk_kz: мысалы: Нью-Йорк

source: Country
kk_kz: Ел

source: Highest Level of Education Completed
kk_kz: Сіз аяқтаған білімнің ең жоғары деңгейі

source: Year of Birth
kk_kz: Туған жылы

source: Please share with us your reasons for registering with {platform_name}
kk_kz: {platform_name} тіркелу себептерімен бөлісуіңізді өтінеміз

source: Register
kk_kz: Тіркеу

source: Create My Account
kk_kz: Менің есептік жазбамды құру

source: Re-subscribe Successful!
kk_kz: Жазылым ойдағыдай жаңартылды!

source: You have re-enabled forum notification emails from {platform_name}. Click {dashboard_link_start}here{link_end} to return to your dashboard.
kk_kz: Сіз {platform_name} хабарды қайта белсендендірдіңіз. мұнда {dashboard_link_start}, басқару үстеліне қайту үшін {link_end} басыңыз.

source: Previous
kk_kz: Алдыңғы

source: Section Navigation
kk_kz: Бөлім бойынша навигация

source: Next
kk_kz: Кейінгі

source: Sign Up for {platform_name}
kk_kz: {platform_name} Есептік Жазбаны құру

source: e.g. yourname@domain.com
kk_kz: мысалы, yourname@domain.com

source: e.g. yourname (shown on forums)
kk_kz: мысалы, сіздің атыңыз (форумдарда бейнеленеді)

source: e.g. Your Name (for certificates)
kk_kz: мысалы, Сіздің Атыңыз (сертификаттар үшін)

source: <i>Welcome</i> {name}
kk_kz: <i>Қош келдіңіз,</i> {name}

source: Full Name *
kk_kz: Толық аты*

source: Ed. Completed
kk_kz: Алынған білім

source: Year of birth
kk_kz: Туған жылы

source: Mailing address
kk_kz: Почталық мекенжай

source: Goals in signing up for {platform_name}
kk_kz: {platform_name} тіркелетін мақсаттар

source: Already have an account?
kk_kz: Есептік жазба бар ма?

source: Login.
kk_kz: Кіру.

source: Group {group_id}
kk_kz: {group_id} тобы

source: Staff Debug Info
kk_kz: Қызметкерлер үшін жөнге келтірілетін ақпарат

source: Submission history
kk_kz: Тексеруге материалдарды беру тарихы

source: {platform_name} Content Quality Assessment
kk_kz: {platform_name} мазмұнының сапасын бақылау қызметі

source: Comment
kk_kz: Түсініктемелер

source: comment
kk_kz: түсініктемелер

source: Tag
kk_kz: Тег

source: Optional tag (eg "done" or "broken"):
kk_kz: Міндетті емес тег (мысалы, \"аяқталды\" or \"жұмыс істемейді\"):

source: tag
kk_kz: тег

source: Add comment
kk_kz: Түсініктемелер қосу

source: Staff Debug
kk_kz: Қызметкерлер үшін жөнге келтіру

source: Reset Student Attempts
kk_kz: Студенттің талпыныстарын ысыру

source: Rescore Student Submission
kk_kz: Студент берген тапсырманы қайта тексеру

source: Module Fields
kk_kz: Нысан алаптары

source: XML attributes
kk_kz: XML атрибуттары

source: Submission History Viewer
kk_kz: Тексеруге материалдарды беру тарихын қарау құралы

source: User:
kk_kz: Пайдаланушы:

source: View History
kk_kz: Тарихты қарау

source: {course_number} Textbook
kk_kz: {course_number} оқулығы

source: Textbook Navigation
kk_kz: Оқулық бойынша навигация

source: Previous page
kk_kz: Алдыңғы бет

source: Next page
kk_kz: Кейінгі бет

source: Sysadmin Dashboard
kk_kz: Жүйелік әкімшінің үстелі

source: Users
kk_kz: Пайдаланушылар

source: Staffing and Enrollment
kk_kz: Жинау және кіркелу

source: Git Logs
kk_kz: Git логині

source: User Management
kk_kz: Пайдаланушылардың есептік жазбаларын басқару

source: Email or username
kk_kz: Электрондық почтаның мекенжайы немесе пайдаланушының аты

source: Delete user
kk_kz: Пайдаланушыны жою

source: Create user
kk_kz: Пайдаланушыны құру

source: Download list of all users (csv file)
kk_kz: Барлық пайдаланушылардың тізімін жүктеу (csv файлы)

source: Check and repair external authentication map
kk_kz: Сыртқы картаны тексеру және қалпына келтіру

source: Go to each individual course's Instructor dashboard to manage course enrollment.
kk_kz: Қабылдануды басқару үшін курс нұсқаушысының жеке үстеліне жүгініңіз.

source: Manage course staff and instructors
kk_kz: Курстың персоналының және оқытушыларының тізімін басқару

source: Download staff and instructor list (csv file)
kk_kz: Қызметкерлер және оқытушылар тізімін жүктеу (csv file)

source: Administer Courses
kk_kz: Курстарды басқару

source: Repo Location
kk_kz: Репозиторийдің орналасқан жері

source: Repo Branch (optional)
kk_kz: git репозиторийдің бөлімі (опционалды)

source: Load new course from github
kk_kz: Github жаңа курсты жүктеу

source: Course ID or dir
kk_kz: Курстың ID немесе каталогы

source: Delete course from site
kk_kz: Сайттан курсты жою

source: Platform Version
kk_kz: Тұғырдың нұсқасы

source: Date
kk_kz: Күні

source: Git Action
kk_kz: Git операциясы

source: Source:
kk_kz: Көз:

source: Tracking Log
kk_kz: Бақылау журналы

source: type
kk_kz: үлгісі

source: Unsubscribe Successful!
kk_kz: Хабарламаларды алудан бас тарту қабылданды!

source: You will no longer receive forum notification emails from {platform_name}. Click {dashboard_link_start}here{link_end} to return to your dashboard. If you did not mean to do this, click {undo_link_start}here{link_end} to re-subscribe.
kk_kz: Сіз {platform_name} форумынан хабарландыруларды енді алмайтын боласыз. Мұнда {dashboard_link_start}, басқару үстеліне қайту үшін {link_end} басыңыз. Еге Сіз жазылымнан кездейсоқ бас тартсаңыз, мұнда {undo_link_start}, хабарламаларды қайта белсендендіру үшін {link_end} басыңыз.

source: Using the system
kk_kz: Жүйені пайдалану

source: During video playback, use the subtitles and the scroll bar to navigate. Clicking the subtitles is a fast way to skip forwards and backwards by small amounts.
kk_kz: Бейнені қарау уақытында, субтитрлерді және навигация үшін айналдыру үстелін пайдаланыңыз. Субтитрлерге басу – ілгері және кейін жылжудың ең тез тәсілі

source: If you are on a low-resolution display, the left navigation bar can be hidden by clicking on the set of three left arrows next to it.
kk_kz: Егер сіздің монитордың рұқсаттық қабілеті төмен болса, қалған үш жиынды басып сол жақтағы навигациялық үстелді жасыруға болады

source: If you need bigger or smaller fonts, use your browsers settings to scale them up or down. Under Google Chrome, this is done by pressing ctrl-plus, or ctrl-minus at the same time.
kk_kz: Егер сізге біршама ірі шрифттар керек болса, олардың масштабын жоғарылату немесе төмендету үшін өз браузеріңіздің бапталымдарын пайдаланыңыз. Google Chrome оны Ctrl и + немесе Ctrl и – бір уақытта басып істеуге болады.

source: Skip to a navigable version of this video's transcript.
kk_kz: Бейне мәтінінің басқарылатын нұсқасына өту

source: Loading video player
kk_kz: Бейне плеерды жүктеу өтуде

source: Play video
kk_kz: Бейнені қарау

source: Video position
kk_kz: Бейненің позициясы

source: Play
kk_kz: Жүргізу

source: Speeds
kk_kz: Жылдамдық

source: Speed
kk_kz: Жылдамдық

source: Volume
kk_kz: Дыбыс

source: Fill browser
kk_kz: Браузер көлемдерін үйлестіру

source: HD off
kk_kz: HD өшірілген

source: Turn off captions
kk_kz: Субтитрлерді ажырату

source: Skip to end of transcript.
kk_kz: Стенограмманың аяғына өту.

source: Activating an item in this group will spool the video to the corresponding time point. To skip transcript, go to previous item.
kk_kz: Тиісті нүктеге тармақты белсендендіру кезінде осы топта бейне айналдырылады. Титрлерден өтіп кету үшін алдыңғы тармаққа өтіңіз.

source: Go back to start of transcript.
kk_kz: Стенограмманың басына қайту

source: Download video
kk_kz: Бейнені көшіріп жүктеу

source: Download transcript
kk_kz: Мәтінді көшіріп жүктеу

source: Download Handout
kk_kz: көрнекті материал көшіріп жүктеу

source: Your words:
kk_kz: Сіздің сөздеріңіз:

source: Total number of words:
kk_kz: Сөздердің жалпы саны:

source: Open Response
kk_kz: Жауапты ашу

source: Assessments:
kk_kz: Өлшемдер:

source: Hide Question
kk_kz: Сұрақты жасыру

source: New Submission
kk_kz: Жаңа тапсырма

source: Next Step
kk_kz: Келесі қадам

source: Staff Warning: Please note that if you submit a duplicate of text that has already been submitted for grading, it will not show up in the staff grading view. It will be given the same grade that the original received automatically, and will be returned within 30 minutes if the original is already graded, or when the original is graded if not.
kk_kz: Персоналды ескерту: Егер сіз бағалауға жіберілген мәтіннін телнұсқасын жіберсеңіз, онда ол бағаланатындар тізімінде бейнеленбейтінін еске сақтаңыз. Осы мәтінге сол баға автоматты меншіктелетін болады, және егер түпнұсқа материал бағаланған болса, немесе түпнұсқа мәтінін бағалау уақытында егер баға меншіктелмеген болса, ол 30 минуттың ішінде қайтарылатын болады.

source: Legend
kk_kz: Ашып жазу

source: Submitted Rubric
kk_kz: Салынған айдарлар

source: Toggle Full Rubric
kk_kz: Толық айдарға қосу

source: {result_of_task} from grader {number}
kk_kz: {number} нөмірді бағалаушыдан {result_of_task}

source: See full feedback
kk_kz: Барлық пікірлерді қарау

source: Respond to Feedback
kk_kz: Пікірлерге жауап беру

source: How accurate do you find this feedback?
kk_kz: Осы пікір қаншалықты дәл деп ойлайсыз?

source: Correct
kk_kz: Дұрыс

source: Partially Correct
kk_kz: Ішінара дұрыс

source: No Opinion
kk_kz: Белгілі пікір жоқ

source: Partially Incorrect
kk_kz: Жиі дұрыс емес

source: Incorrect
kk_kz: Дұрыс емес

source: Additional comments:
kk_kz: Қосымша түсініктемелер

source: Submit Feedback
kk_kz: Пікірді жіберу

source: Response
kk_kz: Жауап беру

source: Unanswered
kk_kz: Жауапсыз

source: Skip Post-Assessment
kk_kz: Қарастырудан кейінгі қадамды өткізіп жіберу

source: {num} point: {explanatory_text}
kk_kz: {num} балл: {explanatory_text}

source: There was an error with your submission. Please contact course staff.
kk_kz: Сіз жүктеген материалдарда қателік пайда болды. Курстың қызметкерлерімен байланысыңыз.

source: Rubric
kk_kz: Айдар

source: Select the criteria you feel best represents this submission in each category.
kk_kz: Сіздің ойыңызша әр санаттағы жіберілетін материалға ең жақсы сәйкес келетін критерийді таңдаңыз.

source: {num} point: {text}
kk_kz: {num} балл: {text}

source: Please enter a hint below:
kk_kz: Еске түсіруді төменде енгізіңіз:

source: Cohort groups
kk_kz: Топтар

source: Show cohorts
kk_kz: Топтарды көрсету

source: Cohorts in the course
kk_kz: Осы курстағы топтар

source: Add cohort
kk_kz: Топты қосу

source: Add users by username or email. One per line or comma-separated.
kk_kz: Пайдаланушының аты немесе электрондық почта бойынша пайдаланушыларды қосу. Сызыққа бір бірден немесе үтірлермен бөлу.

source: Add cohort members
kk_kz: Топ мүшелерін қосу

source: {chapter}, current chapter
kk_kz: {chapter}, ағымдағы тарау

source: due {date}
kk_kz: {date} дейін

source: The currently logged-in user account does not have permission to enroll in this course. You may need to {start_logout_tag}log out{end_tag} then try the register button again. Please visit the {start_help_tag}help page{end_tag} for a possible solution.
kk_kz: Осы есептік жазбаның пайдаланушысына осы курста қатысу үшін тіркелу рұқсат етілмеген. Мүмкін, Сізге {end_tag} жүйеден шығуға {start_logout_tag}, содан кейін қайта тіркелуге тура келеді. Проблеманың мүмкін шешімін табу үшін {end_tag} көмегінің {start_help_tag} бөлімін қараңыз.

source: About {course.display_number_with_default}
kk_kz: {course.display_number_with_default} туралы

source: You are registered for this course
kk_kz: Сіз осы курста қатысу үшін тіркелгенсіз

source: View Courseware
kk_kz: Курс бағдарламасын қарау

source: This course is in your <a href="{cart_link}">cart</a>.
kk_kz: Осы курс сіздің <a href="{cart_link}">қоржыныңызда</a>.

source: Add {course.display_number_with_default} to Cart ({currency_symbol}{cost})
kk_kz: ({currency_symbol}{cost}) қоржынына {course.display_number_with_default} қосу

source: Register for {course.display_number_with_default}
kk_kz: {course.display_number_with_default} тіркелу

source: View About Page in studio
kk_kz: Studio Ақпараттық Бетті қарау

source: Overview
kk_kz: Шолу

source: Share with friends and family!
kk_kz: Отбасымен және достармен бөлісу!

source: I just registered for {number} {title} through {account}: {url}
kk_kz: Мен {account}: {url} арқылы {number} {title} дәл қазір тіркелдім

source: Take a course with {platform} online
kk_kz: Онлайн {platform} курсын өту

source: I just registered for {number} {title} through {platform} {url}
kk_kz: Мен {platform} {url} арқылы {number} {title} дәл қазір тіркелдім

source: Classes Start
kk_kz: Оқу басталды

source: Classes End
kk_kz: Оқу аяқталды

source: Estimated Effort
kk_kz: Күрделілік бағасы

source: Prerequisites
kk_kz: Курсқа жазылу үшін қажетті шарттар

source: Additional Resources
kk_kz: Қосымша ресурстар

source: needs attention
kk_kz: назар аударыңыз

source: Staff view
kk_kz: Қызметкер режимі

source: Student view
kk_kz: Студентті қарау

source: Explore free courses from leading universities.
kk_kz: Жетекші университеттердің ақысыз курстарымен танысыңыз
