Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Non usable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
kk_kz: Пайдаланылуы мүмкін емес сілтеме ұсынылған. Мынадай үлгідегі сілтеме қажет: git@github.com:mitocw/edx4edx_lite.git

source: Unable to get git log
kk_kz: Git жұмыс хаттамасын алу мүмкін емес

source: git clone or pull failed!
kk_kz: git clone немесе pull командалары сәтсіз аяқталды!

source: Unable to run import command.
kk_kz: импорт командасын орындау мүмкін болмады.

source: The underlying module store does not support import.
kk_kz: Модульді қолдайтын қойма импорттауды қолдамайды.

source: The specified remote branch is not available.
kk_kz: Көрсетілген алыстағы торап қол жетімді емес.

source: Unable to switch to specified branch. Please check your branch name.
kk_kz: Көрсетілген торапқа ауысу мүмкін емес. Сіздің тораптың атын тексеріңіз.

source: Email Address
kk_kz: Электрондық почтаның мекенжайы

source: Course ID
kk_kz: Курстың сәйкестендіргіші

source: fixed password
kk_kz: өзгертілмейтін

source: All ok!
kk_kz: Барлығы дұрыс!

source: Must provide username
kk_kz: Пайдаланушының атын көрсету қажет

source: Must provide full name
kk_kz: Толық атын көрсету қажет

source: Password must be supplied if not using certificates
kk_kz: Сертификаттар болмаған кезде пароль енгізілуі тиіс

source: email address required (not username)
kk_kz: электрондық почтаның мекенжайы (пайдаланушының аты емес) қажет

source: Statistic
kk_kz: Статистикалық

source: Value
kk_kz: Мәні

source: Site statistics
kk_kz: Сайт статистикасы

source: Total number of users
kk_kz: Пайдаланушылардың жалпы саны

source: Courses loaded in the modulestore
kk_kz: Оқу курстары модульдер қоймасына жүктелген

source: email
kk_kz: Электрондық почта

source: Repair Results
kk_kz: Нәтижелердегі қателерді түзету

source: Create User Results
kk_kz: Пайдаланушының нәтижелерін құру

source: Delete User Results
kk_kz: Пайдаланушының нәтижелерін жою

source: The git repo location should end with '.git', and be a valid url
kk_kz: git репозитарийінің мекенжайы '.git' аяқталуы және шынайы url болуы тиіс

source: Added Course
kk_kz: Курс қосылды

source: Refusing to import. GIT_IMPORT_WITH_XMLMODULESTORE is not turned on, and it is generally not safe to import into an XMLModuleStore with multithreaded. We recommend you enable the MongoDB based module store instead, unless this is a development environment.
kk_kz: Импорттаудан бас тарту. GIT_IMPORT_WITH_XMLMODULESTORE режимі қосылмаған және жалпы алғанда XMLModuleStore көп ағынды режимде импортау қауіпсіз емес. Егер бұл әзірлеу жүйесі болмаса мұның орнына біз MongoDB базасындағы сақтау модулін қосуды ұсынамыз.

source: The course {0} already exists in the data directory! (reloading anyway)
kk_kz: {0} оқыту курсы деректер каталогында бар! (кез келген жағдайда қайта жүктеу)

source: Unable to clone or pull repository. Please check your url. Output was: {0!r}
kk_kz: Репозитарийді клондау мүмкін емес. Сіздің сілтемеңізді тексеріңіз. Шығыс деректері мыналар болған: {0!r}

source: Successfully switched to branch: {branch_name}
kk_kz: Мына торапқа ойдағыдай ауыстырылды: {branch_name}

source: Directory/ID
kk_kz: Каталог/ID

source: Git Commit
kk_kz: Git жазба

source: Last Change
kk_kz: Соңғы Өзгерістер

source: Last Editor
kk_kz: Соңғы Редактор

source: Information about all courses
kk_kz: Барлық курстар туралы ақпарат

source: Error - cannot get course with ID {0}<br/><pre>{1}</pre>
kk_kz: Қате - {0}<br/><pre>{1}</pre> сәйкестендіргіші бар курсты ашу мүмкін болмады

source: Deleted
kk_kz: Жойылды

source: # enrolled
kk_kz: # тіркелген студенттер

source: # staff
kk_kz: # қызметкерлер

source: instructors
kk_kz: нұсқаушылар

source: Enrollment information for all courses
kk_kz: Барлық курстарға арналған қатысушылар үшін ақпарат

source: role
kk_kz: рөл

source: Import the specified git repository and optional branch into the modulestore and optionally specified directory.
kk_kz: Көрсетілген git-репозиторийді және таңдау торабын модульдер қоймасына және көрсетілген бөлімге импорттау.

source: Re-open thread
kk_kz: Тақырыпты тағы ашу

source: Close thread
kk_kz: Тақырыпты жабу

source: Title can't be empty
kk_kz: Тақырып бос бола алмайды

source: Body can't be empty
kk_kz: Негізгі бөлік бос бола алмайды

source: Comment level too deep
kk_kz: Түсініктемелер деңгейі өте терең

source: allowed file types are '%(file_types)s'
kk_kz: рұқсат етілген файлдар үлгісі '%(file_types)s'

source: maximum upload file size is %(file_size)sK
kk_kz: жүктелетін файлдың ең көп мөлшері %(file_size)sK

source: Error uploading file. Please contact the site administrator. Thank you.
kk_kz: Файлды жүктеу қатесі. Сайттың әкімшісімен байнысыңыз. Рахмет.

source: Good
kk_kz: Жақсы

source: User does not exist.
kk_kz: Пайдаланушы жоқ.

source: Task is already running.
kk_kz: Тапсырма орындалуда.

source: Language
kk_kz: Тілі

source: Location
kk_kz: Орналасқан орны

source: Birth Year
kk_kz: Туған жылы

source: Gender
kk_kz: Жынысы

source: Level of Education
kk_kz: Білім деңгейі

source: Mailing Address
kk_kz: Почталық мекенжайы

source: Goals
kk_kz: Мақсаттары

source: Module does not exist.
kk_kz: Модуль жоқ.

source: An error occurred while deleting the score.
kk_kz: Бағаны өшіру кезінде қате пайда болды.

source: Complete
kk_kz: Аяқталды

source: Incomplete
kk_kz: Аяқталған жоқ

source: Your grade report is being generated! You can view the status of the generation task in the 'Pending Instructor Tasks' section.
kk_kz: Сіздің бағаларыңыз бар есеп өңделуде! Сіз орындалу мәртебесін 'Нұсқаушының міндеттерін күтішілер' бөлімінен қарай аласыз.

source: A grade report generation task is already in progress. Check the 'Pending Instructor Tasks' table for the status of the task. When completed, the report will be available for download in the table below.
kk_kz: Бағалар бойынша есеп құрылу барысында. Сіз орындалу мәртебесін 'Нұсқаушының міндеттерін күтішілер' бөлімінен қарай аласыз. Есеп аяқталғанда, ол төмендегі кестеде көшіріп жүктеу үшін қол жетімді болады.

source: Successfully changed due date for student {0} for {1} to {2}
kk_kz: {0} студент үшін {1}мерзім{2} мерзімге ойдағыдай өзгертілді

source: Successfully reset due date for student {0} for {1} to {2}
kk_kz: {0} студент үшін {1}мерзім{2} мерзімге ойдағыдай шығарып тасталды

source: Membership
kk_kz: Мүшелік

source: Student Admin
kk_kz: Әкімші студент

source: Extensions
kk_kz: Мерзімдерді ұзарту

source: Data Download
kk_kz: Деректерді көшіріп жүктеу

source: Analytics
kk_kz: Талдау

source: Metrics
kk_kz: Көрсеткіштер

source: Course Statistics At A Glance
kk_kz: Курстың Қысқаша Статистикалық Деректері

source: Found a single student.
kk_kz: Жеке студент табылды.

source: Couldn't find student with that email or username.
kk_kz: Осындай электрондық мекенжайы немесе пайдаланушы аты бар студентті табу мүмкін болмады.

source: Failed to create a background task for rescoring "{problem_url}".
kk_kz: "{problem_url}" қайта есептеу үшін фондық міндетті құру мүмкін емес.

source: Failed to create a background task for rescoring "{problem_url}": problem not found.
kk_kz: "{problem_url}" қайта есептеу үшін фондық міндетті құру мүмкін емес: тапсырма табылмады.

source: Failed to create a background task for rescoring "{url}": {message}.
kk_kz: "{url}" қайта есептеу үшін фондық міндетті құру мүмкін емес: {message}.

source: Failed to create a background task for resetting "{problem_url}".
kk_kz: "{problem_url}" қайта іске қосу үшін фондық міндетті құру мүмкін емес.

source: Failed to create a background task for resetting "{problem_url}": problem not found.
kk_kz: "{problem_url}" қайта іске қосу үшін фондық міндетті құру мүмкін емес: тапсырма табылмады.

source: Failed to create a background task for resetting "{url}": {message}.
kk_kz: "{url}" қайта іске қосу үшін фондық міндетті құру мүмкін емес: {message}.

source: Found module.
kk_kz: Модуль табылды.

source: Couldn't find module with that urlname: {url}.
kk_kz: Осындай url бар модульді табу мүмкін болмады: {url}.

source: Deleted student module state for {state}!
kk_kz: {state} арналған студент модулінің алыстағы жай-күйі!

source: Failed to delete module state for {id}/{url}.
kk_kz: {id}/{url} арналған модульдің жай-күйін жою мүмкін болмады.

source: Module state successfully reset!
kk_kz: Модуль мәртебесі ойдағыдай шығарып тасталды!

source: Couldn't reset module state for {id}/{url}.
kk_kz: {id}/{url} арналған модульдің жай-күйін шығарып тастау мүмкін болмады.

source: Failed to create a background task for rescoring "{key}" for student {id}.
kk_kz: "{key}" for student {id} қайта есептеу үшін фондық міндетті құру мүмкін емес.

source: Failed to create a background task for rescoring "{key}": {id}.
kk_kz: "{key}": {id} қайта есептеу үшін фондық міндетті құру мүмкін емес:

source: Progress page for username: {username} with email address: {email}
kk_kz: Электрондық мекенжайы: {email} пайдаланушының ілгерілеуі: {username}

source: Assignment Name
kk_kz: Тапсырманың атауы

source: Please enter an assignment name
kk_kz: Тапсырманың атауын енгізіңіз

source: Invalid assignment name '{name}'
kk_kz: '{name}' атауының қате тағайындалуы

source: External email
kk_kz: Сыртқы электрондық мекенжай

source: Grades for assignment "{name}"
kk_kz: "{name}" тапсырмасы үшін баға

source: List of Staff
kk_kz: Қызметкерлер тізімі

source: List of Instructors
kk_kz: Оқытушылар тізімі

source: Student profile data for course {course_id}
kk_kz: Студенттің {course_id} курсына арналған бейінінің деректері

source: Found {num} records to dump.
kk_kz: Шығарып тастау үшін{num} жазбалар табылды.

source: Couldn't find module with that urlname.
kk_kz: Осындай url бар модульді табу мүмкін болмады.

source: Student state for problem {problem}
kk_kz: Студенттің {problem} тапсырмасына арналған жай-күйі

source: List of Beta Testers
kk_kz: Бета Тестерлер тізімі

source: Your email was successfully queued for sending. Please note that for large classes, it may take up to an hour (or more, if other courses are simultaneously sending email) to send all emails.
kk_kz: Сіздің электрондық хабарыңыз жөнелту кезегіне ойдағыдай қосылды. Егер сынып үлкен болса, барлық хабарларды жөнелту бір сағатқа дейінгі (немесе егер басқа курстар хабарларды дәл осы уақытта жөнелтсе, одан артық) уақытты алуы мүмкін екендігіне назар аударыңыз

source: Your email was successfully queued for sending.
kk_kz: Сіздің электронды хатыңыз жіберу кезегіне сәтті қойылды.

source: Grades from {course_id}
kk_kz: {course_id} курсының бағалары

source: No remote gradebook defined in course metadata
kk_kz: Курстың метадеректерінде бағалардың алыстағы кітабы анықталмаған

source: No remote gradebook url defined in settings.FEATURES
kk_kz: Баптауларда алыстағы кітаптың url анықталмаған.FEATURES

source: No gradebook name defined in course remote_gradebook metadata
kk_kz: Курста remote_gradebook metadata бағалар кітабының аты анықталмаған

source: Failed to communicate with gradebook server at {url}
kk_kz: {url}бағалар кітабының серверімен хабарласу мүмкін болмады

source: Error: {err}
kk_kz: Қате: {err}

source: Remote gradebook response for {action}
kk_kz: Алыстағы бағалар кітабының {action} жауабы

source: Full name
kk_kz: Толық аты

source: Roles
kk_kz: Рөл

source: List of Forum {name}s in course {id}
kk_kz: {id} курсындағы Форум Тізімі {name}s

source: Error: unknown rolename "{rolename}"
kk_kz: Қате: белгісіз рөлдік аты "{rolename}"

source: Error: unknown username "{username}"
kk_kz: Қате: пайдаланушының белгісіз аты "{username}"

source: Error: user "{username}" does not have rolename "{rolename}", cannot remove
kk_kz: Қате: "{username}" пайдаланушының "{rolename}" рөлдік аты жоқ, жою мүмкін емес

source: Removed "{username}" from "{course_id}" forum role = "{rolename}"
kk_kz: "{username}" "{course_id}"-дан жойылды форумдық рөл = "{rolename}"

source: Error: user "{username}" already has rolename "{rolename}", cannot add
kk_kz: Қате: "{username}" пайдаланушы "{rolename}" атына ие, қосу мүмкін емес

source: Error: user "{username}" should first be added as staff before adding as a forum administrator, cannot add
kk_kz: Қате: "{username}" пайдаланушы, оны әкімші етіп тағайындар алдында қызметкер ретінде қосылуы тиіс, қосу мүмкін емес

source: Added "{username}" to "{course_id}" forum role = "{rolename}"
kk_kz: "{username}" "{course_id}"-ға қосылды форумдық рөл = "{rolename}"

source: Full Name
kk_kz: Толық аты

source: edX email
kk_kz: edX электрондық мекенжайы

source: Enrollment of students
kk_kz: Студенттерді тіркеу

source: Un-enrollment of students
kk_kz: Студенттерді тіркеуді болдырмау

source: Failed to find any background tasks for course "{course}", module "{problem}" and student "{student}".
kk_kz: "{course}" курсы, "{problem}" модулі және "{student}" студенті үшін фондық міндеттерді табу мүмкін емес.

source: Failed to find any background tasks for course "{course}" and module "{problem}".
kk_kz: "{course}" курсы және "{problem}" модулі үшін фондық міндеттерді табу мүмкін емес.

source: Unable to parse date:
kk_kz: Күнді тану мүмкін болмады:

source: Couldn't find module for url: {0}
kk_kz: url: {0} сәйкес келетін модуль табылмады

source: Extended Due Date
kk_kz: Ұзартылған Мерзім

source: Users with due date extensions for {0}
kk_kz: {0} арналған күн кеңейтулері бар пайдаланушы

source: Unit
kk_kz: Бірлік

source: Due date extensions for {0} {1} ({2})
kk_kz: {0} {1} ({2}) үшін мерзімдерді ұзарту

source: rescored
kk_kz: Қайта бағаланды

source: reset
kk_kz: Шығарып тасталды

source: emailed
kk_kz: Электрондық почтаға жіберілді

source: graded
kk_kz: Бағаланды

source: No status information available
kk_kz: Мәртебе туралы қол жетімді ақпарат жоқ

source: No task_output information found for instructor_task {0}
kk_kz: instructor_task {0} арналған task_output ақпарат жоқ

source: No parsable task_output information found for instructor_task {0}: {1}
kk_kz: instructor_task {0}: {1} арналған task_output танылған ақпарат жоқ

source: No parsable status information available
kk_kz: Мәртебенің танылған ақпараты жоқ

source: No message provided
kk_kz: Хабарлар ұсынылмады

source: Invalid task_output information found for instructor_task {0}: {1}
kk_kz: instructor_task {0}: {1} арналған task_output қате ақпарат табылды

source: No progress status information available
kk_kz: Ілгерілеу мәртебесі туралы ақпарат қол жетімді емес

source: No parsable task_input information found for instructor_task {0}: {1}
kk_kz: nstructor_task {0}: {1} арналған task_input ақпараты танылмады

source: Progress: {action} {succeeded} of {attempted} so far
kk_kz: Ілгерілеу: {attempted}-дан ойдағыдай {action} {succeeded}

source: Unable to find submission to be {action} for student '{student}'
kk_kz: '{student}' студенттің {action} болуы тиіс тапсырмасын табу мүмкін болмады

source: Problem failed to be {action} for student '{student}'
kk_kz: '{student}' студенттің тапсырмасы {action} болмады

source: Problem successfully {action} for student '{student}'
kk_kz: '{student}' студенттің тапсырмасы ойдағыдай {action} болды

source: Unable to find any students with submissions to be {action}
kk_kz: {action} өтінімі бар студентті табу мүмкін емес

source: Problem failed to be {action} for any of {attempted} students
kk_kz: Бір де бір {attempted} студенттің тапсырмасы {action} болмады

source: Problem successfully {action} for {attempted} students
kk_kz: {attempted} студенттердің тапсырмасы ойдағыдай {action} болды

source: Problem {action} for {succeeded} of {attempted} students
kk_kz: {attempted} студенттерден алынған {succeeded} тапсырма ойдағыдай {action} болды

source: Unable to find any recipients to be {action}
kk_kz: Оларға хабар {action} болуы тиіс алушыларды табу мүмкін болмады

source: Message failed to be {action} for any of {attempted} recipients
kk_kz: Хабар {attempted} алушылардың ешқайсысы үшін {action} болмады

source: Message successfully {action} for {attempted} recipients
kk_kz: Хабар {attempted} алушылар үшін ойдағыдай {action}

source: Message {action} for {succeeded} of {attempted} recipients
kk_kz: {attempted} алушылардан хабар {action} {succeeded}

source: Status: {action} {succeeded} of {attempted}
kk_kz: Мәртебесі: {attempted}-тен {action} {succeeded}

source: (skipping {skipped})
kk_kz: (жіберілді {skipped})

source: (out of {total})
kk_kz: ({total}-дан)

source: Dear %(student_name)s,
kk_kz: Құрметті %(student_name)s,

source: Congratulations on earning your certificate in %(course_name)s! Since you have an account on LinkedIn, you can display your hard earned credential for your colleagues to see. Click the button below to add the certificate to your profile.
kk_kz: Құттықтаймыз Сіз %(course_name)s! сертификатын алдыңыз Сіз зор еңбек арқасында қол жеткен өз жетістіктеріңіз туралы әріптестеріңізбен LinkedIn парақшасында бөлісе аласыз. сертификатты LinkedIn. өз бейініңізге қосу үшін төмендегі батырманы басыңыз

source: Add to profile
kk_kz: Бейінге қосу

source: Could not contact the external grading server. Please contact the development team at {email}.
kk_kz: Баға алу үшін сыртқы сервермен хабарласу мүмкін болмады. {email} мекенжайы бойынша әзірлеушілер командасымен хабарласыңыз.

source: Cannot find any open response problems in this course. Have you submitted answers to any open response assessment questions? If not, please do so and return to this page.
kk_kz: Осы курстағы тапсырмаларға қандай да болмасын пікірлер табу мүмкін емес. Сіз пікірдің қандай да болмасын сұрағына жауап бердіңіз бе? Егер жауап бермесеңіз, онда орындаңыз және осы бетке қайтып оралыңыз.

source: AI Assessment
kk_kz: Автоматты түрде бағалау

source: Peer Assessment
kk_kz: Қатысушылардың бағалауы

source: Not yet available
kk_kz: Әлі қол жетімді емес

source: Automatic Checker
kk_kz: Автоматты түрде тексеру

source: Instructor Assessment
kk_kz: Оқытушылардың

source: Error occurred while contacting the grading service. Please notify course staff.
kk_kz: Бағалар сервисімен байланыс жасау кезінде қате орын алды. Курс үшін жауаптыларға хабарлаңыз.

source: Error occurred while contacting the grading service. Please notify your edX point of contact.
kk_kz: Бағалар сервисімен байланыс жасау кезінде қате орын алды. edX-тағы сіздің байланыс жасайтын тұлғаңызға хабарлаңыз.

source: for course {0} and student {1}.
kk_kz: {0} курс және {1} студент үшін

source: View all problems that require peer assessment in this particular course.
kk_kz: Осы курстағы барлық қатысушылардың қарауын талап ететін барлық міндеттерді қарау.

source: View ungraded submissions submitted by students for the open ended problems in the course.
kk_kz: Осы курста әлі шешілмеген міндеттер бойынша студенттердің әлі тексерілмеген материалдарын қарау.

source: View open ended problems that you have previously submitted for grading.
kk_kz: Сіз тексеруге жолдаған, әлі шешілмеген міндеттерді қарау.

source: View submissions that have been flagged by students as inappropriate.
kk_kz: Студенттер орынсыз ретінде белгілеген материалдарды қарау.

source: New submissions to grade
kk_kz: Тексеруге арналған жаңа материалдар

source: New grades have been returned
kk_kz: Жаңа бағалар пайда болды

source: Submissions have been flagged for review
kk_kz: Жіберілген материалдар қарау үшін белгіленген болатын

source: Error with initializing peer grading. There has not been a peer grading module created in the courseware that would allow you to grade others. Please check back later for this.
kk_kz: Басқа қатысушының. жұмысын бағалай бастауға әрекет жасаған кездегі қате Осы бағдарламалық қамтамасыз етуде мұны жасауға мүмкіндік беретін модуль жоқ. Кейінірек әрекет етіп көріңіз.

source: Order Payment Confirmation
kk_kz: Төлемді растау

source: Trying to add a different currency into the cart
kk_kz: Қоржынға басқа валютаны қосу әрекеті

source: Registration for Course: {course_name}
kk_kz: {course_name} курсына тіркелу

source: Please visit your <a href="{dashboard_link}">dashboard</a> to see your new enrollments.
kk_kz: Сіз жазылған жаңа курстарды көру үшін <a href="{dashboard_link}">бақылау панеліне </a> кіріңіз.

source: [Refund] User-Requested Refund
kk_kz: [Refund] пайдаланушының сауалы бойынша ақшаны қайтару

source: Mode {mode} does not exist for {course_id}
kk_kz: {course_id}үшін {mode} режимі жоқ

source: Certificate of Achievement, {mode_name} for course {course}
kk_kz: {course} курсының {mode_name}сертификаты

source: Note - you have up to 2 weeks into the course to unenroll from the Verified Certificate option and receive a full refund. To receive your refund, contact {billing_email}. Please include your order number in your e-mail. Please do NOT include your credit card information.
kk_kz: Ескерту: сіздің расталған сертикатты алудан бас тарту және қаражаттардың толық өтемін алу үшін курс басталғаннан бастап 2 аптаға дейін уақытыңыз бар. Ақшаны қайтаруды ресімдеу үшін {billing_email} хабарласыңыз. Сіздің банк картаңыздың деректерін ешбір жағдайда айтпаңыз.

source: Order Number
kk_kz: Тапсырыс нөмірі

source: Customer Name
kk_kz: Тапсырыс берушінің аты

source: Date of Original Transaction
kk_kz: Бастапқы Операция Күні

source: Date of Refund
kk_kz: Ақшалай Қаражатты Қайтару Күні

source: Amount of Refund
kk_kz: Қайтарылған Сома

source: Service Fees (if any)
kk_kz: Сервистік шығыстар (бар болса)

source: Purchase Time
kk_kz: Төлем уақыты

source: Order ID
kk_kz: Тапсырыс ID

source: Quantity
kk_kz: Саны

source: Unit Cost
kk_kz: Бірлік үшін бағасы

source: Total Cost
kk_kz: Қорытынды Құны

source: Currency
kk_kz: Валюта

source: Description
kk_kz: Сипаттамасы

source: Comments
kk_kz: Ескерту

source: University
kk_kz: Университет

source: Course
kk_kz: Курс

source: Course Announce Date
kk_kz: Курсты Жариялау Күні

source: Course Start Date
kk_kz: Курстың басталу күні

source: Course Registration Close Date
kk_kz: Курста Тіркеуді Жабу Күні

source: Course Registration Period
kk_kz: Курста Тіркелу Мерзімі

source: Total Enrolled
kk_kz: Жиыны Тіркелгендер

source: Audit Enrollment
kk_kz: Тыңдаушылар Ретінде Тіркелгендер

source: Honor Code Enrollment
kk_kz: Ар-намыс Кодексін Тіркеу

source: Verified Enrollment
kk_kz: Расталған тіркеу

source: Gross Revenue
kk_kz: Жалпы Түсім

source: Gross Revenue over the Minimum
kk_kz: Ең аз жалпы түсім

source: Number of Verified Students Contributing More than the Minimum
kk_kz: Ең аздан артық қаражат енгізген расталған студенттер саны

source: Number of Refunds
kk_kz: Ақшаны қайтару саны

source: Dollars Refunded
kk_kz: Қайтарылған долларлар

source: Number of Transactions
kk_kz: Төлем Операцияларының Саны

source: Total Payments Collected
kk_kz: Жиыны Қабылданған Төлемдер

source: Number of Successful Refunds
kk_kz: Ақшаны ойдағыдай қайтару саны

source: Total Amount of Refunds
kk_kz: Жиыны Ақшалай Қаражат Қайтарылды

source: You must be logged-in to add to a shopping cart
kk_kz: Қоржынға заттарды қосу үшін Сіз сайтқа кіруіңіз керек

source: The course you requested does not exist.
kk_kz: Сіз сұрау салған курс жоқ.

source: The course {0} is already in your cart.
kk_kz: {0} қоржында бар.

source: You are already registered in course {0}.
kk_kz: Сіз {0} курсқа тіркеліп қойғансыз.

source: Course added to cart.
kk_kz: Курс қоржынға қосылды.

source: You do not have permission to view this page.
kk_kz: Сіздің осы бетті қарауға рұқсатыңыз жоқ.

source: The payment processor did not return a required parameter: {0}
kk_kz: Төлем сервисі керек параметрді бермеді: {0}

source: The payment processor returned a badly-typed value {0} for param {1}.
kk_kz: Төлем сервисі {1} параметріне арналған {0} мәнді қате басып берді.

source: The payment processor accepted an order whose number is not in our system.
kk_kz: Төлем сервисі біздің жүйеде жоқ тапсырысты қабылдады.
