Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Sort by date, vote, or comments
kk_kz: Күн, дауыс сандары немесе түсініктемелер бойынша іріктеу

source: Engage with posts
kk_kz: Таратуды пайдаланумен жүгіну

source: Upvote posts and good responses
kk_kz: Хабарлар үшін және жақсы жауаптар үшін дауыс беріңіздер

source: Report Forum Misuse
kk_kz: Форумды дұрыс емес пайдалану туралы хабарлау

source: Follow posts for updates
kk_kz: Хабарлардағы жаңартуларды бақылау

source: Receive updates
kk_kz: Хабарламаларды алу

source: Toggle Notifications Setting
kk_kz: Хабарламаларды ажыратып қосу бапталымы

source: Check this box to receive an email digest once a day notifying you about new, unread activity from posts you are following.
kk_kz: Сіз бақылайтын жариялымдарда жаңа оқылмаған белсенділіктерді шолуды күнсайын алу үшін мұнда белгілеңіз.

source: Create new post about:
kk_kz: туралы жаңа хабар құру

source: Show All Discussions
kk_kz: Барлық талқылауларды көрсету

source: Filter List
kk_kz: Сүзгілердің тізімі

source: Filter discussion areas
kk_kz: Пікірталас салалардың сүзгісі

source: follow this post
kk_kz: Осы хабарды бақылау

source: post anonymously
kk_kz: Хабарды анонимді қалдыру

source: post anonymously to classmates
kk_kz: Сыныптастар үшін хабарды анонимді қалдыру

source: Make visible to:
kk_kz: үшін көретін ету

source: All Groups
kk_kz: Барлық топтар

source: new post title
kk_kz: Жаңа жазбаның тақырыбы

source: Enter your question or comment…
kk_kz: Өз сұрағыңызды немесе пікіріңізді енгізіңіз

source: Add post
kk_kz: Хабарды қосу

source: %s discussion started
kk_kz: Талқылау тақырыбы %s ашық

source: %s comment
kk_kz: Түсініктемелер %s

source: Discussion - {course_number}
kk_kz: Талқылау - {course_number}

source: We're sorry
kk_kz: Біз өкініш білдіреміз

source: The forums are currently undergoing maintenance. We'll have them back up shortly!
kk_kz: Осы уақытта форумдарда техникалық жұмыстар жүргізілуде. Біз олардың жұмыстарын жақын арада қалпына келтіреміз!

source: User Profile
kk_kz: Пайдаланушының профилі

source: Expand discussion
kk_kz: Талқылауларды ашу

source: Collapse discussion
kk_kz: Талқылауларда жиыру

source: This thread has been pinned by course staff.
kk_kz: Осы талқылауды курстың оқытушылары бекітті

source: View discussion
kk_kz: Тақырыпты қарау

source: Active Threads
kk_kz: Белсенді тақырыптар

source: Thank you for signing up for {platform_name}! To activate your account, please copy and paste this address into your web browser's address bar:
kk_kz: {platform_name} тіркелгеніңіз үшін рахмет! Өз есептік жазбаңызды белсендендіру үшін өз браузеріңіздің мекенжайлық жолына мынадай мекенжайды көшіріңіз:

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the about section of the {platform_name} Courses web site.
kk_kz: Егер Сіз осындай сұранысты істемесеңіз, бұдан әрі әрекеттер талап етілмейді; сіз бізден енді хабарлар алмайсыз. Осы хабарға жауап бермеуіңізді өтінеміз; егер Сізге көмек керек болса, {platform_name} курстар сайтында \"Біз туралы\" бетіне кіріңіз.

source: If you didn't request this, you don't need to do anything; you won't receive any more email from us. Please do not reply to this e-mail; if you require assistance, check the help section of the {platform_name} web site.
kk_kz: Егер Сіз осындай сұранысты істемесеңіз, бұдан әрі әрекеттер талап етілмейді; сіз бізден енді хабарлар алмайсыз. Осы хабарға жауап бермеуіңізді өтінеміз; егер Сізге көмек керек болса, {platform_name} курстар сайтында \"Көмек\" бетіне кіріңіз.

source: Your account for {platform_name}
kk_kz: {platform_name} сіздің есептік жазбаңыз

source: Dear {full_name}
kk_kz: Құрметті {full_name}

source: You have been invited to be a beta tester for {course_name} at {site_name} by a member of the course staff.
kk_kz: Сіз курстың қызметкерінен {site_name} {course_name} курстың бета тестері болуға шақыру алдыңыз.

source: To start accessing course materials, please visit {course_url}
kk_kz: Курстың материалдарын қарау үшін {course_url} сайтына кіріңіз

source: Visit {course_about_url} to join the course and begin the beta test.
kk_kz: Курсқа қосылу және бета-тестілеуді бастау үшін {course_about_url} сайтына кіріңіз.

source: Visit {site_name} to enroll in the course and begin the beta test.
kk_kz: Курсқа тіркелу және бета тестілеуді бастау үшін {site_name} бетіне кіріңіз.

source: This email was automatically sent from {site_name} to {email_address}
kk_kz: Осы хабар {email_address} мекенжайына {site_name} сайтынан автоматты жіберілді

source: You have been invited to a beta test for {course_name}
kk_kz: Сіз {course_name} бета-тестіге шақырылдыңыз

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us at
kk_kz: Бұл Сіздің есептік жазбаңызбен {new_email} {old_email} –мен {platform_name} байланысқан электрондық мекенжайды ауыстыруды растау. Егер Сіз осындай сұранысты істемесеңіз, бізбен мекенжай бойынша байланысыңыз.

source: This is to confirm that you changed the e-mail associated with {platform_name} from {old_email} to {new_email}. If you did not make this request, please contact us immediately. Contact information is listed at:
kk_kz: Бұл Сіздің есептік жазбаңызбен {new_email} {old_email} –мен {platform_name} байланысқан электрондық мекенжайды ауыстыруды растау. Егер Сіз осындай сұранысты істемесеңіз, бізбен кідірмей байланысыңыз. Байланыс ақпаратын Сіз мына жерден табасыз:

source: We keep a log of old e-mails, so if this request was unintentional, we can investigate.
kk_kz: Бізде ескі электрондық хабарлардың тізілімі сақталуда, сондықтан егер осы сұраныс абайсыз істелінсе, біз осы проблеманы қарастыра аламыз.

source: We received a request to change the e-mail associated with your {platform_name} account from {old_email} to {new_email}. If this is correct, please confirm your new e-mail address by visiting:
kk_kz: Біз Сіздің есептік жазбаңызбен {new_email} {old_email} –мен {platform_name} байланысқан электрондық мекенжайды ауыстыруға сұраныс алдық. Егер бәрі дұрыс болса, өзіңіздің жаңа электрондық мекенжайыңызды растау үшін осы сілтеме бойынша өтіңіз.

source: Request to change {platform_name} account e-mail
kk_kz: {platform_name} есептік жазбада электрондық мекенжайды ауыстыруға сұраныс

source: Dear student,
kk_kz: Құрметті студент,

source: You have been invited to join {course_name} at {site_name} by a member of the course staff.
kk_kz: Сіз курстың қызметкерінен {site_name} {course_name} курсты өтуге шақыру алдыңыз.

source: To access the course visit {course_url} and login.
kk_kz: Курсқа қолжеткізуді алу үшін {course_url} кіріңіз және логинденіңіз.

source: To access the course visit {course_about_url} and register for the course.
kk_kz: Курсқа қолжеткізуді алу үшін {course_about_url} кіріңіз және осы курсқа тіркеліңіз.

source: To finish your registration, please visit {registration_url} and fill out the registration form making sure to use {email_address} in the E-mail field.
kk_kz: Тіркелуді аяқтау үшін {registration_url} сілтеме бойынша өтіңіз және тіркеу нысанын толтырыңыз. Сіз е-mail алабында {email_address} толтырғаныңызға көз жеткізіңіз.

source: Once you have registered and activated your account, you will see {course_name} listed on your dashboard.
kk_kz: Сіз тіркелгеннен және өз аккаутыңызды белсендендіргеннен кейін, сіздің үстелдегі тізімде сіз {course_name} көрсесіз.

source: Once you have registered and activated your account, visit {course_about_url} to join the course.
kk_kz: Сіз тіркелгеннен және өз аккаутыңызды белсендендіргеннен кейін, курсқа кіру үшін {course_about_url} кіріңіз.

source: You can then enroll in {course_name}.
kk_kz: Содан кейін Сіз {course_name} курста тіркеле аласыз.

source: You have been invited to register for {course_name}
kk_kz: Сіз {course_name} курсқа тіркелуге шақыру алдыңыз

source: You have been enrolled in {course_name} at {site_name} by a member of the course staff. The course should now appear on your {site_name} dashboard.
kk_kz: Сіз курстың қызметкері ретінде {site_name} {course_name} курсқа тіркелдіңіз. Курс сіздің {site_name} үстеліңізде қазір пайда болады.

source: This email was automatically sent from {site_name} to {full_name}
kk_kz: Бұл хабар {full_name} пайдаланушыға {site_name} автоматты жіберілді

source: You have been enrolled in {course_name}
kk_kz: Сіз {course_name} курсқа тіркелдіңіз

source: Hi {name}
kk_kz: Сәлеметсіз бе, {name}

source: Your payment was successful. You will see the charge below on your next credit or debit card statement.
kk_kz: Сіздің төлеміңіз ойдағыдай болды. Сіз төлеуге берілетін шотты кредиттік немесе дебиттік карта бойынша сіздің келесі үзіндіңізден көресіз.

source: The charge will show up on your statement under the company name {merchant_name}.
kk_kz: Төлеуге берілетін шот {merchant_name} компания атымен сіздің үзіндіңізде көрсетілетін болады.

source: If you have billing questions, please read the FAQ ({faq_url}) or contact {billing_email}.
kk_kz: Егер сізде төлемдерге байланысты сұрақтар болса, FAQ ({faq_url}) оқыңыз немесе {billing_email} жазыңыз.

source: If you have billing questions, please contact {billing_email}.
kk_kz: Егер сізде төлемдерге байланысты сұрақтар болса, {billing_email} жазыңыз.

source: -The {platform_name} Team
kk_kz: - {platform_name} командасы

source: Your order number is: {order_number}
kk_kz: Сіздің тапсырысыңыздың нөмірі: {order_number}

source: The items in your order are:
kk_kz: Сіздің тапсырысыңыздағы нысандар

source: Quantity - Description - Price
kk_kz: Саны – Сипаттамасы -Бағасы

source: Total billed to credit/debit card: {currency_symbol}{total_cost}
kk_kz: Кредиттік немесе дебиттік картамен барлығы төлеуге берлген: {currency_symbol}{total_cost}

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the tech support at
kk_kz: Өкінішке орай, біздің курстың қызметкерлері {old_name}-дан {new_name}-ға атты ауыстыруға Сіздің сұранысыңызды қанағаттандырмады. Егер Сізге қосымша көмек керек болса, мына мекенжай бойынша тех.қолдау командасымен байланысыңыз.

source: We are sorry. Our course staff did not approve your request to change your name from {old_name} to {new_name}. If you need further assistance, please e-mail the course staff at ta@edx.org.
kk_kz: Өкінішке орай, біздің курстың қызметкерлері {old_name}-дан {new_name}-ға атты ауыстыруға Сіздің сұранысыңызды қанағаттандырмады. Егер Сізге қосымша көмек керек болса, ta@edx.org мекенжайы бойынша курстың қызметкерлерімен байланысыңыз.

source: You have been removed as a beta tester for {course_name} at {site_name} by a member of the course staff. The course will remain on your dashboard, but you will no longer be part of the beta testing group.
kk_kz: Сізді курстың қызметкері{site_name} {course_name} курстың бета-тестерлерінен алып тастады. Курс сіздің үстеліңізде қалды, бірақ енді сіз бета-тест топтың мүшесі болмайсыз.

source: Your other courses have not been affected.
kk_kz: Бұл Сіздің қалған курстарыңызға әсер етпейді.

source: You have been removed from a beta test for {course_name}
kk_kz: Сіз {course_name} курстың бета-тестерлерінен алып тасталдыңыз

source: Dear Student,
kk_kz: Құрметті Студент,

source: You have been un-enrolled from course {course_name} by a member of the course staff. Please disregard the invitation previously sent.
kk_kz: Сіз курстың басшылығының шешімімен курстан {course_name} шығарылдыңыз. Бұдан бұрын жіберілген шақыруды жойылған деп санауды өтінеміз.

source: You have been un-enrolled in {course_name} at {site_name} by a member of the course staff. The course will no longer appear on your {site_name} dashboard.
kk_kz: Сіз курстың қызметкерімен {course_name} –дан {site_name} қайта тіркелдіңіз. Курс енді сіздің {site_name} үстеліңізде бейнеленбейтін болады.

source: You have been un-enrolled from {course_name}
kk_kz: Сіздің тіркелу {course_name} курста қайтарылды

source: {course_number} Staff Grading
kk_kz: {course_number} персоналды бағалау

source: This is the list of problems that currently need to be graded in order to train AI grading and create calibration essays for peer grading. Each problem needs to be treated separately, and we have indicated the number of student submissions that need to be graded. You can grade more than the minimum required number of submissions--this will improve the accuracy of AI grading, though with diminishing returns. You can see the current accuracy of AI grading in the problem view.
kk_kz: Бұл ИИ бағалауға үйрету және пайдаланушыларды бағалау үшін эссені калибрлеуді құру үшін, қазіргі уақытта бағалауға қажетті тапсырмалар тізімі. Әрбір тапсырма жеке бағалауы тиіс, біз бағалауға қажетті студенттер жіберген жұмыстардың санын көрсеттік. Сіз талап етілетін ең аз жіберілген тапсырмалардан артық бағалай аласыз – бұл ИИ бағалау дәлдігін, бірақ онша едәуір емес жақсартады. Сіз тапсырманы қарау режимінде ИИ бағалаудың ағымдағы дәлдігін қарай аласыз.

source: Problem List
kk_kz: Тапсырмалардың тізімі

source: Please note that when you see a submission here, it has been temporarily removed from the grading pool. The submission will return to the grading pool after 30 minutes without any grade being submitted. Hitting the back button will result in a 30 minute wait to be able to grade this submission again.
kk_kz: Студенттердің мұнда қолжетімді жұмыстары бағалануға дайын жұмыстардың көбінен уақытша жойылғанын есте сақтаңыз. Ол қандай да бір бағаны меншіктеусіз 30 минуттан кейін кері қайтады. Сіз бағаны қою алдында «Кері қарай» бастырмасын басу 30-минуттық күту қажеттілігіне әкеліп соғады.

source: Prompt
kk_kz: Еске түсіру

source: (Hide)
kk_kz: (Жасыру)

source: Student Response
kk_kz: Студенттің жауабы

source: Written Feedback
kk_kz: Жазба пікір

source: Feedback for student (optional)
kk_kz: Студент үшін пікір (міндетті емес)

source: Flag as inappropriate content for later review
kk_kz: Кейінірек қарастыру үшін жарамсыз контент ретінде белгілеу

source: Skip
kk_kz: Өткізіп жіберу

source: Score Distribution
kk_kz: Баллдарды бөлу

source: The chart below displays the score distribution for each standard problem in your class, specified by the problem's url name.
kk_kz: Төменде келтірілген кестеде, Сіздің студенттерге ұсынылған әрбір стандартты тапсырма үшін баллдарды бөлу бейнеленген. Тапсырмалар олардың url бойынша іріктелген.

source: Scores are shown without weighting applied, so if your problem contains 2 questions, it will display as having a total of 2 points.
kk_kz: Ұпайлар сұрақ салмағын есепке алусыз көрсетіледі, егер сіздің тапсырмаңыз 2 сұрақты қамтыса, ұпайлар жинап келгенде 2 тармақ ретінде бейнеленетін болады.

source: Loading problem list...
kk_kz: тапсырмалар тізімін жүктеу...

source: Gender Distribution
kk_kz: Жынысы бойынша бөлу

source: Enrollment Information
kk_kz: Қатысу туралы ақпарат

source: Total number of enrollees (instructors, staff members, and students)
kk_kz: Курста барлық тіркелгендер (оқытушылар, қызметкерлер және студенттер)

source: Basic Course Information
kk_kz: Курс туралы негізгі ақпарат

source: Course Name:
kk_kz: Курстың атауы:

source: Course Display Name:
kk_kz: Курстың бейнеленетін атауы:

source: Has the course started?
kk_kz: Курс басталды ма?

source: Yes
kk_kz: Иә

source: No
kk_kz: Жоқ

source: Has the course ended?
kk_kz: Курс аяқталды ма?

source: Grade Cutoffs:
kk_kz: Грейд шекаралары:

source: The status for any active tasks appears in a table below.
kk_kz: Кез келген белсенді тапсырманың мәртебесі төмендегі кестеде пайда болады.

source: Course Warnings
kk_kz: Курстың ескертулері

source: Click to generate a CSV file of all students enrolled in this course, along with profile information such as email address and username:
kk_kz: Есептік жазбалардан электрондық почтаның мекенжайлары және пайдаланушылардың аттары сияқты ақпаратты қосқанда, осы курста оқитын студенттердің тізімімен CSV-файлды құру үшін басыңыз:

source: Download profile information as a CSV
kk_kz: CSV профильдің ақпаратын жүктеу

source: For smaller courses, click to list profile information for enrolled students directly on this page:
kk_kz: Тіркелген студенттер профильдерінің ақпаратын көрсету үшін тікелей осы бетте үлкен емес курстар үшін басыңыз

source: List enrolled students' profile information
kk_kz: Тіркелген студенттердің тізімін және олардың жеке деректерін құру

source: Click to display the grading configuration for the course. The grading configuration is the breakdown of graded subsections of the course (such as exams and problem sets), and can be changed on the 'Grading' page (under 'Settings') in Studio.
kk_kz: Осы курс үшін бағалардың конфигурациясын бейнелеу үшін басыңыз. Бағалар конфигурациясы курстың кіші секцияларының бағаларына бөлінеді (емтихандар және тапсырмалар топтары сияқты), және Студияда 'Бағалар' бетінде ('Бапталымдар' астында) өзгертіле алады

source: Grading Configuration
kk_kz: Бағалау конфигурациясы

source: Click to download a CSV of anonymized student IDs:
kk_kz: Студенттің анонимді ID үшін CSV жүктеу үшін басыңыз:

source: Get Student Anonymized IDs CSV
kk_kz: CSV көмегімен анонимделген студенттің құжатын алу

source: Reports
kk_kz: Есептер

source: Click to generate a CSV grade report for all currently enrolled students. Links to generated reports appear in a table below when report generation is complete.
kk_kz: Барлық тіркелген студенттер үшін CSV форматында бағалар бойынша есепті генерациялау үшін басыңыз. Есептерге сілтемелер процесс аяқталғаннан кейін төмендегі кестеде пайда болады.

source: For large courses, generating this report may take several hours. Please be patient and do not click the button multiple times. Clicking the button multiple times will significantly slow the grade generation process.
kk_kz: Үлкен курстар үшін осы есепті құру бірнеше сағат алуы мүмкін. Сабыр сақтаңыз және қайтадан бастырмаға баспаңыз. Ондай басулар нәтижеге жету процесін едәуір баяулатады.

source: The report is generated in the background, meaning it is OK to navigate away from this page while your report is generating.
kk_kz: Есеп фондық режимде құрылатындықтан, басқа бетке өтуге болады.

source: Generate Grade Report
kk_kz: Бағалау парағын құру

source: Reports Available for Download
kk_kz: Көшіріп жүктеу үшін Бағалау Парақтары Қолжетімді

source: The grade reports listed below are generated each time the <b>Generate Grade Report</b> button is clicked. A link to each grade report remains available on this page, identified by the UTC date and time of generation. Grade reports are not deleted, so you will always be able to access previously generated reports from this page.
kk_kz: Төменде көрсетілген бағалар бойынша есептер, әр жолы <b>Generate Grade Report</b> бастырмасы басылған кезде генерацияланады. Әрбір есепке сілтеме құрудың күні және уақыты бойынша сәйкестендірілетін осы бетте қолжетімді болып қалады. Есептер жойылмайды, сондықтан сізде әрқашан осы бетте алдыңғы есептерге қол жеткізуді алу мүмкіндігі бар.

source: The answer distribution report listed below is generated periodically by an automated background process. The report is cumulative, so answers submitted after the process starts are included in a subsequent report. The report is generated several times per day.
kk_kz: Төменде көрсетілген жауаптар бойынша есеп автоматты фондық процеспен мерзімді генерацияланады. Есеп жиынтықты, сондықтан процестің басталуынан кейін жарияланған есептер кейінгі есептерге кіреді. Есептер күніне бірнеше рет құрылады.

source: <b>Note</b>: To keep student data secure, you cannot save or email these links for direct access. Copies of links expire within 5 minutes.
kk_kz: <b>Ескерту</b>: Студенттер деректерінің құпиялылығын сақтау мақсатында осы сілтемелерді сақтау немесе оларды электрондық хабарларға кіргізу мүмкін емес. Сілтемелердің көшірмелері 5 минут ішінде қолданыста болады.

source: Individual due date extensions
kk_kz: Тапсыру мерзімдерін жеке ұзарту

source: In this section, you have the ability to grant extensions on specific units to individual students. Please note that the latest date is always taken; you cannot use this tool to make an assignment due earlier for a particular student.
kk_kz: Осы бөлімде сізде таңдалған оқушылар үшін жеке тапсырмалар бойынша тапсыру күндерін жылжыту мүмкіндігі бар. Әрқашан соңғы көрсетілген күн қолданылатынын есте сақтаңыз; сіз осы құралды таңдалған студентке бұдан бұрын көрсетілген күнді белгілеу үшін пайдалана алмайсыз.

source: Choose the graded unit:
kk_kz: Бағаланатын модульді таңдау:

source: Change due date for student
kk_kz: Студент үшін мерзімді өзгерту

source: Viewing granted extensions
kk_kz: Мерзімдерді ұзартуды қарау

source: Here you can see what extensions have been granted on particular units or for a particular student.
kk_kz: Мұнда сіз белгілі модуль немесе белгілі студент үшін қандай ұзартулар ұсынылған екенін қарай аласыз.

source: Choose a graded unit and click the button to obtain a list of all students who have extensions for the given unit.
kk_kz: Бағаланатын модульді таңдаңыз және таңдалған модуль үшін кімде ұзартулар бар барлық студенттердің тізімін алу үшін бастырмаға басыңыз.

source: List all students with due date extensions
kk_kz: Тапсырудың кеңейтілген мерзімдерімен барлық студенттердің тізімі

source: List date extensions for student
kk_kz: Студент үшін оған дейін мерзімдер ұзартылған күндердің тізімін көрсету

source: Resetting extensions
kk_kz: Мерзімдерді ұзартуды ысыру

source: Resetting a problem's due date rescinds a due date extension for a student on a particular unit. This will revert the due date for the student back to the problem's original due date.
kk_kz: Тапсырманы орындаудың соңғы мерзімін ысыру нақты модуль бойынша оқушы үшін мерзімді ұзартуды болдырмайды. Сонымен қатар оқушы үшін тапсырудың соңғы күні осы тапсырма үшін бастапқы берілгенге қайтады.

source: Reset due date for student
kk_kz: Оқушы үшін тапсыру мерзімін ысыру

source: You will not get notification for emails that bounce, so please double-check spelling.
kk_kz: Сіз келмеген хаттар туралы хабарламаларды алмайсыз, сондықтан, жазылуын екі рет тексеріңіз.

source: Auto Enroll
kk_kz: Тізімге автоматты енгізу

source: If this option is <em>checked</em>, users who have not yet registered for {platform_name} will be automatically enrolled.
kk_kz: Егер осы опция <em>белгіленген</em> болса, {platform_name} әлі тіркелмеген пайдаланушылар, курсқа автоматты тіркелетін болады.

source: If this option is left <em>unchecked</em>, users who have not yet registered for {platform_name} will not be enrolled, but will be allowed to enroll once they make an account.
kk_kz: Егер осы опция <em>белгіленген</em> болса, {platform_name} әлі тіркелмеген пайдаланушылар, курсқа тіркелмейтін болады. Бірақ, олар өз есептік жазбаларын құрғаннан кейін, оларға тіркелу рұқсат етілген болады.

source: Checking this box has no effect if 'Unenroll' is selected.
kk_kz: Осы алапта тұрған белгі егер 'Тіркеуді болдырмау' таңдалса есептелмейтін болады.

source: Notify users by email
kk_kz: Электрондық почта бойынша пайдаланушыларды хабардар ету

source: If this option is <em>checked</em>, users will receive an email notification.
kk_kz: Егер осы опция <em>белгіленген</em> болса, пайдаланушылар электрондық почта бойынша хабарламаларды алатын болады.

source: Enroll
kk_kz: Тізімге енгізу

source: Unenroll
kk_kz: Тізімнен алып тастау

source: Note: Users must have an activated {platform_name} account before they can be enrolled as a beta tester.
kk_kz: Ескерту: Бета тестер ретінде тіркелу үшін, пайдаланушыда {platform_name} белсенді есептік жазба болуы тиіс.

source: Add beta testers
kk_kz: Бета тестерлерді қосу
