Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: fi_fi

source: Cancel
fi_fi: Peruuta

source: This link will open in a new browser window/tab
fi_fi: Tämä linkki avautuu uuteen selainikkunaan tai välilehteen

source: Delete
fi_fi: Poista

source: Show Annotations
fi_fi: Näytä huomautukset

source: Hide Annotations
fi_fi: Piilota huomautukset

source: Expand Instructions
fi_fi: Laajenna ohjeet

source: Collapse Instructions
fi_fi: Kutista ohjeet

source: Commentary
fi_fi: Kommentit

source: Reply to Annotation
fi_fi: Vastaa huomautukseen

source: (%(earned)s/%(possible)s point)
fi_fi: (%(earned)s/%(possible)s piste

source: (%(num_points)s point possible)
fi_fi: (%(num_points)s piste tarjolla)

source: Answer:
fi_fi: Vastaus:

source: Hide Answer
fi_fi: Piilota vastaus

source: Show Answer
fi_fi: Näytä vastaus

source: Reveal Answer
fi_fi: Paljasta vastaus

source: Answer hidden
fi_fi: Vastaus piilotettu

source: unanswered
fi_fi: ei vastattu

source: Status: unsubmitted
fi_fi: Tila: lähettämättä

source: You need to pick a rating before you can submit.
fi_fi: Sinun täytyy arvioida saamasi arvostelu ennen palautusta.

source: Your score did not meet the criteria to move to the next step.
fi_fi: Pisteesi eivät riitä seuraavaan kohtaan siirtymiseen.

source: Submit
fi_fi: Lähetä

source: Submit assessment
fi_fi: Lähetä arviointi

source: Your response has been submitted. Please check back later for your grade.
fi_fi: Vastauksesi on lähetetty. Palaa myöhemmin takaisin nähdäksesi arvosanasi.

source: Submit post-assessment
fi_fi: Lähetä jälkiarviointi

source: Answer saved, but not yet submitted.
fi_fi: Vastaus tallennettu, mutta ei vielä lähetetty.

source: Please confirm that you wish to submit your work. You will not be able to make any changes after submitting.
fi_fi: Vahvista, että haluat palauttaa työsi. Et pysty tekemään siihen mitään muutoksia enää palauttamisen jälkeen.

source: You are trying to upload a file that is too large for our system. Please choose a file under 2MB or paste a link to it into the answer box.
fi_fi: Yrität ladata liian isoa tiedostoa. Maksimikoko on 2 megatavua. Voit myös palauttaa linkin tiedostoosi.

source: Are you sure you want to remove your previous response to this question?
fi_fi: Haluatko varmasti poistaa edellisen vastauksesi tähän kysymykseen?

source: Moved to next step.
fi_fi: Siirrytty seuraavaan kohtaan.

source: File uploads are required for this question, but are not supported in your browser. Try the newest version of Google Chrome. Alternatively, if you have uploaded the image to another website, you can paste a link to it into the answer box.
fi_fi: Tehtävä vaatii tiedoston palauttamista, mutta selaimesi ei tue tätä. Vaihda parempaan selaimeen (esim. uusi Chrome, Firefox) tai palauta linkki tiedostoosi, joka on ladattavissa netistä.

source: Show Question
fi_fi: Näytä kysymys

source: Hide Question
fi_fi: Piilota kysymys

source: Sequence error! Cannot navigate to tab %(tab_name)s in the current SequenceModule. Please contact the course staff.
fi_fi: Virhe! Ei voida siirtyä välilehteen %(tab_name)s nykyisessä SequenceModule:ssa. Ottakaa yhteyttä kurssihenkilökuntaan.

source: Volume
fi_fi: Äänenvoimakkuus

source: Muted
fi_fi: Mykistetty

source: Very low
fi_fi: Erittäin hiljainen

source: Low
fi_fi: Hiljainen

source: Average
fi_fi: Normaali

source: Loud
fi_fi: Kova

source: Very loud
fi_fi: Erittäin kova

source: Maximum
fi_fi: Täysi

source: This browser cannot play .mp4, .ogg, or .webm files.
fi_fi: Tämä selain ei toista .mp4, .ogg, tai .webm -tiedostoja.

source: Try using a different browser, such as Google Chrome.
fi_fi: Yritä toisella selaimella, esimerkiksi Google Chromella.

source: Video slider
fi_fi: Videovierityspalkki

source: Pause
fi_fi: Tauko

source: Play
fi_fi: Toista

source: Fill browser
fi_fi: Koko selain

source: Exit full browser
fi_fi: Poistu koko selaimen tilasta

source: HD on
fi_fi: HD päälle

source: HD off
fi_fi: HD pois

source: Video position
fi_fi: Videon kohta

source: Video ended
fi_fi: Video loppui

source: %(value)s hour
fi_fi: %(value)s tunti

source: %(value)s minute
fi_fi: %(value)s minuutti

source: %(value)s second
fi_fi: %(value)s sekunti

source: Caption will be displayed when
fi_fi: Tekstitykset näytetään, kun

source: Turn on captions
fi_fi: Tekstitys päälle

source: Turn off captions
fi_fi: Tekstitys pois

source: Hide Discussion
fi_fi: Piilota keskustelu

source: Show Discussion
fi_fi: Näytä keskustelu

source: Sorry
fi_fi: Anteeksi

source: We had some trouble loading the discussion. Please try again.
fi_fi: Keskustelun lataaminen ei onnistunut. Kokeile uudelleen.

source: We had some trouble loading the threads you requested. Please try again.
fi_fi: Valitun ketjun lataus epäonnistui. Yritä uudelleen.

source: Loading content
fi_fi: Ladataan sisältöä

source: We had some trouble processing your request. Please ensure you have copied any unsaved work and then reload the page.
fi_fi: Ongelmia tiedon käsittelyssä. Varmista, että olet kopioinut talteen kaiken tallentamattoman työn ja lataa sivu uudelleen.

source: We had some trouble processing your request. Please try again.
fi_fi: Pyyntösi käsittely epäonnistui. Yritä uudelleen.

source: Close
fi_fi: Sulje

source: Open
fi_fi: Avaa

source: remove vote
fi_fi: poista ääni

source: vote
fi_fi: ääni

source: vote (click to remove your vote)
fi_fi: ääni (klikkaa poistaaksesi äänesi)

source: vote (click to vote)
fi_fi: ääni (klikkaa äänestääksesi)

source: Load more
fi_fi: Lataa lisää

source: Loading more threads
fi_fi: Ladataan lisää ketjuja

source: We had some trouble loading more threads. Please try again.
fi_fi: Keskusteluketjujen lataamisessa ongelmia. Yritä uudelleen.

source: %(unread_count)s new comment
fi_fi: %(unread_count)s uusi kommentti

source: Loading thread list
fi_fi: Ladataan listaa keskusteluketjuista

source: No results found for %(original_query)s. Showing results for %(suggested_query)s.
fi_fi: Tuloksia haulle %(original_query)s ei löytynyt. Näytetään tulokset haulla %(suggested_query)s

source: No threads matched your query.
fi_fi: Yhtään viestiketjua ei löytynyt haullasi.

source: Show posts by %(username)s.
fi_fi: Näytä käyttäjän %(username)s viestit.

source: Click to remove report
fi_fi: Klikkaa poistaaksesi ilmoitus

source: Misuse Reported%(start_sr_span)s, click to remove report%(end_span)s
fi_fi: Väärinkäytös ilmoitettu %(start_sr_span)s, klikkaa poistaaksesi ilmoitus %(end_span)s

source: Report Misuse
fi_fi: Ilmoita väärinkäytöksestä

source: Pinned%(start_sr_span)s, click to unpin%(end_span)s
fi_fi: Kiinnitetty%(start_sr_span)s, klikkaa irroittaaksesi%(end_span)s

source: Click to unpin
fi_fi: Klikkaa irroittaaksesi

source: Pinned
fi_fi: Kiinnitetty

source: Pin Thread
fi_fi: Kiinnitä ketju

source: The thread you selected has been deleted. Please select another thread.
fi_fi: Valitsemasi viestiketju on poistettu. Valitse toinen viestiketju.

source: We had some trouble loading responses. Please reload the page.
fi_fi: Ongelmia vastausten lataamisessa. Yritä uudelleen.

source: We had some trouble loading more responses. Please try again.
fi_fi: Ongelmia vastausten lataamisessa. Yritä uudelleen.

source: %(numResponses)s response
fi_fi: %(numResponses)s vastaus

source: Showing all responses
fi_fi: Näytetään kaikki vastaukset

source: Showing first response
fi_fi: Näytetään ensimmäinen vastaus

source: Load all responses
fi_fi: Lataa kaikki vastaukset

source: Load next %(numResponses)s responses
fi_fi: Lataa seuraavat %(numResponses)s vastausta

source: Are you sure you want to delete this post?
fi_fi: Haluatko varmasti poistaa tämän viestin?

source: We had some trouble loading the page you requested. Please try again.
fi_fi: Sivun lataamisessa tapahtui virhe. Olkaa hyvä ja yrittäkää uudestaan.

source: anonymous
fi_fi: nimetön

source: staff
fi_fi: henkilökunta

source: Community TA
fi_fi: Vapaaehtoinen opetusassistentti

source: Misuse Reported, click to remove report
fi_fi: Ilmoitettu väärinkäytöksestä. Klikkaa poistaaksesi ilmoitus

source: Are you sure you want to delete this comment?
fi_fi: Haluatko varmasti poistaa tämän kommentin?

source: We had some trouble deleting this comment. Please try again.
fi_fi: Kommentin poisto epäonnistui. Yritä uudelleen.

source: Are you sure you want to delete this response?
fi_fi: Haluatko varmasti poistaa tämän vastauksen?

source: Drop target image
fi_fi: Pudota kohdekuva.

source: dragging out of slider
fi_fi: raahataan vierityspalkin ulkopuolelle

source: dragging
fi_fi: raahataan

source: dropped in slider
fi_fi: tiputettu vierityspalkkiin

source: dropped on target
fi_fi: tiputettu kohteeseen

source: %s ago
fi_fi: %s sitten

source: %s from now
fi_fi: %s tästä hetkestä

source: less than a minute
fi_fi: alle minuutti

source: about a minute
fi_fi: noin minuutti

source: %d minute
fi_fi: %d minuutti

source: about an hour
fi_fi: noin tunti

source: about %d hour
fi_fi: noin %d tunnin

source: a day
fi_fi: yksi päivä

source: %d day
fi_fi: %d päivä

source: about a month
fi_fi: noin kuukausi

source: %d month
fi_fi: %d kuukausi

source: about a year
fi_fi: noin vuosi

source: %d year
fi_fi: %d vuosi

source: User
fi_fi: Käyttäjä

source: Annotation
fi_fi: Huomautus

source: Start
fi_fi: Aloita

source: End
fi_fi: Lopeta

source: #Replies
fi_fi: #Vastaukset

source: Date posted
fi_fi: Julkaisupäivämäärä

source: More
fi_fi: Lisää

source: My Notes
fi_fi: Muistiinpanoni

source: Instructor
fi_fi: Opettaja

source: Public
fi_fi: Julkinen

source: Search
fi_fi: Haku

source: Users
fi_fi: Käyttäjät

source: Tags
fi_fi: Tagit

source: Annotation Text
fi_fi: Huomautusteksti

source: Clear
fi_fi: Tyhjennä

source: Text
fi_fi: Teksti

source: Image
fi_fi: Kuva

source: Reply
fi_fi: Vastaus

source: Edit
fi_fi: Muokkaa

source: Tags:
fi_fi: Tagit:

source: Available %s
fi_fi: Saatavilla olevat %s

source: This is the list of available %s. You may choose some by selecting them in the box below and then clicking the "Choose" arrow between the two boxes.
fi_fi: Tämä on lista saatavilla olevista %s. Voit tehdä valintoja klikkaamalla "Valinta"-nuolta alla olevassa laatikossa.

source: Type into this box to filter down the list of available %s.
fi_fi: Kirjoita tähän laatikkoon suodattaaksesi listaa %s.

source: Filter
fi_fi: Suodata

source: Choose all
fi_fi: Valitse kaikki

source: Click to choose all %s at once.
fi_fi: Klikkaa valitaksesi kaikki %s kerralla.

source: Choose
fi_fi: Valitse

source: Remove
fi_fi: Poista

source: Chosen %s
fi_fi: Valitut %s

source: This is the list of chosen %s. You may remove some by selecting them in the box below and then clicking the "Remove" arrow between the two boxes.
fi_fi: Tämä on lista valituista %s. Voit poistaa valintoja klikkaamalla valitsemalla ne alla olevasta laatikosta ja klikkaamalla "Poista"-nuolta.

source: Remove all
fi_fi: Poista kaikki

source: Click to remove all chosen %s at once.
fi_fi: Klikkaa poistaaksesi kaikki valitut %s kerralla.

source: %(sel)s of %(cnt)s selected
fi_fi: %(sel)s / %(cnt)s valittu

source: You have unsaved changes on individual editable fields. If you run an action, your unsaved changes will be lost.
fi_fi: Sinulla on tallentamattomia muutoksia. Jos teet tämän toiminnon, nämä muutokset katoavat.

source: You have selected an action, but you haven't saved your changes to individual fields yet. Please click OK to save. You'll need to re-run the action.
fi_fi: Olet valinnut toiminnon, mutta et ole tallentanut muutoksiasi vielä. Klikkaa OK tallentaaksesi ja valitse toiminto uudestaan.

source: You have selected an action, and you haven't made any changes on individual fields. You're probably looking for the Go button rather than the Save button.
fi_fi: Valitsit toiminnon, mutta et ole tehnyt mitään muutoksia. Valitse "Eteenpäin" "Tallenna"-toiminnon sijaan.

source: January|February|March|April|May|June|July|August|September|October|November|December
fi_fi: Tammikuu|Helmikuu|Maaliskuu|Huhtikuu|Toukokuu|Kesäkuu|Heinäkuu|Elokuu|Syyskuu|Lokakuu|Marraskuu|Joulukuu

source: S|M|T|W|T|F|S
fi_fi: su|ma|ti|ke|to|pe|la

source: Show
fi_fi: Näytä

source: Hide
fi_fi: Piilota

source: Sunday|Monday|Tuesday|Wednesday|Thursday|Friday|Saturday
fi_fi: Sunnuntai|Maanantai|Tiistai|Keskiviikko|Torstai|Perjantai|Lauantai

source: Now
fi_fi: Nyt

source: Clock
fi_fi: Kello

source: Choose a time
fi_fi: Valitse aika

source: Midnight
fi_fi: Keskiyö

source: 6 a.m.
fi_fi: klo 6 aamulla

source: Noon
fi_fi: Keskipäivä

source: Today
fi_fi: Tänään

source: Calendar
fi_fi: Kalenteri

source: Yesterday
fi_fi: Eilen

source: Tomorrow
fi_fi: Huomenna

source: Open Calculator
fi_fi: Avaa laskin

source: Close Calculator
fi_fi: Sulje laskin

source: Preview
fi_fi: Esikatselu

source: Post body
fi_fi: Viestin teksti

source: Error fetching distribution.
fi_fi: Arvosanajakauman hakeminen epäonnistui

source: Unavailable metric display.
fi_fi: Ei tilastoja saatavilla

source: Error fetching grade distributions.
fi_fi: Arvosanajakauman hakeminen epäonnistui

source: Last Updated: <%= timestamp %>
fi_fi: Päivitetty viimeksi: <%= timestamp %>

source: <%= num_students %> students scored.
fi_fi: <%= num_students %> opiskelijaa arvosteltu.

source: Loading...
fi_fi: Ladataan...

source: Error getting student list.
fi_fi: Virhe opiskelijalistan lataamisessa

source: Error retrieving grading configuration.
fi_fi: Virhe arviointiasetusten lataamisessa

source: Error generating grades. Please try again.
fi_fi: Virhe arvosanojan generoinnissa. Yritä uudelleen.

source: File Name
fi_fi: Tiedostonimi

source: Links are generated on demand and expire within 5 minutes due to the sensitive nature of student information.
fi_fi: Linkit generoidaan vain tarpeen vaatiessa ja ne vanhentuvat 5 minuutissa opiskelijoiden tietosuojan takia.

source: Username
fi_fi: Käyttäjänimi

source: Email
fi_fi: Sähköposti

source: Revoke access
fi_fi: Estä pääsy

source: Enter username or email
fi_fi: Syötä käyttäjätunnus tai salasana

source: Please enter a username or email.
fi_fi: Kerro käyttäjänimi tai sähköpostiosoite.

source: Error fetching list for role
fi_fi: Virhe: Error fetching list for role

source: Error changing user's permissions.
fi_fi: Virhe käyttöoikeuksien muuttamisessa.

source: Could not find a user with username or email address '<%= identifier %>'.
fi_fi: Käyttäjää käyttäjänimellä tai sähköpostiosoitteella '<%= identifier %>' ei löytynyt.

source: Error: User '<%= username %>' has not yet activated their account. Users must create and activate their accounts before they can be assigned a role.
fi_fi: Virhe: Käyttäjä '<%= username %>' ei ole vielä aktivoinut käyttäjätiliään. Käyttäjien täytyy luoda ja aktivoida käyttäjätilinsä ennen kuin heille voidaan asettaa rooli.

source: Error: You cannot remove yourself from the Instructor group!
fi_fi: Virhe: Et voi poistaa itseäsi ohjaajien ryhmästä!

source: Error adding/removing users as beta testers.
fi_fi: Virhe lisästessä/poistaessa beta-testaajia.

source: These users were successfully added as beta testers:
fi_fi: Seuraavien käyttäjien lisääminen beta-testaajiksi onnistui:

source: These users were successfully removed as beta testers:
fi_fi: Seuraavat käyttäjät poistettiin onnistuneesti beta-testaajien listasta:

source: These users were not added as beta testers:
fi_fi: Seuraavia käyttäjiä ei lisätty beta-testaajiksi:

source: These users were not removed as beta testers:
fi_fi: Seuraavia käyttäjiä ei poistettu beta-testaajien listasta:

source: Users must create and activate their account before they can be promoted to beta tester.
fi_fi: Käyttäjien täytyy luoda ja aktivoida käyttäjätilinsä ennen kuin heidät voidaan lisätä beta-testaajiksi.

source: Could not find users associated with the following identifiers:
fi_fi: Käyttäjiä seuraavilla tunnisteilla ei löytynyt:

source: Error enrolling/unenrolling users.
fi_fi: Virhe käyttäjiä rekisteröitäessä/rekisteröintejä poistaessa.

source: The following email addresses and/or usernames are invalid:
fi_fi: Seuraavat sähköpostiosoitteet ja/tai käyttäjänimet ovat väärin:

source: Successfully enrolled and sent email to the following users:
fi_fi: Rekisteröinti ja sähköpostin lähetys onnistui seuraaville käyttäjille:

source: Successfully enrolled the following users:
fi_fi: Seuraavien käyttäjien rekisteröinti onnistui:

source: Successfully sent enrollment emails to the following users. They will be allowed to enroll once they register:
fi_fi: Rekisteröitymissähköpostien lähettäminen seuraaville käyttäjille onnistui. He saavat rekisteröityä kurssille, kun he ovat luoneet käyttäjätilin:

source: These users will be allowed to enroll once they register:
fi_fi: Seuraavat käyttäjät saavat rekisteröityä kurssille, kun he ovat luoneet käyttäjätilin:

source: Successfully sent enrollment emails to the following users. They will be enrolled once they register:
fi_fi: Rekisteröitymissähköpostien lähettäminen seuraavilla käyttäjille onnistui. Heidät rekisteröidään kurssille, kun he ovat luoneet käyttäjätilin:

source: These users will be enrolled once they register:
fi_fi: Seuraavat käyttäjät tullaan rekisteröimään kurssille, kun he ovat luoneet käyttäjätilin:

source: Emails successfully sent. The following users are no longer enrolled in the course:
fi_fi: Sähköpostien lähetys onnistui. Seuraavat käyttäjät eivät enää ole rekisteröityneet kurssille:

source: The following users are no longer enrolled in the course:
fi_fi: Seuraavat käyttäjät eivät enää ole rekisteröityneet kurssille:

source: These users were not affiliated with the course so could not be unenrolled:
fi_fi: Seuraavien käyttäjien poistaminen kurssilta epäonnistui, koska he eivät olleet rekisteröityneet kurssille:

source: Your message must have a subject.
fi_fi: Viestilläsi pitää olla aihe.

source: Your message cannot be blank.
fi_fi: Viestisi ei voi olla tyhjä.

source: Your email was successfully queued for sending.
fi_fi: Sähköpostisi on jonossa lähetystä varten.

source: You are about to send an email titled '<%= subject %>' to yourself. Is this OK?
fi_fi: Olet lähettämässä sähköpostin itsellesi otsikolla '<%= subject %>'. Hyväksytäänkö?

source: You are about to send an email titled '<%= subject %>' to everyone who is staff or instructor on this course. Is this OK?
fi_fi: Olet lähettämässä sähköpostin otsikolla '<%= subject %>' kaikille henkilökunnan jäsenille ja ohjaajille. Hyväksytäänkö?

source: You are about to send an email titled '<%= subject %>' to ALL (everyone who is enrolled in this course as student, staff, or instructor). Is this OK?
fi_fi: Olet lähettämässä sähköpostin otsikolla '<%= subject %>' KAIKILLE (opiskelijoille, henkilökunnan jäsenille ja ohjaajille). Hyväksytäänkö?

source: Your email was successfully queued for sending. Please note that for large classes, it may take up to an hour (or more, if other courses are simultaneously sending email) to send all emails.
fi_fi: Sähköpostisi on jonossa lähettämistä varten. (Isoille massoille kaikkien viestien toimittaminen voi kestää jonkun aikaa.)

source: Error sending email.
fi_fi: Virhe sähköpostin lähettämisessä.

source: There is no email history for this course.
fi_fi: Tällä kurssilla ei ole lähetettyjä sähköposteja.

source: There was an error obtaining email task history for this course.
fi_fi: Virhe kurssin sähköpostitehtävien lataamisessa.

source: Please enter a student email address or username.
fi_fi: Kerro opiskelijan sähköpostiosoite tai käyttäjänimi.

source: Error getting student progress url for '<%= student_id %>'. Make sure that the student identifier is spelled correctly.
fi_fi: Virhe hakiessa opiskelijan edistymisen url:ia opiskelijalle '<%= student_id %>'. Varmista, että opiskelijan tunniste on kirjoitettu oikein.

source: Please enter a problem location.
fi_fi: Anna tehtävän sijainti, esim. URL

source: Success! Problem attempts reset for problem '<%= problem_id %>' and student '<%= student_id %>'.
fi_fi: Tehtävän yrityskertojen nollaus tehtävässä '<%= problem_id %>' opiskelijalle '<%= student_id %>' onnistui.

source: Error resetting problem attempts for problem '<%= problem_id %>' and student '<%= student_id %>'. Make sure that the problem and student identifiers are complete and correct.
fi_fi: Tapahtui virhe tehtävän yrityskertojen nollauksessa tehtävässä '<%= problem_id %>' opiskelijalle '<%= student_id %>'. Varmista, että tehtävän ja opiskelijan tunnisteet ovat kokonaisuudessaan ja oikein ilmoitettu.

source: Delete student '<%= student_id %>'s state on problem '<%= problem_id %>'?
fi_fi: Poistetaanko opiskelijan '<%= student_id %>' status ongelmassa '<%= problem_id %>'?

source: Error deleting student '<%= student_id %>'s state on problem '<%= problem_id %>'. Make sure that the problem and student identifiers are complete and correct.
fi_fi: Virhe poistettaessa opiskelijan '<%= student_id %>' tilaa tehtävässä '<%= problem_id %>'. Varmista, että tehtävän ja opiskelijan tunnisteet ovat kirjoitettu kokonaisuudessaan ja oikein.

source: Module state successfully deleted.
fi_fi: Moduulin tilan poistaminen onnistui.

source: Started rescore problem task for problem '<%= problem_id %>' and student '<%= student_id %>'. Click the 'Show Background Task History for Student' button to see the status of the task.
fi_fi: Prosessi tehtävän '<%= problem_id %>' arvostelun muuttaminen opiskelijalle '<%= student_id %>' on aloitettu. Klikkaa painiketta 'Näytä opiskelijen taustalla ajettavien tehtävien historia' nähdäksesi prosessin tilan.

source: Error starting a task to rescore problem '<%= problem_id %>' for student '<%= student_id %>'. Make sure that the the problem and student identifiers are complete and correct.
fi_fi: Tapahtui virhe aloitettaessa prosessia tehtävän '<%= problem_id %>' arvosanan muuttamiseksi opiskelijalle '<%= student_id %>'. Varmista, että tehtävän ja opiskelijan tunnisteet on kirjoitettu kokonaisuudessaan ja oikein.

source: Error getting task history for problem '<%= problem_id %>' and student '<%= student_id %>'. Make sure that the problem and student identifiers are complete and correct.
fi_fi: Tapahtui virhe haettaessa toimintohistoriaa tehtävälle '<%= problem_id %>' ja opiskelijalle '<%= student_id %>'. Varmista, että tehtävän ja opiskelijan tunnisteet on kirjoitettu kokonaisuudessaan ja oikein.

source: Reset attempts for all students on problem '<%= problem_id %>'?
fi_fi: Resetoidaanko opiskelijan yrityskerrat tehtävässä '<%= problem_id %>'?

source: Successfully started task to reset attempts for problem '<%= problem_id %>'. Click the 'Show Background Task History for Problem' button to see the status of the task.
fi_fi: Prosessi tehtävän '<%= problem_id %>' yrityskertojen nollaamiseksi on aloitettu. Klikkaa painiketta 'Näytä opiskelijen taustalla ajettavien tehtävien historia' nähdäksesi prosessin tilan.

source: Error starting a task to reset attempts for all students on problem '<%= problem_id %>'. Make sure that the problem identifier is complete and correct.
fi_fi: Tapahtui virhe aloitettaessa prosessia tehtävän '<%= problem_id %>' yrityskertojen nollaamiseksi kaikille opiskelijoille. Varmista, että tehtävän tunniste on kirjoitettu kokonaisuudessaan ja oikein.

source: Rescore problem '<%= problem_id %>' for all students?
fi_fi: Muutetaanko tehtävän '<%= problem_id %>' arvostelua kaikille opiskelijoille?

source: Successfully started task to rescore problem '<%= problem_id %>' for all students. Click the 'Show Background Task History for Problem' button to see the status of the task.
fi_fi: Prosessi tehtävän '<%= problem_id %>' arvosanan muuttamiseksi kaikille opiskelijoille on aloitettu. Klikkaa painiketta 'Näytä opiskelijen taustalla ajettavien tehtävien historia' nähdäksesi prosessin tilan.
