Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Have questions?
kk_kz: Мәселелер бар ма?

source: Please read {a_start}our FAQs to view common questions about our certificates{a_end}.
kk_kz: {a_end} біздің сертификаттар туралы кәдімгі мәселелерді қарау үшін біздің FAQ {a_start} оқыңыз.

source: You are upgrading your registration for
kk_kz: Сіз тіркеу мәртебесін .... өзертіп жатырсыз

source: You are re-verifying for
kk_kz: Сіз .... үшін қайта растайсыз

source: You are registering for
kk_kz: Сіз ....үшін тіркелесіз

source: Upgrading to:
kk_kz: дейін жаңарту

source: Re-verifying for:
kk_kz: үшін қайта анықтау

source: Registering as:
kk_kz: ретінде тіркеу

source: Change your mind?
kk_kz: Айнып қалдыңыз ба?

source: You can always continue to audit the course without verifying.
kk_kz: Сіз өз тұлғаңызды растамай тыңдаушы ретінде курсты жалғастыра аласыз.

source: You can always {a_start} audit the course for free {a_end} without verifying.
kk_kz: Сіз әрқашан растаусыз {a_start} курсты ақысыз тексере {a_start} аласыз.

source: Technical Requirements
kk_kz: Қажетті техникалық құралдар

source: Edit Your Full Name
kk_kz: Сіздің толық атыңызды редакциялаңыз

source: Re-Verify
kk_kz: Қайта анықтау

source: No Webcam Detected
kk_kz: Вебкамера табылмады

source: You don't seem to have a webcam connected. Double-check that your webcam is connected and working to continue.
kk_kz: Веб-камераны табу мүмкін болмады. Тіркеуді жалғастыру үшін веб-камераның компьютерге қосылғанын және оның дұрыстығын тексеріңіз.

source: No Flash Detected
kk_kz: Flash табылмады.

source: You don't seem to have Flash installed. {a_start} Get Flash {a_end} to continue your registration.
kk_kz: Сіз Flash орналымаған сияқты. Сіздің тіркеуіңізді жалғстыру үшін {a_start} Flash {a_end} орнатыңыз.

source: Error submitting your images
kk_kz: Бейнелерді жүктеу кезінде қателік

source: Oops! Something went wrong. Please confirm your details and try again.
kk_kz: Қателік! Бір нәрсе дұрыс болмады. Сіз деректеріңізді тексеріңі және тағы бір рет көріңіз.

source: Re-Take Your Photo
kk_kz: Қайта түсіруді жасау

source: Use your webcam to take a picture of your face so we can match it with your original verification.
kk_kz: Сіздің бетіңізді суретке түсіру үшін вебкамераны пайдаланыңыз, оны сіздің бірінші өтініміңізбен біз салыстырамыз

source: Don't see your picture? Make sure to allow your browser to use your camera when it asks for permission.
kk_kz: Сіз бейнені көрмей тұрсыз ба? Сіз браузерге, ол сұраған кезде Сіздің камераны пайдалануға рұқсат еткеніңізге көз жеткізіңіз

source: Retake
kk_kz: Суретті қайта жасаңыз

source: Take photo
kk_kz: Суретті жасаңыз

source: Looks good
kk_kz: Жақсы көрінеді

source: Tips on taking a successful photo
kk_kz: Ойдағыдай суретті жасау үшін кеңестер

source: Make sure your face is well-lit
kk_kz: Сіздің бетіңізге жақсы жарық түсетініне көз жеткізіңіз

source: Be sure your entire face is inside the frame
kk_kz: Сіздің бетіңіз жиектеменің ішінде тұрғанына көз жеткізіңіз

source: Can we match the photo you took with the one on your ID?
kk_kz: Сіздің құжаттағы суретпен Сіз жасаған суретті біз салыстыра аламыз ба?

source: Once in position, use the camera button
kk_kz: Сіз қажетті жағдайда болған кезде камераның клавишасын басыңыз

source: to capture your picture
kk_kz: Сіздің суретті жасау үшін

source: Use the checkmark button
kk_kz: Қанатбелгісімен клавишаны басыңыз

source: once you are happy with the photo
kk_kz: Сіз риза болғаннан кейін сурет

source: Common Questions
kk_kz: Жалпы мәселелер

source: Why do you need my photo?
kk_kz: Сізге менің суретім неге керек?

source: As part of the verification process, we need your photo to confirm that you are you.
kk_kz: Сіз-бұл Сіз екенін растау үшін, растау процесінің бөлігі ретінде бізге Сіздің суретіңіз керек.

source: What do you do with this picture?
kk_kz: Сіз осы бейнемен не істейсіз?

source: We only use it to verify your identity. It is not displayed anywhere.
kk_kz: Біз оны тек қана Сіздің тұлғаны растау үшін пайдаланамыз. Бұл ешбір жерде бейнеленбейді.

source: Check Your Name
kk_kz: Сіздің атыңызды тексеріңіз

source: Make sure your full name on your edX account ({full_name}) matches the ID you originally submitted. We will also use this as the name on your certificate.
kk_kz: edX есептік жазбасында көрсетілген Сіздің толық атыңыз Сіз бастапқыда ұсынған құжаттағы атқа ({full_name}) сәйкес келетініне көз жеткізіңіз. Осы ат Сіздің сертификатта көрсетілген болады.

source: Edit your name
kk_kz: Сіздің атыңызды редакциялаңыз

source: Once you verify your photo looks good and your name is correct, you can finish your re-verification and return to your course. <strong>Note: You will not have another chance to re-verify.</strong>
kk_kz: Сіздің суретіңіз жақсы көрінетінін, және сіздің атыңыз дұрыс екенін сіз растағаннан кейін, сіз растауды аяқтай және курсқа қайта аласыз. <strong>Назар аударыңыз: Сізде қайта растау үшін мүмкіндік болмайды.</strong>

source: Yes! You can confirm my identity with this information.
kk_kz: Иә! Осы ақпараттың негізінде сіз менің тұлғамды растай аласыз.

source: Submit photos &amp; re-verify
kk_kz: &amp суретті жіберу; қайта анықтаудан өту

source: Re-Verification Submission Confirmation
kk_kz: Қайта анықтау үшін жіберуді растау

source: Your Credentials Have Been Updated
kk_kz: Сәйкестендірілген ақпарат жаңартылды

source: We have received your re-verification details and submitted them for review. Your dashboard will show the notification status once the review is complete.
kk_kz: Біз сіздің қайтарастаудың егжей-тегжейлерін алдық және оларды қарастыруға жібердік. Қарастыру аяқталғаннан кейін сіздің үстеліңіз хабарландыруды көрсетеді.

source: Please note: The professor may ask you to re-verify again at other key points in the course.
kk_kz: Есте сақтаңыз: Профессор курстың басқа негізгі уақыттарында тағы бір рет қайтарасталуды сұрайтын болады.

source: Complete your other re-verifications
kk_kz: Сіздің басқа қайтарасталуыңызды аяқтаңыз

source: Return to where you left off
kk_kz: Сіз тоқтаған кезден бастау

source: Reverification Status
kk_kz: Қайта анықтаудың мәртебесі

source: You are in the ID Verified track
kk_kz: Сіз расталған ID жұмыс режиміндесіз

source: You currently need to re-verify for the following courses:
kk_kz: Қазіргі уақытта сізге келесі курстар үшін қайта анықтауды өту қажет:

source: Re-verify by {date}
kk_kz: {date} қайта анықтау

source: You currently need to re-verify for the following course:
kk_kz: Қазіргі уақытта сізге келесі курс үшін қайтарасталу қажет:

source: You have no re-verifications at present.
kk_kz: Қазіргі уақытта сізге қайтарастау керек емес

source: The status of your submitted re-verifications:
kk_kz: Сіздің берілген қайтарасталуыңыздың мәртебесі:

source: Failed
kk_kz: Сәтсіз

source: Don't want to re-verify right now?
kk_kz: Дәл қазір қайта анықтауды өткіңіз келмей ме?

source: Why do I need to re-verify?
kk_kz: Неліктен қайта анықтау талап етіледі?

source: At key points in a course, the professor will ask you to re-verify your identity by submitting a new photo of your face. We will send the new photo to be matched up with the photo of the original ID you submitted when you signed up for the course. If you are taking multiple courses, you may need to re-verify multiple times, once for every important point in each course you are taking as a verified student.
kk_kz: Курстың негізгі кезеңдерінде, профессор сіздің тұлғаңызды қайтарастауды сұрайды. Сіз курсқа тіркелу кезінде сіз көрсеткен түпнұсқа ID суретімен салыстыру үшін жаңа суретті жіберуіңіз керек. Егер сіз бірнеше курстарда оқысаңыз сізге өзіңізді бірнеше рет, бір рет расталған студент ретінде сіз оқитын әрбір курстың әрбір маңызды нүктесі үшін қайта растау талап етілуі мүмкін.

source: What will I need to re-verify?
kk_kz: Тұлғаны қайта растау үшін маған не керек?

source: Because you are just confirming that you are still you, the only thing you will need to do to re-verify is to <b>submit a new photo of your face with your webcam</b>. The process is quick and you will be brought back to where you left off so you can keep on learning.
kk_kz: Сіз –бұл сіз екеніңізді ғана растайтын болғандықтан, қайтарасталу үшін сізге - <b> вебкамера арқылы түсірілген </b>сіздің бетіңіздің жаңа суретін жіберу керек. Бұл тез процесс, және сіз әрқашан тоқталған жеріңізге қайтасыз және оқытуды жалғастырасыз.

source: If you changed your name during the semester and it no longer matches the original ID you submitted, you will need to re-edit your name to match as well.
kk_kz: Егер Сіздің атыңыз ағымдағы семестрде өзгерсе, және енді бұдан бұрын Сіз ұсынған құжаттағы атпен сәйкес келмесе, Сізге сондай-ақ есептік жазбада өз атыңызды өзгертуге тура келеді.

source: What if I have trouble with my re-verification?
kk_kz: Егер қайта анықтаумен қиыншылықтар туындаса не істеу керек?

source: Because of the short time that re-verification is open, you <strong>will not be able to correct a failed verification</strong>. If you think there was an error in the review, please contact us at {email}
kk_kz: Қайтарастауға берілген қысқа уақытқа байланысты, сізде <strong> бұзылған қайтарастауды түзету мүмкіндігі болмайды</strong>. Егер сіз қарастырылуда қателік кетті деп ойласаңыз, бізге {email} жазыңыз.

source: Re-Verification
kk_kz: үшін қайта анықтау

source: Please Resubmit Your Verification Information
kk_kz: Сіздің анықтау туралы ақпаратыңызды қайта жіберіңіз

source: There was an error with your previous verification. In order proceed in the verified certificate of achievement track of your current courses, please complete the following steps.
kk_kz: Алдыңғы анықтау барысында қателік пайда болды. Ағымдағы оқыту курстары бойынша оқыту туралы куәландырылған сертификатты алу бойынша жұмысты жалғастыру үшін мынадай қадамдарды аяқтаңыз.

source: Re-Take Photo
kk_kz: Қайта Сурет

source: Re-Take ID Photo
kk_kz: Жеке Куәліктің қайта суреті

source: Use your webcam to take a picture of your face so we can match it with the picture on your ID.
kk_kz: Сіздің бетіңіздің суретін жасау үшін, сіздің құжатыңыздағы суретпен оны салыстыру үшін Сіздің вебкамераңызды пайдаланыңыз.

source: Once you verify your photo looks good, you can move on to step 2.
kk_kz: Сіздің суретіңіз жақсы көрінетінін Сіз растағаннан кейін, Сіз 2

source: Go to Step 2: Re-Take ID Photo
kk_kz: -қадамға өте аласыз. 2-қадамға өту: Жеке Куәліктің қайта суреті

source: Show Us Your ID
kk_kz: Бізге Сіздің құжатыңызды көрсетіңіз

source: Use your webcam to take a picture of your ID so we can match it with your photo and the name on your account.
kk_kz: Сіздің құжатыңызды суретке түсіру үшін, сіздің суретпен және Сіздің аккаунттағы атыңызбен оны біз салыстыру үшін Сіздің вебкамераңызды пайдаланыңыз.

source: Make sure your ID is well-lit
kk_kz: Сіздің құжатқа жақсы жарық түсетініне көз жеткізіңіз

source: Acceptable IDs include drivers licenses, passports, or other goverment-issued IDs that include your name and photo
kk_kz: Жарамды құжаттардың құрамына жүргізуші куәлігі, паспорттар немесе Сіздің атыңыз және суретіңіз бар мемлекет шығарған басқа құжаттар

source: Check that there isn't any glare
kk_kz: Бейнеге жарық қатты түспеуін тексеріңіз

source: Ensure that you can see your photo and read your name
kk_kz: Сіздің суретті сіз көре және Сіздің атыңызды оқи алатыныңызға көз жеткізіңіз

source: Try to keep your fingers at the edge to avoid covering important information
kk_kz: Маңызды ақпаратты жауып алмау үшін бармақтарды шетте ұстауға тырысыңыз

source: to capture your ID
kk_kz: Сіздің құжаттың суретін жасау

source: Why do you need a photo of my ID?
kk_kz: Сізге менің құжатымның суреті неге керек?

source: We need to match your ID with your photo and name to confirm that you are you.
kk_kz: Сіз-бұл Сіз екеніңізді растау үшін бізге сіздің құжатты Сіздің суретпен және атыңызбен салыстыру қажет.

source: We encrypt it and send it to our secure authorization service for review. We use the highest levels of security and do not save the photo or information anywhere once the match has been completed.
kk_kz: Біз оны шифрлаймыз және тексеру үшін біздің авторланудың қорғалған сервисіне жібереміз. Біз қауіпсіздіктің ең жоғары деңгейін пайдаланамыз және суретті немесе ақпаратты салыстыру аяқталғаннан кейін қандай да бір жерде сақтаймыз.

source: Once you verify your ID photo looks good, you can move on to step 3.
kk_kz: Сіздің суретіңіз жақсы көрінетінін Сіз растағаннан кейін, Сіз 3-қадамға өте аласыз.

source: Go to Step 3: Review Your Info
kk_kz: 3-қадамға өтіңіз: Сіздің деректеріңізді тексеріңіз

source: Verify Your Submission
kk_kz: Сіздің келісіміңізді растаңыз

source: Make sure we can verify your identity with the photos and information below.
kk_kz: Біз төменде келтірілген суреттің және ақпараттың көмегімен Сіздің тұлғаны растай алатынымызға көз жеткізіңіз

source: Review the Photos You've Re-Taken
kk_kz: Жасалған суреттерді қарау

source: Please review the photos and verify that they meet the requirements listed below.
kk_kz: Суретті тексеріңіз және олар төменде келтірілген талаптарға сәйкес келетінін растаңыз

source: The photo above needs to meet the following requirements:
kk_kz: Жоғарыдағы сурет мынадай талаптарға сәйкес келуі тиіс

source: Be well lit
kk_kz: Жарық жеткілікті жақсы болуы тиіс

source: Show your whole face
kk_kz: Сіздің бетіңізді толық көрсетіңіз

source: The photo on your ID must match the photo of your face
kk_kz: Сіздің құжатыңыздағы сурет Сіздің бетіңізбен сәйкес болуы тиіс

source: Be readable (not too far away, no glare)
kk_kz: Оқылатын болуы тиіс (тым алыс, тым жарық болмауы тиіс)

source: The name on your ID must match the name on your account below
kk_kz: Сіздің құжатыңыздағы ат төмендегі Сіздің аккаунттағы атпен сәйкес келуі тиіс

source: Photos don't meet the requirements?
kk_kz: Сурет талаптарға сәйкес келмейді ме?

source: Retake Your Photos
kk_kz: Сіздің суретіңізді қайта түсіріңіз

source: Make sure your full name on your edX account ({full_name}) matches your ID. We will also use this as the name on your certificate.
kk_kz: edX есептік жазбасында көрсетілген Сіздің толық атыңыз Сіз бастапқыда ұсынған құжаттағы атқа ({full_name}) сәйкес келетініне көз жеткізіңіз. Осы ат Сіздің сертификатта көрсетілген болады.

source: Once you verify your details match the requirements, you can move onto to confirm your re-verification submisssion.
kk_kz: Сіздің деректеріңіз талап етілгендерге сәйкес келетінін сіз растағаннан кейін, сіз қайта анықтау үшін деректерді растауға өте аласыз.

source: Yes! My details all match.
kk_kz: Иә! Менің барлық деректерім сәйкес келеді.

source: Upgrade Your Registration for {} | Verification
kk_kz: Анықтауда{} | тіркеу мәртебесін өзгерту

source: Register for {} | Verification
kk_kz: Растау {} | үшін тіркеліңіз

source: You don't seem to have a webcam connected. Double-check that your webcam is connected and working to continue registering, or select to {a_start} audit the course for free {a_end} without verifying.
kk_kz: Сіздің вебкамера компьютермен байланыспаған сияқты. Тіркеуді жалғастыру үшін сіздің вебкамера компьютермен байланысқанын және жұмыс істейтінін тағы бір рет тексеріңіз, немесе растаусыз {a_end} курстың ақысыз тексерісін {a_start} таңдаңыз.

source: Error processing your order
kk_kz: Тіздің тапсырысты өткізуде қателік

source: Oops! Something went wrong. Please confirm your details again and click the button to move on to payment. If you are still having trouble, please try again later.
kk_kz: Ой! Бір нәрсе дұрыс емес. Сіздің деректеріңізді қайта растаңыз және төлемге өту үшін бастырмаға басыңыз. Егер сізде әлі проблемалар пайда болса, кейін тағы талпыныңыз.

source: Take Your Photo
kk_kz: Сіздің суретіңізді түсіріңіз

source: What if my camera isn't working?
kk_kz: Егер менің камерам жұмыс істемесе ше?

source: Go to Step 2: Take ID Photo
kk_kz: 2-қадамға өтіңіз: құжаттың суретін жасаңыз

source: Review the Photos You've Taken
kk_kz: Жасалған суреттерді қарау

source: Check Your Contribution Level
kk_kz: Сіздің жарнаңыздың мөлшерін тексеріңіз

source: Please confirm your contribution for this course (min. $
kk_kz: Осы курс үшін Сіздің жарнаңызды растаңыз (min. $

source: Once you verify your details match the requirements, you can move on to step 4, payment on our secure server.
kk_kz: Сіздің деректеріңіз талаптармен сәйкес келетінін Сіз растағаннан кейін, Сіз 4-қадамға өте аласыз, төлем біздің қорғалған серверде.

source: To continue in the ID Verified track in {course}, you need to re-verify your identity by {date}. Go to URL.
kk_kz: {course} расталған ID режимінде жұмыс істеуді жалғастыру үшін, сізге {date} көмегімен өз тұлғаңызды қайта растау керек. Сілтеме бойынша өтіңіз.

source: We've captured your re-submitted information and will review it to verify your identity shortly. You should receive an update to your veriication status within 1-2 days. In the meantime, you still have access to all of your course content.
kk_kz: Біз Сіз қайта ұсынған ақпаратты жазып алдық және Сіздің тұлғаңызды растау үшін оны жақында қараймыз. 1-2 күннің ішінде сіздің анықтаудың мәртебесі жаңартылуы тиіс. Қазіргі уақытта Сіздің оқу курсыңыздың барлық материалдарына қолжетімділік бар.

source: Return to Your Dashboard
kk_kz: Басқару үстеліне қайту

source: Re-Verification Failed
kk_kz: Қайта анықтау сәтсіз аяқталды

source: Your re-verification was submitted after the re-verification deadline, and you can no longer be re-verified.
kk_kz: Сіздің қайтарасталуыңыз дедлайннан кейін қайтарасталулар үшін берілді, және сіз оны жүзеге асыра алмайсыз.

source: Please contact support if you believe this message to be in error.
kk_kz: Егер осы хабарды қате деп санасаңыз Қолдау қызметіне жүгініңіз

source: Upgrade Your Registration for {}
kk_kz: {} тіркеу мәртебесін өзгертіңіз

source: Register for {}
kk_kz: {} үшін тіркеу

source: You need to activate your edX account before proceeding
kk_kz: Сіздің edX аккаутыңызды жалғастыру алдында белсендендіру қажет

source: Please check your email for further instructions on activating your new account.
kk_kz: Сіздің жаңа аккаунтыңызды белсендендіру бойынша бұдан арғы нұсқаулықтарды алу үшін Сіздің электрондық почтаңызды тексеріңіз

source: What You Will Need to Upgrade
kk_kz: Тіркеу мәртебесін өзгерту үшін Сізге не қажет

source: There are three things you will need to upgrade to being an ID verified student:
kk_kz: Анықталған ID студент болу үшін сақталу қажет үш талап бар.

source: What You Will Need to Register
kk_kz: Сізге тіркелу үшін не талап етіледі

source: There are three things you will need to register as an ID verified student:
kk_kz: Анықталған ID студент болу үшін сақталу қажет үш талап бар.

source: Activate Your Account
kk_kz: Сіздің аккаунтты белсендендіріңіз

source: Check your email
kk_kz: Сіздің электрондық почтаңызды тексеріңіз

source: you need an active edX account before registering - check your email for instructions
kk_kz: Сізге edX белсенді аккаунты керек, тіркелу алдында – нұсқаулықтар үшін электрондық почтаны тексеріңіз

source: Identification
kk_kz: Тұлғаны куәландыратын құжат

source: A photo identification document
kk_kz: Тұлғаны куәландыратын құжат, суретпен

source: a drivers license, passport, or other goverment or school-issued ID with your name and picture on it
kk_kz: Сіздің атыңызбен және суретіңізбен жүргізушінің куәлігі, паспорт немесе басқа мемлекеттік немесе оқу орны шығарған құжат

source: Webcam
kk_kz: Вебкамера

source: A webcam and a modern browser
kk_kz: Вебкамера және қазіргі браузер

source: Please make sure your browser is updated to the most recent version possible
kk_kz: Сіздің браузеріңіз ең соңғы қолжетімді нұсқасына дейін жаңартылған ба екенін тексеріңіз

source: Credit or Debit Card
kk_kz: Кредиттік немесе дебеттік карта

source: A major credit or debit card
kk_kz: Бас кредиттік немесе дебеттік карта

source: Visa, Master Card, American Express, Discover, Diners Club, JCB with Discover logo
kk_kz: Visa, Master Card, American Express, Discover, diners Club, Discover айдарбелгісімен JCB

source: Missing something? You can always continue to audit this course instead.
kk_kz: Бір нәрсе жетіспей ме? Сіз курсты тыңдаушы ретінде жалғастыра аласыз.

source: Missing something? You can always {a_start}audit this course instead{a_end}
kk_kz: Бір нәрсе жетіспей ме? Сіз әрқашан {a_start} курсты жай тыңдай аласыз {a_end}

source: Go to Step 1: Take my Photo
kk_kz: 1-қадамға өту: менің суретімді жасау

source: ID Verification
kk_kz: Құжатты куәландыру

source: You've Been Verified Previously
kk_kz: Сіздің тұлғаңыз бұдан бұрын расталды

source: We've already verified your identity (through the photos of you and your ID you provided earlier). You can proceed to make your secure payment and complete registration.
kk_kz: Біз Сіздің тұлғаңызды (Сіз бұдан бұрын ұсынған Сіздің суреттің және Сіздің құжаттарыңыздың суретінің көмегімен) растадық.

source: You have decided to pay $
kk_kz: Сіз $ төлеуді шештіңіз бе

source: Changes
kk_kz: Өзгерістер

source: Add article
kk_kz: Бапты қосу

source: The page that you were looking for was not found.
kk_kz: Сіз іздеген бет табылмады.

source: Go back to the {homepage} or let us know about any pages that may have been moved at {email}.
kk_kz: {homepage} өтіңіз немесе қателердің сипаттамалары бар беттердің мекенжайларын бізге {email} хабарлаңыз.

source: Studio Server Error
kk_kz: Studio серверінде қате

source: The <em>Studio</em> servers encountered an error
kk_kz: <em>Studio</em> серверінде қате орын алды

source: An error occurred in Studio and the page could not be loaded. Please try again in a few moments.
kk_kz: Сервердегі қатеге байланысты бетті қайта жүктеу мүмкін емес. Әрекетті бірнеше минуттан кейін қайталап көріңіз.

source: We've logged the error and our staff is currently working to resolve this error as soon as possible.
kk_kz: Сізде техникалық олқылықтар туындады. Біздің қызметкерлер онымен жұмыс істеуде. Жақын уақытта проблема жойылатын болады.

source: If the problem persists, please email us at {email_link}.
kk_kz: Егер проблема түзетілмесе, бізбен мына мекенжай бойынша байланысыңыз{email_link}.

source: Studio Account Activation
kk_kz: Есептік жазбаны белсендендіру

source: Your account is already active
kk_kz: Бұл есептік жазба белсендірілген болатын.

source: This account, set up using {0}, has already been activated. Please sign in to start working within edX Studio.
kk_kz: {0}тіркелген осы аккаун белсендендірілген болатын. edX Studio жұмысты бастау үшін сайтқа кіріңіз.

source: Sign into Studio
kk_kz: Studio кіру

source: Your account activation is complete!
kk_kz: Сіздің есептік жазбаны белсендендіру аяқталды!

source: Thank you for activating your account. You may now sign in and start using edX Studio to author courses.
kk_kz: Сіздің есептік жазбаны белсендендірген үшін рахмет. Енді сіз кіре аласыз және курстар құру үшін Studio пайдалануды бастай аласыз.

source: Your account activation is invalid
kk_kz: Сіздің есептік жазба үшін жарамсыз белсендендіру

source: We're sorry. Something went wrong with your activation. Check to make sure the URL you went to was correct &mdash; e-mail programs will sometimes split it into two lines.
kk_kz: Өкінішті, біраз белсендендіру ойдағыдай болмады. Сіз ауысқан сілтеме дұрыс екендігін тексеріңіз кейде почталық бағдарламалар сілтемелерді екі бөлікке бөледі.

source: If you still have issues, contact edX Support. In the meatime, you can also return to
kk_kz: Егер сіздің әлі де сұрақтарыңыз болса edX техқолдауына хабарласыңыз. Әзірге сіз мынаған орала аласыз

source: Contact edX Support
kk_kz: edX техқолдауына хабарласу

source: Files &amp; Uploads
kk_kz: Файлдар және Жүктемелер

source: Content
kk_kz: Мазмұны

source: Page Actions
kk_kz: Беттегі әрекеттер

source: Upload New File
kk_kz: Жаңа файлды жүктеу

source: Loading&hellip;
kk_kz: &hellip жүктеу;
