Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: Explore free courses from {university_name}.
kk_kz: {university_name} ақысыз курстарымен танысыңыз.

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible. Please email us at {tech_support_email}' to report any problems or downtime.
kk_kz: Өкінішке орай, осы модуль уақытша қолжетімсіз. Біздің қызметкерлеріміз проблеманы тезірек жоюға тырысады. Пайда болған проблемалар және олқылықтар туралы хабарлау үшін {tech_support_email} мекенжайына хабар жіберіңіз.

source: {course_number} Courseware
kk_kz: {course_number} Курс бағдарламасы

source: Return to Exam
kk_kz: Емтиханға қайту

source: Course Navigation
kk_kz: Курс бойынша навигация

source: Open Calculator
kk_kz: Калькуляторды ашу

source: Calculator Input Field
kk_kz: Калькулятор үшін енгізу алабы

source: Use the arrow keys to navigate the tips or use the tab key to return to the calculator
kk_kz: Еске түсірулер арасында ауысу үшін нұсқағыштармен клавишаларды пайдаланыңыз немесе калькуляторға қайту үшін табуляция клавишасын пайдаланыңыз

source: Hints
kk_kz: Еске түсірулер

source: Integers
kk_kz: Бүтін сандар

source: Decimals
kk_kz: Ондық бөлшек

source: Scientific notation
kk_kz: Экспоненциалды жазба

source: Appending SI postfixes
kk_kz: SI-постфикстерді қосу

source: Supported SI postfixes
kk_kz: Қолданылатын SI-постфикстер

source: Operators
kk_kz: Операторлар

source: parallel resistors function
kk_kz: параллельді резисторлардың функциясы

source: Functions
kk_kz: Функциялар

source: Constants
kk_kz: Константтар

source: Euler's number
kk_kz: Эйлер саны

source: ratio of a circle's circumference to it's diameter
kk_kz: Шеңбер ұзындығының және оның диаметрінің пропорционалды арақатынасы

source: Boltzmann constant
kk_kz: Больцман тұрақтысы

source: speed of light
kk_kz: Жарық жылдамдығы

source: freezing point of water in degrees Kelvin
kk_kz: Кельвин градусында судың қату температурасы

source: fundamental charge
kk_kz: Фундаменталды заряд

source: Calculate
kk_kz: Есептеу

source: Calculator Output Field
kk_kz: Калькулятордың шығару алабы

source: We're sorry, this module is temporarily unavailable. Our staff is working to fix it as soon as possible. Please email us at {link_to_support_email} to report any problems or downtime.
kk_kz: Өкінішке орай, осы модуль уақытша қолжетімсіз. Біздің қызметкерлеріміз проблеманы тезірек жоюға тырысады. Пайда болған проблемалар және олқылықтар туралы хабарлау үшін {tech_support_email} мекенжайына хабар жіберіңіз.

source: Grade summary
kk_kz: Бағалар кестесі

source: Not implemented yet
kk_kz: Әлі іске асырылмады

source: Gradebook
kk_kz: Бағалар журналы

source: Search students
kk_kz: Студенттерді іздеу

source: {course_number} Course Info
kk_kz: Курс туралы ақпарат {course_number}

source: View Updates in Studio
kk_kz: Studio Жаңартуларды қарау

source: Course Updates &amp; News
kk_kz: Курсты жаңарту және жаңалықтар

source: Handout Navigation
kk_kz: Көрнекті материалдар бойынша навигация

source: Course Handouts
kk_kz: Курстың көрнекті материалдары

source: View Course in Studio
kk_kz: Studio Курсты қарау

source: Instructor Dashboard
kk_kz: Оқытушының үстелі

source: Psychometrics
kk_kz: Психометрика

source: Forum Admin
kk_kz: Форумның әкімшісі

source: Enrollment
kk_kz: Курсқа жазылу

source: DataDump
kk_kz: Деректер қоймасы

source: Manage Groups
kk_kz: Топтарды басқару

source: Grade Downloads
kk_kz: Бағаларды көшіріп жүктеу

source: Note: some of these buttons are known to time out for larger courses. We have temporarily disabled those features for courses with more than {max_enrollment} students. We are urgently working on fixing this issue. Thank you for your patience as we continue working to improve the platform!
kk_kz: Ескерту: осы бастырмалардың кейбірі уақыт өткеннен кейін үлкен курстар үшін бұғатталады. Біз {max_enrollment} артық студенттердің санымен курстар үшін құрамын уақытша ажыраттық. Біз дереу тәртіпте осы проблеманы түзету үшін жұмыс істеудеміз. Біз тұғырды жақсарту үшін жұмысты жалғастырған уақытта, сіздің сабыр сақтағаныңызға рахмет!

source: Export grades to remote gradebook
kk_kz: Қашықтағы журналға бағаларды экспорттау

source: The assignments defined for this course should match the ones stored in the gradebook, for this to work properly!
kk_kz: Осы курс үшін белгіленген тапсырмалар, ол дұрыс жұмыс істеуі үшін журналда сақталатындармен ұқсас болуы тиіс!

source: Gradebook name:
kk_kz: Журналдың аты:

source: Assignment name:
kk_kz: Тапсырманың атауы:

source: Course-specific grade adjustment
kk_kz: Нақты курстар үшін бағаларды түзету

source: Then select an action:
kk_kz: Бұдан әрі әрекетті таңдаңыз:

source: These actions run in the background, and status for active tasks will appear in a table below. To see status for all tasks submitted for this problem, click on this button:
kk_kz: Осы әрекеттер фондық режимде өтеді, және белсенді тапсырмалардың мәртебесі төмендегі кестеде пайда болады. Осы тапсырма үшін жіберілген барлық тапсырмалар үшін мәртебені көру үшін осы бастырманы басыңыз:

source: Student-specific grade inspection and adjustment
kk_kz: Нақты студенттердің бағаларын қарау және түзету

source: Specify the {platform_name} email address or username of a student here:
kk_kz: Мұнда студенттің e-mail мекенжайын немесе пайдаланушы атын {platform_name} белгілеңіз:

source: Click this, and a link to student's progress page will appear below:
kk_kz: Мынада басыңыз, және студенттің алға басу бетіне арналған сілтеме төменде шығады:

source: You may also delete the entire state of a student for the specified module:
kk_kz: Сіз сондай-ақ белгілі модуль үшін студенттің барлық жағдайын жоя аласыз:

source: Rescoring runs in the background, and status for active tasks will appear in a table below. To see status for all tasks submitted for this problem and student, click on this button:
kk_kz: Қайта бағалау фондық режимде өтеді, және белсенді тапсырмалардың мәртебесі төмендегі кестеде пайда болады. Осы тапсырма үшін жіберілген барлық тапсырмалар үшін мәртебені көру үшін осы бастырманы басыңыз:

source: Select a problem and an action:
kk_kz: Тапсырманы және әрекетті таңдау:

source: User requires forum administrator privileges to perform administration tasks. See instructor.
kk_kz: Әкімшілік тапсырмаларды жүзеге асыру үшін пайдаланушы форум әкімшісінің құқытарын сұрайды. Оқытушымен байланысыңыз.

source: Explanation of Roles:
kk_kz: Рөлдерді сипаттау:

source: Forum Moderators: can edit or delete any post, remove misuse flags, close and re-open threads, endorse responses, and see posts from all cohorts (if the course is cohorted). Moderators' posts are marked as 'staff'.
kk_kz: Форумның модераторлары: хабарды редакциялайды немесе жояды, форумды дұрыс емес пайдалану туралы белгілерді түсіреді, қатысушылар құрған тақырыптарды жабады және ашады және жауаптарды ұсына алады. Олар барлық топтардың хабарларын қарай алады (егер курстың студенттері топтар бойынша бөлінген болса). Модераторлардың хабарлары \"қызметкер\" сөзімен белгіленген.

source: Forum Admins: have moderator privileges, as well as the ability to edit the list of forum moderators (e.g. to appoint a new moderator). Admins' posts are marked as 'staff'.
kk_kz: Форумның әкімшісі: модераторлардың құқықтарын пайдаланады, форум модераторларының тізіміне өзгерістер енгізе алады (мысалы, жаңа модераторды белгілеу). Әкімшілердің хабарлары \"қызметкер\" сөзімен белгіленген.

source: Community TAs: have forum moderator privileges, and their posts are labelled 'Community TA'.
kk_kz: Қоғамдастықтардың топ басы: форумда модераторлардың құқықтарына ие, сондай-ақ олардың орындары 'Қоғамдастықтардың топ басы' тэгімен бөлектенеді.

source: Enrollment Data
kk_kz: Тізімге енгізу деректері

source: Pull enrollment from remote gradebook
kk_kz: Қашықтағы журналдан тізімді ашыңыз

source: Section:
kk_kz: Бөлім:

source: Batch Enrollment
kk_kz: Топтарды тізімге енгізу

source: Enroll or un-enroll one or many students: enter emails, separated by new lines or commas;
kk_kz: Тізімге енгізіңіз немесе одан бір немесе көп студенттерді алып тастаңыз: жаңа жолдармен немесе үтірлермен оларды бөліп e-mail мекенжайын енгізіңіз;

source: Notify students by email
kk_kz: e-mail бойынша студенттерді хабардар ету

source: Auto-enroll students when they activate
kk_kz: Белсендендіру кезінде тізімге студенттерді автоматты енгізу

source: Problem urlname:
kk_kz: Тапсырмаға сілтеме:

source: Enter usernames or emails for students who should be beta-testers, one per line, or separated by commas. They will get to see course materials early, as configured via the <tt>days_early_for_beta</tt> option in the course policy.
kk_kz: Бета тестерлер болуы тиіс пайдаланушылардың аттарын немесе студенттердің электрондық мекенжайларын әрбір жолға бір бірден немесе оларды үтірмен бөліп енгізіңіз. Курстың материалдары курстың бапталымдарында <tt>days_early_for_beta</tt> опцияға сәйкес, ол басталғанға дейін оларға қолжетімді болады.

source: Send to:
kk_kz: Жіберу:

source: Myself
kk_kz: Маған

source: Staff and instructors
kk_kz: Персоналға және оқытушыларға

source: All (students, staff and instructors)
kk_kz: Барлығына (студенттерге, персоналға және оқытушыларға)

source: Subject:
kk_kz: Тақырып:

source: (Max 128 characters)
kk_kz: (Ең көбі 128 сивол)

source: Please try not to email students more than once per week. Important things to consider before sending:
kk_kz: Студенттерге электрондық почтаны аптасына бір реттен жиі жібермеуге тырысыңыз. Жіберу алдында нақтылау қажетті маңызды бөлшектер:

source: Have you read over the email to make sure it says everything you want to say?
kk_kz: Сіз айтқыңыз келетіндердің барлығы онда хабарланатынына сенімді болу үшін, сіз e-mail шынымен оқыдыңыз ба?

source: Have you sent the email to yourself first to make sure you're happy with how it's displayed, and that embedded links and images work properly?
kk_kz: Кіріктірілген сілтемелер және бейнелер дұрыс бейнеленетініне сенімді болу үшін сіз электрондық почтаның хабарын өзіңізге жібердіңіз, және сізге нәтиже ұнай ма?

source: CAUTION!
kk_kz: САҚ БОЛЫҢЫЗ!

source: Once the 'Send Email' button is clicked, your email will be queued for sending.
kk_kz: \"Электрондық почтаға хабарды жіберу\" бастырмасына басқан кезде, Сіздің хабарыңыз жіберуге кезекке қойылатын болады.

source: A queued email CANNOT be cancelled.
kk_kz: Жіберуге кезекке қойылған хабар кері қайтарыла алмайды.

source: No Analytics are available at this time.
kk_kz: Осы уақытта талдау қолжетімсіз.

source: Students enrolled (historical count, includes those who have since unenrolled):
kk_kz: Курста тіркелген студенттер (тіркеуден кейін бас тартқан студенттерді қосқанда):

source: Students active in the last week:
kk_kz: Соңғы апта ішінде белсенді студенттер:

source: Student activity day by day
kk_kz: Студенттердің белсенділігі күндер бойынша

source: Day
kk_kz: Күн

source: Students
kk_kz: Студенттер

source: Score distribution for problems
kk_kz: Тапсырмалар бойынша балл бөлу

source: Max
kk_kz: Ең көп

source: Points Earned (Num Students)
kk_kz: Еңбек сіңірілген баллдар (студенттердің саны)

source: There is no data available to display at this time.
kk_kz: Осы уақытта шығару үшін деректер жоқ.

source: Loading the latest graphs for you; depending on your class size, this may take a few minutes.
kk_kz: Кестелердің соңғы нұсқасын жүктеу өтуде, студенттердің санына байланысты, ол бірнеше минут болуы мүмкін.

source: Count of Students that Opened a Subsection
kk_kz: Кіші бөлімді ашатын студенттердің саны

source: Grade Distribution per Problem
kk_kz: Тапсырмалар бойынша грейдті бөлу

source: There are no problems in this section.
kk_kz: Осы бөлімде тапсырмалар жоқ.

source: Students answering correctly
kk_kz: Дұрыс жауап беретін студенттер

source: Number of students
kk_kz: Студенттердің саны

source: Pending Instructor Tasks
kk_kz: Оқытушының ағымдағы тапсырмалары

source: Task Type
kk_kz: Тапсырманың үлгісі

source: Task inputs
kk_kz: Тапсырманы енгізТапсырманы енгізуу

source: Task Id
kk_kz: Тапсырманың сәйкестендіргіші

source: Requester
kk_kz: Сұрау салушы

source: Task State
kk_kz: Тапсырманың жағдайы

source: Duration (sec)
kk_kz: Ұзақтығы (сек)

source: Task Progress
kk_kz: Тапсырманың алға басуы

source: unknown
kk_kz: белгісіз

source: Course errors
kk_kz: Курстың қателіктері

source: About {course_id}
kk_kz: Курс туралы {course_id}

source: Coming Soon
kk_kz: Жақында

source: About {course_number}
kk_kz: Курс туралы {course_number}

source: Access Courseware
kk_kz: Оқыту жүйесіне қолжетімділік

source: You Are Registered
kk_kz: Сіз тіркелдіңіз

source: Register for
kk_kz: тіркелу

source: Registration Is Closed
kk_kz: Тіркелу жабық

source: News - MITx 6.002x
kk_kz: Жаңалықтар - MITx 6.002x

source: Updates to Discussion Posts You Follow
kk_kz: Сіз қадағалайтын пікірталастардағы жаңа хабарлар

source: {course_number} Progress
kk_kz: Алға басу{course_number}

source: Course Progress
kk_kz: Курсты өту мәртебесі

source: View Grading in studio
kk_kz: Studio Бағаларды қарау

source: Course Progress for Student '{username}' ({email})
kk_kz: Студент үшін курстың алға басуы'{username}' ({email})

source: {earned:.3n} of {total:.3n} possible points
kk_kz: мүмкін баллдардың {total:.3n}-нен {earned:.3n}

source: Problem Scores:
kk_kz: Шешім үшін баллдар:

source: Practice Scores:
kk_kz: Тәжірибе үшін баллдар:

source: No problem scores in this section
kk_kz: Осы бөлімде тапсырмалар үшін ұпайлар жоқ

source: {course.display_number_with_default} Course Info
kk_kz: {course.display_number_with_default} курс туралы ақпарат

source: You were most recently in {section_link}. If you're done with that, choose another section on the left.
kk_kz: Соңғы рет Сіз {section_link} бөлімде болдыңыз. Егер Сіз аяқтасаңыз сол жақтан басқа бөлімді таңдаңыз.

source: Final course details are being wrapped up at this time. Your final standing will be available shortly.
kk_kz: Қазір курспен жұмыс істеудің қорытынды кезеңі өтуде. Сіздің ақырғы бағаңыз жақында қолжетімді болады.

source: Your final grade:
kk_kz: Сіздің қорытынды бағаңыз:

source: Grade required for a {cert_name_short}:
kk_kz: {cert_name_short} алу үшін қажетті баға

source: Your verified {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}. If you would like a refund on your {cert_name_long}, please contact our billing address {billing_email}
kk_kz: Сіздің {cert_name_long} күту мәртебесінде, өйткені Сізге {cert_name_short} беру фактісі Иранға, Кубаға, Сирияға және Суданға қарсы АҚШ тыйым салу әрекетіне түсуі мүмкін. Егер біздің жүйе осы елдермен сіздің байланысыңызды сәйкестендірді деп ойласаңыз, бізбен {email} почта бойынша байланысыңыз. Егер сіздің {cert_name_long} ақшаны қайтарғыңыз келсе, біздің биллинг бөлімімен байланысыңыз {billing_email}

source: Your {cert_name_long} is being held pending confirmation that the issuance of your {cert_name_short} is in compliance with strict U.S. embargoes on Iran, Cuba, Syria and Sudan. If you think our system has mistakenly identified you as being connected with one of those countries, please let us know by contacting {email}.
kk_kz: Сіздің {cert_name_long} күту мәртебесінде, өйткені Сізге {cert_name_short} беру фактісі Иранға, Кубаға, Сирияға және Суданға қарсы АҚШ тыйым салу әрекетіне түсуі мүмкін. Егер біздің жүйе осы елдермен сіздің байланысыңызды сәйкестендірді деп ойласаңыз, бізбен {email} почта бойынша байланысыңыз.

source: Your {cert_name_short} is Generating
kk_kz: Сіздің {cert_name_short} өңдеу процесінде

source: This link will open/download a PDF document
kk_kz: Осы сілтеме PDF-құжатты ашады/көшіріп жүктейді

source: Download Your {cert_name_short} (PDF)
kk_kz: {cert_name_short} (PDF) көшіріп жүктеу

source: Since we did not have a valid set of verification photos from you when your {cert_name_long} was generated, we could not grant you a verified {cert_name_short}. An honor code {cert_name_short} has been granted instead.
kk_kz: Сіздің {cert_name_long} құрылған кезде, растау үшін сізден суреттің қолданыстағы жиынын біз алмағандықтан, біз сізге расталған {cert_name_short} ұсына алмаймыз. {cert_name_short} ар-намыс коды оның орнына генерацияланған болды.

source: This link will open/download a PDF document of your verified {cert_name_long}.
kk_kz: Осы сілтеме бойынша сіз PDF форматында сіздің {cert_name_long} сертификатты аша/көшіріп жүктей аласыз.

source: Download Your ID Verified {cert_name_short} (PDF)
kk_kz: Расталған {cert_name_short} (PDF) көшіріп жүктеу

source: Complete our course feedback survey
kk_kz: Осы курс туралы пікір нысанын толтырыңыз

source: {course_number} {course_name} Cover Image
kk_kz: {course_number} {course_name} мұқаба

source: Enrolled as:
kk_kz: ретінде тізімге енгізілді

source: Honor Code
kk_kz: Ар-намыс кодексі

source: Course Completed - {end_date}
kk_kz: Курс аяқталды - {end_date}

source: Course Started - {start_date}
kk_kz: Курс басталды - {start_date}

source: Course has not yet started
kk_kz: Курс әлі басталмады

source: Course Starts - {start_date}
kk_kz: Күрс басталуда - {start_date}

source: Document your accomplishment!
kk_kz: Өз жетістіктеріңіздің құжаттармен растауын алыңыз!

source: Challenge Yourself!
kk_kz: Өзіңізді сынап көріңіз!

source: Take this course as an ID-verified student.
kk_kz: Анықталған ID студент ретінде курс өту.

source: You can still sign up for an ID verified {cert_name_long} for this course. If you plan to complete the whole course, it is a great way to recognize your achievement. {link_start}Learn more about the verified {cert_name_long}{link_end}.
kk_kz: Сіз әлі осы курс үшін {cert_name_long} анықталған ID кіре аласыз. Егер сіз бүкіл курсты аяқтауды жоспарласаңыз, бұл сіздің жетістіктеріңізді танудың керемет тәсілі. {link_start} расталған {cert_name_long}{link_end} туралы көбірек біліңіз.

source: Upgrade to Verified Track
kk_kz: Verified Track деңгейіне дейін жаңарту

source: View Archived Course
kk_kz: Мұрағаттан курсты қарау

source: View Course
kk_kz: Курсты қарау

source: Are you sure you want to unregister from
kk_kz: Сіз тіркелуден бас тарқыңыз келетініне сенімдісіз бе?

source: Are you sure you want to unregister from the verified {cert_name_long} track of
kk_kz: Сіз расталған {cert_name_long} тіркеуді шынымен жойғыңыз келе ме

source: Email Settings
kk_kz: e-mail бапталымдары

source: You need to re-verify to continue
kk_kz: Жалғастыру үшін сізге қайта анықтаудан өту қажет

source: To continue in the ID Verified track in the following courses, you need to re-verify your identity:
kk_kz: Ағымдағы курстарды расталған ID-мен жалғастыру үшін, сізге сіздің тұлғаңызды қайта тексеру керек:

source: {course_name}: Re-verify by {date}
kk_kz: {course_name}: {date} қайта анықтау

source: Notification Actions
kk_kz: Хабарламамен әрекеттер

source: To continue in the ID Verified track in {course_name}, you need to re-verify your identity by {date}.
kk_kz: Расталған ID-мен {course_name} курсты жалғастыру үшін, сізге сіздің тұлғаңызды {date} қайта растау қажет.

source: Your re-verification failed
kk_kz: Сіздің қайта анықтауыңыз сәтсіз аяқталды

source: Your re-verification for {course_name} failed and you are no longer eligible for a Verified Certificate. If you think this is in error, please contact us at {email}.
kk_kz: {course_name} үшін сіздің қайта растауыңыз мүмкін болмады, және сізде енді Растау сертификатына құқығыңыз жоқ. Егер сіз бұл қателік деп ойласаңыз, {email} почта бойынша бізбен байланысыңыз.

source: Dismiss
kk_kz: Қабылдамау

source: Re-verification now open for:
kk_kz: үшін қайта анықтау қазір ашық

source: Re-verify now:
kk_kz: Қазір қайта растау:

source: Pending:
kk_kz: Күту:

source: Denied:
kk_kz: Бас тартылды:

source: Approved:
kk_kz: Бекітілді:

source: ID-Verification Status
kk_kz: ID анықтаудың мәртебесі

source: Reviewed and Verified
kk_kz: Тексерілді және расталды

source: Your verification status is good for one year after submission.
kk_kz: Анықтау мәртебесі оны өткеннен кейін бір жыл жарамды

source: Your verification photos have been submitted and will be reviewed shortly.
kk_kz: Анықтау үшін фотографиялар жіберілді және жақында қарастырылатын болады.

source: Re-verify Yourself
kk_kz: Қайта анықтаудан өту

source: If you fail to pass a verification attempt before your course ends, you will not receive a verified certificate.
kk_kz: Егер сізге курс аяқталғанға дейін анықтауды өту мүмкін болмаса, сіз куаландырылған сертификатты алмайсыз.

source: Results:
kk_kz: Нәтижелер:

source: Sorry! We can't find anything matching your search. Please try another search.
kk_kz: Кешіріңіз! Біз сіз іздегенге ұқсас ештеңені таба алмадық. Басқа сұраныс енгізуді өтінеміз.

source: There are no posts here yet. Be the first one to post!
kk_kz: Мұнда хабарлар жоқ. Бірінші хабарды қалдыратын болыңыз!

source: New Post
kk_kz: Жаңа хабар

source: Show Discussion
kk_kz: Талқылауларды көрсету

source: To view live discussions, click Preview or View Live in Unit Settings.
kk_kz: Белсенді талқылауларды қарау үшін Алдын ала Қарауға немесе Блок Бапталымдарында Белсенділерді қарауға басыңыз.

source: Filter Topics
kk_kz: Тақырыптарды сүзу

source: filter topics
kk_kz: Тақырыптарды сүзу

source: Posts I'm Following
kk_kz: Мен бақылайтын хабарлар

source: Following
kk_kz: Бақылаймын

source: Search posts
kk_kz: Хабарды іздеу

source: Hide
kk_kz: Жасыру

source: Discussion topics; current selection is:
kk_kz: Талқылау тақырыбы; ағымдағы таңдау:

source: Add A Response
kk_kz: Жауап беру

source: This thread is closed.
kk_kz: Осы тақырып жабық.

source: Post a response:
kk_kz: Жауап жазу:

source: anonymous
kk_kz: аноним

source: &bull; This thread is closed.
kk_kz: Осы тақырып жабық.

source: follow
kk_kz: тақырыпты бақылау

source: Follow this post
kk_kz: Осы хабарды бақылау

source: Report Misuse
kk_kz: Дұрыс емес пайдалану туралы хабарлау

source: Pin Thread
kk_kz: Тақырыпты бекіту

source: Pinned
kk_kz: Бекітілді

source: (this post is about %(courseware_title_linked)s)
kk_kz: (тақырып %(courseware_title_linked)s байланысты)

source: Editing post
kk_kz: Хабарды редакциялау

source: Edit post title
kk_kz: Жазбаның тақырыбын редакциялау

source: Title
kk_kz: Атауы

source: Update post
kk_kz: Хабарды жаңарту

source: Add a comment
kk_kz: Түсініктемелерді қосу

source: Add a comment...
kk_kz: Түсініктемелерді қосу...

source: endorse
kk_kz: ұсыну

source: Editing response
kk_kz: Жауапты редакциялау

source: Update response
kk_kz: Жауапты жаңарту

source: Delete Comment
kk_kz: Түсініктемелерді жою

source: -posted %(time_ago)s by
kk_kz: -пайдаланушы %(time_ago)s қосты

source: Editing comment
kk_kz: Түсініктемелерді редакциялау

source: Update comment
kk_kz: Түсініктемелерді жаңарту

source: %(votes_up_count)s%(span_sr_open)s votes %(span_close)s
kk_kz: Дауыс %(votes_up_count)s%(span_sr_open)s %(span_close)s

source: %(comments_count)s %(span_sr_open)scomments (%(unread_comments_count)s unread comments)%(span_close)s
kk_kz: Түсініктемелердің %(comments_count)s %(span_sr_open)s оқылмаған түсініктемелердің (%(unread_comments_count)s %(span_close)s)

source: %(comments_count)s %(span_sr_open)scomments %(span_close)s
kk_kz: Түсініктемелердің %(comments_count)s %(span_sr_open)s %(span_close)s

source: DISCUSSION HOME:
kk_kz: ТАЛҚЫЛАУЛАР: БАСТЫ БЕТ

source: HOW TO USE EDX DISCUSSIONS
kk_kz: EDX ФОРУМЫН ПАЙДАЛАНУ ЕРЕЖЕСІ

source: Find discussions
kk_kz: Талқылау тақырыптарын табу

source: Focus in on specific topics
kk_kz: Тақырыптарды таңдау

source: Search for specific posts
kk_kz: Нақты хабарларды іздеу
