Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: What files are listed here?
kk_kz: Осында қандай файлдар аталған?

source: In addition to the files you upload on this page, any files that you add to the course appear in this list. These files include your course image, textbook chapters, and files that appear on your Course Handouts sidebar.
kk_kz: Сіз осы бетке жүктейтін файлдарға қосымша осы тізімде сіз оқу курсына қосатын файлдар да пайда болады. Осы файлдарға сондай-ақ сіздің оқу курсыңыздың айдарбелгісі, оқулықтың тараулары және оқу курсына арналған тарату материалдарының бүйір панелінде бейнеленетін файлдар жатады.

source: File URLs
kk_kz: Файлдардың URL

source: You use the Embed URL value to link to the file or image from a component, a course update, or a course handout.
kk_kz: Компоненттің, курс жаңартуының немесе тарату материалының файлына немесе суретіне сілтеме жасау үшін сіз кірістірілген URL файлды пайдаланасыз

source: You use the External URL value to reference the file or image from outside of your course. Do not use the External URL as a link value within your course.
kk_kz: Сіздің курстан тыс файлды немесе суретті көрсету үшін сыз сыртқы URL пайдаланасыз. Сыртқы URL сіздің курста сілтеме ретінде пайдаланбаңыз.

source: What can I do on this page?
kk_kz: Мен осы бетте қандай әрекет жасай аламын?

source: You can upload new files or view, download, or delete existing files. You can lock a file so that people who are not enrolled in your course cannot access that file.
kk_kz: Сіз жаңа файлдарды жүктей немесе бар файлдарды қарай, шығарып жүктей немесе жоя аласыз.

source: Choose File
kk_kz: Файлды таңдаңыз

source: Your file has been deleted.
kk_kz: Сіздің файл жойылған болатын.

source: close alert
kk_kz: хабарламаны жабу

source: Course Checklists
kk_kz: Курсты бақылау

source: Tools
kk_kz: Құралдары

source: Current Checklists
kk_kz: Ағымдағы курс

source: What are course checklists?
kk_kz: Оқу курсының бақылау нүктелері деген не?

source: Course checklists are tools to help you understand and keep track of all the steps necessary to get your course ready for students.
kk_kz: Оқу курсының бақылау нүктелері сіздің оқу курсыңызды оқушылардың игеруіне дайындау үшін қажетті барлық қадамдарды түсінуге және қадағалауға көмектесетін құрал-саймандар болып табылады.

source: Any changes you make to these checklists are saved automatically and are immediately visible to other course team members.
kk_kz: Сіз осы бақылау нүктелеріне енгізетін кез келген өзгерістер автоматты түрде сақталады және сол сәтте оқу курсы командасының басқа мүшелеріне көрінетін болады.

source: Duplicate
kk_kz: Көшірмесі

source: Duplicate this component
kk_kz: Осы компоненттің көшірмесін құру

source: Delete this component
kk_kz: Осы компонентті жою

source: Container
kk_kz: Контейнер

source: Publishing Status
kk_kz: Жариялым мәртебесі

source: Published
kk_kz: Жарияланды

source: To make changes to the content of this page, you need to edit unit {unit_link} as a draft.
kk_kz: Осы беттің мазмұнына өзгерістер енгізу үшін {unit_link} блогының шимайжазба нұсқасын редакциялау керек.

source: Draft
kk_kz: Шимайжазба

source: You can edit the content of this page, and your changes will be published with unit {unit_link}.
kk_kz: Сіз осы беттің мазмұнын редакциялай аласыз; Сіз енгізген өзгерістер {unit_link} блогында жарияланатын болады.

source: You can view and edit course components that contain other components on this page. In the case of experiment blocks, this allows you to confirm that you have properly configured your experiment groups and make changes to existing content.
kk_kz: Сіз басқа компоненттерден тұратын курсты осы бетте қарай және редакциялай аласыз. Тәжірибелік блоктар пайдаланылған жағдайда, бұл сіздің тәжірибелік топтарды дұрыс баптағаныңызға көз жеткізуге және қолданыстағы контентке өзгерістер енгізуге мүмкіндік береді.

source: Course Updates
kk_kz: Курс жаңалықтары

source: New Update
kk_kz: Жаңалықты құру

source: Use course updates to notify students of important dates or exams, highlight particular discussions in the forums, announce schedule changes, and respond to student questions. You add or edit updates in HTML.
kk_kz: Студенттерді маңызды күндер мен емтихандар туралы хабардар ету, форумдағы белгілі бір талқылауларға олардың назарын аудару, кестедегі өзгерістерді хабарлау және студенттердің сұрақтарына жауап беру үшін курс жаңалықтары бетін пайдаланыңыз. Сіз жаңалықтарды HTML қоса және редакциялай аласыз.

source: Pages
kk_kz: Беттер

source: New Page
kk_kz: Жаңа бет

source: View Live
kk_kz: Ағымдағы нұсқаны қарау

source: Note: Pages are publicly visible. If users know the URL of a page, they can view the page even if they are not registered for or logged in to your course.
kk_kz: Назар аударыңыз: Беттер көпшілікке көрінімді. Егер пайдаланушылар беттің URL білетін болса, олар сіздің курста тіркелмеген және логиндалмаған болса да оны қарай алады.

source: Show this page
kk_kz: Осы бетті көрсету

source: Show/hide page
kk_kz: Бетті көрсету/жасыру

source: This page cannot be reordered
kk_kz: Осы бет қайта тағайындала алмайды

source: You can add additional custom pages to your course.
kk_kz: Сіз өзіңіздің курсқа қосымша меншікті беттерді қоса аласыз

source: Add a New Page
kk_kz: Жаңа бетті қосу

source: What are pages?
kk_kz: Қандай беттер?

source: Pages are listed horizontally at the top of your course. Default pages (Courseware, Course info, Discussion, Wiki, and Progress) are followed by textbooks and custom pages that you create.
kk_kz: Беттер сіздің курстың жоғарғы жағында көлденеңінен атап көрсетілген. Ұйғарым бойынша беттер (Курс материалдары, Ақпарат, Пікірсайыстар, Викилер және Алға басулар) сіз құрған оқулықтармен және беттермен жалғасады.

source: Custom pages
kk_kz: Меншікті беттер

source: You can create and edit custom pages to provide students with additional course content. For example, you can create pages for the grading policy, course slides, and a course calendar.
kk_kz: Студенттерге курстың қосымша мазмұнын ұсыну үшін сіз меншікті беттерді құра және редакциялай аласыз. Мысалы, сіз бағалар саясаты туралы беттерді, слайдттарды және курс күнтізбесін құра аласыз.

source: How do pages look to students in my course?
kk_kz: Менің курсымның студенттеріне арналған беттердің түрі қандай?

source: Students see the default and custom pages at the top of your course and use these links to navigate.
kk_kz: Студенттер ұйғарым бойынша парақтарды және сіз құрған парақтарды сіздің курсыңыздың жоғарғы жағында көреді және олармен навигациялауға арналған сілтемелерді пайдаланады.

source: See an example
kk_kz: Мысалды қарау

source: Pages in Your Course
kk_kz: Сіздің курстағы беттер

source: Preview of Pages in your course
kk_kz: Сіздің курс беттеріңіздің превьюі

source: Pages appear in your course's top navigation bar. The default pages (Courseware, Course Info, Discussion, Wiki, and Progress) are followed by textbooks and custom pages.
kk_kz: Беттер курстың жоғарғы навигациялық панелінде пайда болады. Ұйғарым бойынша беттер (Курс материалдары, Ақпарат, Пікірсайыстар, Викилер және Алға басулар) сіз құрған оқулықтармен және беттермен жалғасады.

source: close modal
kk_kz: нысанды жабу

source: CMS Subsection
kk_kz: CMS

source: Display Name:
kk_kz: Бейнеленетін аты:

source: Units:
kk_kz: Сағаттар саны:

source: Subsection Settings
kk_kz: Баптаулар:

source: Release Day
kk_kz: Басталу күні

source: Release Time
kk_kz: Басталу уақыты

source: Coordinated Universal Time
kk_kz: Гринвич бойынша уақыты

source: The date above differs from the release date of {name}, which is unset.
kk_kz: Жоғарыда көрсетілген күн сақталмайтын{name} аяқталу күнінен ерекшеленеді.

source: The date above differs from the release date of {name} - {start_time}
kk_kz: Жоғарыда көрсетілген күн басталу күнінен ерекшеленеді {name} - {start_time}

source: Sync to {name}.
kk_kz: {name}-мен синхрондау

source: Graded as:
kk_kz: Былайша бағаланады:

source: Set a due date
kk_kz: Мерзімді белгілеу

source: Due Day
kk_kz: Мерзім күні

source: Due Time
kk_kz: Мерзім уақыты

source: Remove due date
kk_kz: Мерзімді жою

source: Preview Drafts
kk_kz: Жобаны алдын ала қарау

source: Internal Server Error
kk_kz: Сервердің ішкі қатесі

source: The Page You Requested Page Cannot be Found
kk_kz: Сіз сұрау салған бет табылмайды

source: We're sorry. We couldn't find the Studio page you're looking for. You may want to return to the Studio Dashboard and try again. If you are still having problems accessing things, please feel free to {link_start}contact Studio support{link_end} for further help.
kk_kz: Кешірім сұраймыз. Сіз сұрау салған бетті таба алмадық. Сіз бас бетке оралып әрекетті қайталай аласыз. Егер проблема туындай берсе бұдан әрі көмек алу үшін{link_start}қолдау орталығына{link_end}жүгініңіз.

source: Use our feedback tool, Tender, to share your feedback
kk_kz: Кері байланыс үшін біздің Tender құрал-сайманымызды пайдаланыңыз.

source: The Server Encountered an Error
kk_kz: Сервер қатесі

source: We're sorry. There was a problem with the server while trying to process your last request. You may want to return to the Studio Dashboard or try this request again. If you are still having problems accessing things, please feel free to {link_start}contact Studio support{link_end} for further help.
kk_kz: Кешірім сұраймыз. Сіздің сауалды өңдеуге әрекет жасаған кезде серверде қате пайда болды. Сіз бас бетке оралып әрекетті қайталай аласыз. Егер қате қайланса, бұдан әрі көмек алу үшін{link_start}қолдау орталығына{link_end}жазыңыз.

source: Back to dashboard
kk_kz: Панельге оралу

source: Course Export
kk_kz: Курсты экспорттау

source: About Exporting Courses
kk_kz: Курс экспорты туралы

source: You can export courses and edit them outside of Studio. The exported file is a .tar.gz file (that is, a .tar file compressed with GNU Zip) that contains the course structure and content. You can also re-import courses that you've exported.
kk_kz: Сіз курстарды Studio жүйесінен тыс экспорттай және редакциялай аласыз. Экспортталатын файл мынадай форматқа .tar.gz (бұл GNU Zip көмегімен сығымдалған .tar файл) ие және оқу курсының құрылымы мен материалдарын қамтиды. Сіз сондай-ақ бұрын экспортталған оқу курсын қайта импорттай аласыз.

source: Export My Course Content
kk_kz: Менің оқу курсымның мазмұнын экспорттау

source: Export Course Content
kk_kz: Оқу курсының мазмұнын экспорттау

source: Data {em_start}exported with{em_end} your course:
kk_kz: {em_start} деректері{em_end} бірге Сіздің оқу курсыңызбен экспортталған:

source: Course Content (all Sections, Sub-sections, and Units)
kk_kz: Курстың Мазмұны (барлық Бөлімдер, Кіші бөлімдер және Тақырыптар)

source: Course Structure
kk_kz: Курстың құрылымы

source: Individual Problems
kk_kz: Жекелеген міндеттер

source: Course Assets
kk_kz: Курс активі

source: Course Settings
kk_kz: Курстың баптаулары

source: Data {em_start}not exported{em_end} with your course:
kk_kz: {em_start} деректері{em_end} бірге Сіздің оқу курсыңызбен экспортталмаған:

source: User Data
kk_kz: Пайдаланушының деректері

source: Course Team Data
kk_kz: Курс Қызметкерлерінің деректері

source: Forum/discussion Data
kk_kz: Форум/талқылау деректері

source: Certificates
kk_kz: Сертификаттар

source: Why export a course?
kk_kz: Оқу курсын не үшін экспорттау керек?

source: You may want to edit the XML in your course directly, outside of Studio. You may want to create a backup copy of your course. Or, you may want to create a copy of your course that you can later import into another course instance and customize.
kk_kz: Мүмкін сіз өзіңіздің курсыңыздың тікелей XML Студиядан тыс редакциялағыңыз келетін шығар. Немесе сіз өзіңіздің курстың бекап-көшірмесін жасаңығыз келетін шығар. Сондай-ақ мүмкін сіз кейіннен оны басқа курсқа импорттау және онымен жұмыс жасау үшін өзіңіздің курстың көшірмесін жасағыңыз келетін шығар.

source: What content is exported?
kk_kz: Қандай мазмұн экспортталуда?

source: Only the course content and structure (including sections, subsections, and units) are exported. Other data, including student data, grading information, discussion forum data, course settings, and course team information, is not exported.
kk_kz: Курстың мазмұны мен құрылымы (бөлімдерді, кіші бөлімдерді және тақырыптарды қоса алғанда) ғана экспортталады. Студенттер туралы деректерді, бағалар туралы ақпаратты, форумдық талқылаулардың деректерін, курс баптауларын және курс командасы туралы ақпаратты қоса алғандағы басқа ақпарат экспортталмайды.

source: Opening the downloaded file
kk_kz: Көшіріп жүктелген файл ашылады

source: Use an archive program to extract the data from the .tar.gz file. Extracted data includes the course.xml file, as well as subfolders that contain course content.
kk_kz: Кеңейтуі .tar.gz file. файлдан ақпарат алу үшін мұрағаттандырғыш бағдарламаны пайдаланыңыз. Алынған ақпарат курс мазмұны бар кіші папкалар сияқты course.xml қамтиды.

source: Export Course to Git
kk_kz: Курсты Git экспорттау

source: Export to Git
kk_kz: Git экспорттау

source: About Export to Git
kk_kz: Git экспорттау туралы

source: Use this to export your course to its git repository.
kk_kz: Сіздің курсты оның git репозиторийіне экспорттау үшін осыны пайдаланыңыз

source: This will then trigger an automatic update of the main LMS site and update the contents of your course visible there to students if automatic git imports are configured.
kk_kz: Егер git импорттаудың автоматты баптаулары кескінделген болса, бұл бас LMS сайтының жаңартуын автоматты түрде қосуға және сіздің курстың студенттерге көрінетін мазмұнын жаңартуға мүмкіндік береді

source: Export Course to Git:
kk_kz: Курсты Git экспорттау

source: giturl must be defined in your course settings before you can export to git.
kk_kz: сіз git экспорттағанға дейін giturl сіздің курстың баптауларында анықталған болуы тиіс

source: Export Failed
kk_kz: Экспорттау сәтсіздігі

source: Export Succeeded
kk_kz: Экспорт ойдағыдай аяқталды

source: Your course:
kk_kz: Сіздің курсыңыз:

source: Course git url:
kk_kz: Курстың Git url:

source: Welcome
kk_kz: Хош келдіңіз

source: Welcome to
kk_kz: хош келдіңіз

source: Studio's Many Features
kk_kz: Studio мүмкіндіктерінің алуан түрлілігі

source: Studio Helps You Keep Your Courses Organized
kk_kz: Studio курстар ұйымдастыруда көмектеседі

source: Keeping Your Course Organized
kk_kz: Сіздің курстарды ұйымдастыру

source: The backbone of your course is how it is organized. Studio offers an <strong>Outline</strong> editor, providing a simple hierarchy and easy drag and drop to help you and your students stay organized.
kk_kz: Сіздің курстағы ең бастысы – оның қалай ұйымдастырылғаны. Studio элементтердің орнын ауыстыруға мүмкіндік беретін қарапайым иерархиясы және ыңғайлы интерфейсі бар <strong> құрылымының</strong>редакторын ұсынады. Бұл сіздің және сіздің студенттеріңіздің өмірін жеңілдетеді.

source: Simple Organization For Content
kk_kz: Материалдардың қарапайым ұйымдастырылуы

source: Studio uses a simple hierarchy of <strong>sections</strong> and <strong>subsections</strong> to organize your content.
kk_kz: Studio курс материалдарын ұйымдастыру үшін <strong>бөлімдерінің</strong> және<strong>кіші бөлімдерінің</strong> қарапайым иерархиясын пайдаланады.

source: Change Your Mind Anytime
kk_kz: Кез келген сәтте ойдан қайтыңыз

source: Go A Week Or A Semester At A Time
kk_kz: Жұмысты апта бойынша немесе жекелеген семестрлер бойынша бөліңіз

source: Build and release <strong>sections</strong> to your students incrementally. You don't have to have it all done at once.
kk_kz: Сіздің студенттер үшін<strong>жекелеген бөлімдер</strong>құрыңыз және ақырын-ақырын жариялаңыз. Барлығын бірден жасамауға болады.

source: Learning is More than Just Lectures
kk_kz: Оқыту процесі тек дәрістерден тұрмайды

source: Create Learning Pathways
kk_kz: Бағытталған оқытуды құру

source: Work Visually, Organize Quickly
kk_kz: Көрнекі жұмысты жылдам ұйымдастыру

source: Work visually and see exactly what your students will see. Reorganize all your content with drag and drop.
kk_kz: Көрнекі құралдармен жұмыс істей отырып сіз сіздің студенттердің көргенін көретін боласыз. Барлық материалдардың орнын ауыстыруға болады.

source: A Broad Library of Problem Types
kk_kz: Міндеттер түрлерінің кең таңдауы

source: Studio Gives You Simple, Fast, and Incremental Publishing. With Friends.
kk_kz: Studio көмегімен сіз өз материалдарыңызды қарапайым, тез және ақырын-ақырын жариялай аласыз. Жолдастарыңызбен.

source: Simple, Fast, and Incremental Publishing. With Friends.
kk_kz: Өз материалдарыңызды қарапайым, тез және ақырын-ақырын жариялаңыз. Жолдастарыңызбен.

source: Studio works like web applications you already know, yet understands how you build curriculum. Instant publishing to the web when you want it, incremental release when it makes sense. And with co-authors, you can have a whole team building a course, together.
kk_kz: Studio сізге белгілі веб-қосымшалар сияқты жұмыс істейді, бірақ сіздің оқу жоспарын қалай құратыныңызды түсінеді. Материалдарды желіде кез келген өзіңізге ыңғайлы сәтте орналастырыңыз, оларды оқу жоспары осыны талап еткен кезде жариялауға болады. Бірлескен авторлардың қолдауы арқасында сіз бір команданың курсымен жұмыс істей аласыз.

source: Instant Changes
kk_kz: Шұғыл өзгерістер

source: Release-On Date Publishing
kk_kz: Басталу және жариялау күні

source: When you've finished a <strong>section</strong>, pick when you want it to go live and Studio takes care of the rest. Build your course incrementally.
kk_kz: Сіз <strong>бөлім</strong>аяқтаған кезде сіз оны қашан қосқығыз келетіндігіңізді таңдаңыз, ал Studio басқаның қамын ойлайды. Өз курсыңызды ақырын-ақырын құрыңыз

source: Work in Teams
kk_kz: Командада жұмыс істеу

source: Co-authors have full access to all the same authoring tools. Make your course better through a team effort.
kk_kz: Бірлескен авторлар әзірлеудің барлық құрал-саймандарына толық қол жеткізе алады. Ұжымдық күш-жігер арқасында өзңіздің курсты жақсырақ етіңіз.

source: Sign Up for Studio Today!
kk_kz: Studio бүгіннің өзінде тіркелу!

source: Sign Up &amp; Start Making an edX Course
kk_kz: edX тіркелу және курсты құру

source: Already have a Studio Account? Sign In
kk_kz: Studio аккаунт бар ма? Кіріңіз

source: Outlining Your Course
kk_kz: Сіздің курстың құрылымы

source: Simple two-level outline to organize your couse. Drag and drop, and see your course at a glance.
kk_kz: Сіздің курсты ұйымдастыруға арналған екі деңгейлі қарапайым жоспар. Өзіңіздің курсты бір қарағаннан көру үшін орнын ауыстырыңыз.

source: More than Just Lectures
kk_kz: Жәй дәрістерден артық

source: Quickly create videos, text snippets, inline discussions, and a variety of problem types.
kk_kz: Бейнені, мәтіндердің үзінділерін, кіріктірілген форумды және міндеттердің әртүрлі үлгілерін тез құру

source: Publishing on Date
kk_kz: Жариялау күні

source: Simply set the date of a section or subsection, and Studio will publish it to your students for you.
kk_kz: Бөлімде немесе кіші бөлімде жәй ғана күнді орнатыңыз және Studio оны студенттер үшін жариялайды.

source: We're having trouble rendering your component
kk_kz: Сіздің компонентті бейнелеу кезінде проблемалар бар

source: Students will not be able to access this component. Re-edit your component to fix the error.
kk_kz: Компонент студенттер үшін қол жетімді емес. Қатені жөндеу үшін компонентті қайта редакциялаңыз.

source: Course Import
kk_kz: Курс импорты

source: Be sure you want to import a course before continuing. Content of the imported course replaces all the content of this course. {em_start}You cannot undo a course import{em_end}. We recommend that you first export the current course, so you have a backup copy of it.
kk_kz: Жалғастырмастан бұрын сіз курсты импорттағыңыз келетіндігіне көз жеткізіңіз. Импортталған курстың мазмұны курстың барлық мазмұнын ауыстырады. {em_start}Сіз курстың импортын жылжыта алмайсыз{em_end}. Біз сізге ең алдымен ағымдағы курсты импорттауды және оның бэкап-көшірмесін сақтауды ұсынамыз.

source: The course that you import must be in a .tar.gz file (that is, a .tar file compressed with GNU Zip). This .tar.gz file must contain a course.xml file. It may also contain other files.
kk_kz: Сіз импорттайтын курстың форматы .tar.gz болуы тиіс (бұл GNU Zip көмегімен сығымдалған, кеңейтуі .tar файл). Осы .tar.gz файлы course.xml. файлын қамтуы тиіс. Ол сондай-ақ басқа да файлдарды қамтуы мүмкін.

source: The import process has five stages. During the first two stages, you must stay on this page. You can leave this page after the Unpacking stage has completed. We recommend, however, that you don't make important changes to your course until the import operation has completed.
kk_kz: Импорт процесі сатыдан тұрады. Бірінші екі саты барысында сіз бетте қалуыңыз керек. Сіз Орамды ашу сатысы аяқталғаннан кейін беттен кете аласыз. Біз сізге импорт аяқталғанға дейін сіздің курста маңызды өзгерістер жасамауды ұсынамыз.

source: Select a .tar.gz File to Replace Your Course Content
kk_kz: Сіздің курстың мазмұнын өзгерту үшін .tar.gz файлын таңдаңыз

source: Choose a File to Import
kk_kz: Импорттауға арналған файлды таңдаңыз

source: File Chosen:
kk_kz: Таңдалған файл:

source: Replace my course with the one above
kk_kz: Менің курсымды жоғарыда курспен ауыстыру

source: Course Import Status
kk_kz: Курс импортының мәртебесі

source: Uploading
kk_kz: Жүктеу

source: Transferring your file to our servers
kk_kz: Сіздің файлды біздің серверлерге беру

source: Unpacking
kk_kz: Орамды ашу

source: Expanding and preparing folder/file structure (You can now leave this page safely, but avoid making drastic changes to content until this import is complete)
kk_kz: Папканың/файлдың құрылымын кеңейту және дайындау (енді Сіз бетті қауіпсіз тастап кете аласыз, бірақ импорт аяқталғанға дейін контентте түбегейлі өзгерістер жасамауға тырысыңыз)

source: Verifying
kk_kz: Растау

source: Reviewing semantics, syntax, and required data
kk_kz: Семантиканы, синтаксисті және қажетті деректерді тексеру

source: Updating Course
kk_kz: Курсты жаңарту

source: Integrating your imported content into this course. This may take a while with larger courses.
kk_kz: Сіз импорттаған контентті осы курсқа интеграциялау. Бұл үлкен курстармен көп уақытты алуы мүмкін.

source: Success
kk_kz: Табыс

source: Your imported content has now been integrated into this course
kk_kz: Сіз жүктеген контент енді осы курсқа интеграцияланды

source: View Updated Outline
kk_kz: жаңартылған түрді көрсету

source: Why import a course?
kk_kz: Сіз курсты неге импорттайсыз?

source: You may want to run a new version of an existing course, or replace an existing course altogether. Or, you may have developed a course outside Studio.
kk_kz: Мүмкін Сіз қолданыстағы курстың жаңа нұсқасын іске қосқыңыз немесе қолданыстағы курсты ауыстырңығыз келетін болар. Немесе сіз Студиядан тыс жаңа курс әзірлеген боларсыз.

source: What content is imported?
kk_kz: Қандай мазмұн импортталуда?

source: Only the course content and structure (including sections, subsections, and units) are imported. Other data, including student data, grading information, discussion forum data, course settings, and course team information, remains the same as it was in the existing course.
kk_kz: Курстың мазмұны мен оның құрылымы ғана (бөлімдерді, кіші бөлімдерді және тақырыптарды қоса алғанда) импортталуда. Студенттер туралы, бағалар, пікірсайыстар, курстың баптаулары туралы ақпаратты, курс командасы туралы ақпаратты қоса алғандағы басқа ақпарат қолданыстағы курстағыдай болып қалады.

source: Warning: Importing while a course is running
kk_kz: Назар аударыңыз: курс қолданыста болған уақытта импорттау
