Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/django.po
Languages: kk_kz

source: The amount charged by the processor {0} {1} is different than the total cost of the order {2} {3}.
kk_kz: Төлем сервисі сұрау салған сома {0} {1} тапсырыстың қорытынды құнынан {2} {3} айрықшаланады.

source: <p class="error_msg"> Sorry! Our payment processor did not accept your payment. The decision they returned was <span class="decision">{decision}</span>, and the reason was <span class="reason">{reason_code}:{reason_msg}</span>. You were not charged. Please try a different form of payment. Contact us with payment-related questions at {email}. </p>
kk_kz: <p class="error_msg"> Өкінішке орай біздің төлемдер жүйесі Сіздің төлемді қабылдамады. Алынған жауап: <span class="decision">{decision}</span>, мынадай себеп бойынша <span class="reason">{reason_code}:{reason_msg}</span>. Ақшалай қаражат Сіздің шоттан алынған болатын. Басқа төлем жүйесін пайдаланып көріңіз. Төлем жасау мәселелері бойынша бізге {email}. мекенжайы бойынша хабарласыңыз </p>

source: <p class="error_msg"> Sorry! Our payment processor sent us back a payment confirmation that had inconsistent data! We apologize that we cannot verify whether the charge went through and take further action on your order. The specific error message is: <span class="exception_msg">{msg}</span>. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}. </p>
kk_kz: <p class="error_msg"> Өкінішке орай біздің төлемдер жүйесі бізге деректері сәйкес келмейтін төлемнің растауын жіберді! Кешірім сұраймыз: біз төлемнің өткендігін тексере алмаймыз және Сіздің тапсырысыңызбен байланысты бұдан әрі әрекеттерді қабылдай алмаймыз. Қате туралы хабардың мазмұны: <span class="exception_msg">{msg}</span>. Мүмкін ақшалай қаражат Сіздің кредиттік картаңыздан алынған болар. Төлем жасау мәселелері бойынша бізге {email}. мекенжайы бойынша хабарласыңыз </p>

source: <p class="error_msg"> Sorry! Due to an error your purchase was charged for a different amount than the order total! The specific error message is: <span class="exception_msg">{msg}</span>. Your credit card has probably been charged. Contact us with payment-specific questions at {email}. </p>
kk_kz: <p class="error_msg"> Өкінішке орай қате орын алды және Сіздің сатып алуыңыз үшін алынған сома Сіздің тапсырысыңыздың жиынтық сомасымен сәйкес келмейді! Қате туралы хабардың мазмұны: <span class="exception_msg">{msg}</span>. Мүмкін ақшалай қаражат Сіздің кредиттік картаңыздан алынған болар. Төлем жасау мәселелері бойынша бізге {email}. мекенжайы бойынша хабарласыңыз </p>

source: <p class="error_msg"> Sorry! Our payment processor sent us back a corrupted message regarding your charge, so we are unable to validate that the message actually came from the payment processor. The specific error message is: <span class="exception_msg">{msg}</span>. We apologize that we cannot verify whether the charge went through and take further action on your order. Your credit card may possibly have been charged. Contact us with payment-specific questions at {email}. </p>
kk_kz: <p class="error_msg"> Өкінішке орай біз төлемдер жүйесінен Сіздің төлем туралы бұрмаланған хабар алдық, сондықтанхабарды төлемдер жүйесі жөнелтпегендігіне көз жеткізе алмаймыз. Қате туралы хабардың мазмұны: <span class="exception_msg">{msg}</span>. Кешірім сұраймыз, себебі біз төлемнің өткендігін тексере алмаймыз және Сіздің тапсырысыңызбен байланысты бұдан әрі әрекеттерді қабылдай алмаймыз. Мүмкін ақшалай қаражат Сіздің кредиттік картаңыздан алынған болар. Төлем жасау мәселелері бойынша бізге {email}. мекенжайы бойынша хабарласыңыз </p>

source: Successful transaction.
kk_kz: Транзакция ойдағыдай

source: The request is missing one or more required fields.
kk_kz: Сауалда кемінде бір міндетті алап толтырылмаған.

source: One or more fields in the request contains invalid data.
kk_kz: Алаптардың кемінде бірі қате деректерді қамтиды.

source: The merchantReferenceCode sent with this authorization request matches the merchantReferenceCode of another authorization request that you sent in the last 15 minutes. Possible fix: retry the payment after 15 minutes.
kk_kz: осы сауалмен жіберілген merchantReferenceCode сіз соңғы 15 минут барысында жіберген авторландырудың басқа сауалының merchantReferenceCode сәйкес келеді. Мүмкін болатын шешім: төлемді 15 минуттан кейін қайталаңыз.

source: Error: General system failure. Possible fix: retry the payment after a few minutes.
kk_kz: Қате: жүйенің жалпы іркілісі. Мүмкін болатын шешім: бірнеше минуттар кейін төлемді тағы өткізіп көріңіз.

source: Error: The request was received but there was a server timeout. This error does not include timeouts between the client and the server. Possible fix: retry the payment after some time.
kk_kz: Қате: Төлем қабылданды, бірақ сервердің күту уақыты асып кетті. бұл қате клиент пен сервер арасындағы күту уақытын ескермейді. Мүмкін болатын жою әдісі: төлемді біраз уақыттан кейін өткізіп көріңізя.

source: Error: The request was received, but a service did not finish running in time Possible fix: retry the payment after some time.
kk_kz: Қате: сауал алынған болатын, бірақ сервер оны уақтылы өңдеп үлгірмеді\n Мүмкін болатын шешім: біраз уақыттан кейін төлемді қайталаңыз.

source: The issuing bank has questions about the request. Possible fix: retry with another form of payment
kk_kz: Эмитент банктің сауалға сұрақтары туындады. Мүмкін болатын шешім: басқа тәсілмен төлеуге әрекет етіңіз.

source: Expired card. You might also receive this if the expiration date you provided does not match the date the issuing bank has on file. Possible fix: retry with another form of payment
kk_kz: Карточканың қолданылу мерзімі аяқталды. Осы хабар Сіз енгізген қолдану мерзімі және банктің деректер қорындағы мерзім сәйкес келмеген жағдайда пайда болуы мүмкін. Мүмкін болатын жою әдісі: басқа тәсілмен төлеуге әрекет етіңіз

source: General decline of the card. No other information provided by the issuing bank. Possible fix: retry with another form of payment
kk_kz: Картаның жалпы бас тартуы. Банк басқа ақпарат ұсынбады. Мүмкін болатын шешім: төлемнің басқа түрін пайдаланып көріңіз

source: Insufficient funds in the account. Possible fix: retry with another form of payment
kk_kz: Шоттағы қаражат жеткіліксіз. Мүмкін болатын шешім: басқа тәсілмен төлеуге әрекет етіңіз.

source: Unknown reason
kk_kz: Белгісіз себеп

source: Issuing bank unavailable. Possible fix: retry again after a few minutes
kk_kz: Эмитент банк қол жетімді емес. Мүмкін болатын шешім: тағы бірнеше минуттан кейін әрекет етіп көріңіз

source: Inactive card or card not authorized for card-not-present transactions. Possible fix: retry with another form of payment
kk_kz: Карта белсенді емес немесе карта онлайн төлемдерге арналмаған. Мүмкін болатын шешім: төлемнің басқа түрін пайдаланып көріңіз

source: The card has reached the credit limit. Possible fix: retry with another form of payment
kk_kz: Карта кредиттік лимитке жетті. Мүмкін болатын шешім: төлемнің басқа тәсілін пайдаланып көріңіз.

source: Invalid card verification number. Possible fix: retry with another form of payment
kk_kz: Қате CVC/CVV коды. Мүмкін болатын шешім: төлемнің басқа тәсілін пайдаланып көріңіз.

source: Invalid account number. Possible fix: retry with another form of payment
kk_kz: Қате шот нөмірі. Мүмкін болатын шешім: төлемнің басқа тәсілін пайдаланып көріңіз

source: The card type is not accepted by the payment processor. Possible fix: retry with another form of payment
kk_kz: Төлем картасының осы түрін төлемдер жүйесі қабылдамайды. Мүмкін болатын шешім: төлемнің басқа нысанын пайдаланып көріңіз

source: General decline by the processor. Possible fix: retry with another form of payment
kk_kz: Сервистің жалпы бас тартуы. Мүмкін болатын шешім: төлемнің басқа тәсілін пайдаланып көріңіз

source: There is a problem with our CyberSource merchant configuration. Please let us know at {0}
kk_kz: Біздің CyberSource жүйесімен проблема. Бізге{0}хабарлаңыз

source: The requested amount exceeds the originally authorized amount.
kk_kz: Сұрау салынған сома бұрын авторланғаннан артық.

source: Processor Failure. Possible fix: retry the payment
kk_kz: Сервистің қатесі. Мүмкін болатын шешім: тағы бір рет әрекет етіп көріңіз

source: The authorization has already been captured
kk_kz: Авторланған сома қабылданып қойған

source: The requested transaction amount must match the previous transaction amount.
kk_kz: Транзакцияның сұрау салынған сомасы транзакцияның өткен сомасымен сәйкес келуі тиіс.

source: The card type sent is invalid or does not correlate with the credit card number. Possible fix: retry with the same card or another form of payment
kk_kz: Картаның үлгісі қате немесе картаның нөміріне сәйкес келмейді. Мүмкін болатын шешім: осы картамен немесе төлемнің басқа түрімен тағы да әрекет етіп көріңіз

source: The request ID is invalid.
kk_kz: Сауалдың жарамсыз ID

source: You requested a capture through the API, but there is no corresponding, unused authorization record.
kk_kz: Сіз API арқылы қаражатты алуға сауал бердіңіз, бірақ байланыс жоқ, пайдаланылмайтын авторланған жазба.

source: The transaction has already been settled or reversed.
kk_kz: Транзакция жүргізілді немесе айналымға салынды.

source: The capture or credit is not voidable because the capture or credit information has already been submitted to your processor. Or, you requested a void for a type of transaction that cannot be voided.
kk_kz: кредиттің заңдық күші жоқ, себебі кредиттік ақпарат ұсынылып қойған сіздің процессингтік орталығыңызға.

source: You requested a credit for a capture that was previously voided
kk_kz: Сіз бұдан бұрын жойылған жазба үшін қатысушылар тізіміне сұрау салдыңыз

source: Error: The request was received, but there was a timeout at the payment processor. Possible fix: retry the payment.
kk_kz: Қате: Сауал алынды, бірақ төлем процессоры белгіленген уақытта төлем жүргізіп үлгірмеді. Мүмкін болатын шешім: төлемді қайталаңыз.

source: The authorization request was approved by the issuing bank but declined by CyberSource.' Possible fix: retry with a different form of payment.
kk_kz: Авторландыруға арналған сауалды банк мақұлдады, бірақ CyberSource жүйе бас тартты.' Мүмкін болатын шешім: төлемнің басқа нысанын пайдаланып көріңіз.

source: No photo ID was provided.
kk_kz: Құжаттың фотосуреті жоқ

source: We couldn't read your name from your photo ID image.
kk_kz: Біз құжаттың фотосуретіндегі Сіздің атыңызды оқи алмадық

source: The name associated with your account and the name on your ID do not match.
kk_kz: Сіздің аккаунтта көрсетілген ат Сіздің құжаттағы атпен сәйкес келмейді

source: The image of your face was not clear.
kk_kz: Сіздің бетіңіздің бейнесі жеткілікті түрде анық емес

source: Your face was not visible in your self-photo
kk_kz: Фотосуретте Сіздің бетіңіз көрінбеді

source: There was an error verifying your ID photos.
kk_kz: Сіздің құжаттың фотосуретін тексерген кезде қате орын алды

source: Selected price is not valid number.
kk_kz: Таңдалған баға дұрыс сан болып табылмайды.

source: This course doesn't support verified certificates
kk_kz: Осы курс расталған сертификаттарды қолдамайды

source: No selected price or selected price is below minimum.
kk_kz: Баға таңдалмаған немесе таңдалған баға ең аз рұқсат етілгеннен төмен.

source: Your Password Reset is Complete
kk_kz: Сіздің пароліңіз өзгертілген болатын

source: Your password has been set. You may go ahead and %(link_start)slog in%(link_end)s now.
kk_kz: Сіздің пароль сақталды. Енді сіз %(link_start)s мына сайтқа%(link_end)s кіре аласыз.

source: Reset Your %(platform_name)s Password
kk_kz: Сіздің %(platform_name)s арналған пароліңізді шығарып тастау

source: Reset Your %(platform_name)s Password
kk_kz: Сіздің %(platform_name)s арналған пароліңізді шығарып тастау

source: Password Reset Form
kk_kz: Парольді ауыстыру нысаны

source: We're sorry, %(platform_name)s enrollment is not available in your region
kk_kz: Кешіріңіз, бірақ %(platform_name)s қатысуға сіздің өңірде жол берілмейді

source: The following errors occurred while processing your registration:
kk_kz: Сіздің тіркеуге арналған өтініміңізді өңдеу уақытында мынадай қателіктер туындады:

source: You must complete all fields.
kk_kz: Сіз барлық алаптарды толтыруыңыз керек.

source: The two password fields didn't match.
kk_kz: Енгізілген парольдер сәйкес келмейді.

source: We're sorry, our systems seem to be having trouble processing your password reset
kk_kz: Өкінішке орай біздің жүйеде сіздің парольді ауыстырумен байланысты қиындықтар туындады

source: Someone has been made aware of this issue. Please try again shortly. Please %(start_link)scontact us%(end_link)s about any concerns you have.
kk_kz: Осы проблема туралы әкімшіліктен біреуге хабарланды. Бірнеше минуттан кейін тағы әрекет етіп көріңіз. %(start_link)sБізбен хабарласыңыз%(end_link)s, егер сізде қандай да сұрақтар немесе қиындықтар туындаса.

source: Please enter your new password twice so we can verify you typed it in correctly. <br /> Required fields are noted by <strong class="indicator">bold text and an asterisk (*)</strong>.
kk_kz: Қате басуларды болдырмау үшін өзіңіздің жаңа пароліңізді екі рет енгізіңіз. <br /> Толтыру үшін міндетті алаптар белгіленген <strong class="indicator">жалпақ қара мәтінмен және жұлдызшамен (*)</strong>.

source: Required Information
kk_kz: Қажетті ақпарат

source: Your New Password
kk_kz: Сіздің жаңа пароліңіз

source: Your New Password Again
kk_kz: Сіздің жаңа пароліңіз, тағы бір рет

source: Change My Password
kk_kz: Менің паролімді ауыстыру

source: Your Password Reset Was Unsuccessful
kk_kz: Сіздің парольді ауыстыру мүмкін болмады

source: The password reset link was invalid, possibly because the link has already been used. Please return to the %(start_link)slogin page%(end_link)s and start the password reset process again.
kk_kz: Парольді шығарып тастау сілтемесі жарамсыз. Ол бойынша бұрын өтуі әбден мүмкін. %(start_link)sкіру бетіне қайта оралыңыз%(end_link)s және парольді шығарып тастау процесін жаңадан бастаңыз.

source: Password Reset Help
kk_kz: Парольді ауыстырудағы көмек

source: Need Help?
kk_kz: Көмек керек пе?

source: View our %(start_link)shelp section for contact information and answers to commonly asked questions%(end_link)s
kk_kz: Біздің %(start_link)sкөмек бөлімінде%(end_link)s байланыс жасау деректерін және жиі қойылатын сұрақтарға жауаптарды табуға болады

source: You're receiving this e-mail because you requested a password reset for your user account at edx.org.
kk_kz: Сіз аккаунтыңыздағы парольді edx.org шығарып тастағандықтан осы хатты алдыңыз.

source: Please go to the following page and choose a new password:
kk_kz: Келесі бетке өтіңіз және жаңа парольді таңдаңыз:

source: If you didn't request this change, you can disregard this email - we have not yet reset your password.
kk_kz: Егер Сіз парольді ауыстыруға өтінім бермеген болсаңыз, Сіз осы хабарға назар аудармасаңыз болады – Сіздің пароль әлі өзгертілген жоқ.

source: Thanks for using our site!
kk_kz: Біздің сайтты пайдаланғаныңыз үшін рахмет!

source: The edX Team
kk_kz: edX командасы

source: Last modified:
kk_kz: Соңғы өзгерістер:

source: See all children
kk_kz: Барлық ұрпақтарын қарау

source: This article was last modified:
kk_kz: Осы бап соңғы рет редакцияланды:

source: Add new article
kk_kz: Жаңа бапты қосу

source: Create article
kk_kz: Бапты құру

source: Go back
kk_kz: Кері қарай

source: Delete article
kk_kz: Бапты жою

source: You cannot delete a root article.
kk_kz: Сіз түбір бапты жоя алмайсыз.

source: You cannot delete this article because you do not have permission to delete articles with children. Try to remove the children manually one-by-one.
kk_kz: Сіз осы бапты жоя алмайсыз, себебі сіздің тәуелділіктері бар баптарды жоюға құқығыңыз жоқ. Еншілес баптарды бірінен соң бірін қолмен жоюға әрекет етіп көріңіз.

source: You are deleting an article. This means that its children will be deleted as well. If you choose to purge, children will also be purged!
kk_kz: Сіз бапты жоюдасыз. Бұл еншілес баптардың да жойылатындығын білдіреді. Егер сіз жоюды таңдасаңыз, еншілес баптар да жойылатын болады!

source: Articles that will be deleted
kk_kz: Жойылатын баптар

source: ...and more!
kk_kz: ...және көптеген басқа!

source: You are deleting an article. Please confirm.
kk_kz: Сіз бапты жойғыңыз келеді. Растаңыз.

source: Edit
kk_kz: Редакциялау

source: Save changes
kk_kz: Өзгерістерді сақтау

source: Close
kk_kz: Жабу

source: Wiki Preview
kk_kz: Викиді Алдын ала Қарау

source: Back to editor
kk_kz: Редакторға оралу

source: History
kk_kz: Тарих

source: Click each revision to see a list of edited lines. Click the Preview button to see how the article looked at this stage. At the bottom of this page, you can change to a particular revision or merge an old revision with the current one.
kk_kz: Әрбір ревизияны басу онда өзгертілген жолдар тізімін шақырады. Баптың ағымдағы түрін көру үшін «Алдын ала қарау»-ды басыңыз. Беттің төменгі бөлігінде сіз белгілі бір ревизияны жүктей немесе көне нұсқаны жаңасымен біріктіре аласыз.

source: (no log message)
kk_kz: (лог-хабарлар жоқ)

source: Preview this revision
kk_kz: Ревизияны алдын ала қарау

source: Auto log:
kk_kz: Автоматты журнал:

source: Change
kk_kz: Өзгерту

source: Merge selected with current...
kk_kz: Таңдалғанды ағымдағымен біріктіру...

source: Switch to selected version
kk_kz: Таңдалған нұсқаға өту

source: Wiki Revision Preview
kk_kz: Вики бетіндегі Түзетулерді Алдын ала Қарау

source: Back to history view
kk_kz: Қарау тарихына оралу

source: Switch to this version
kk_kz: Осы нұсқаға өту

source: Merge Revision
kk_kz: Түзетулерді біріктіру

source: Merge with current
kk_kz: Ағымдағымен біріктіру

source: When you merge a revision with the current, all data will be retained from both versions and merged at its approximate location from each revision.
kk_kz: Ревизия ағымдағымен қосылған кезде екі нұсқаның барлық деректері әрбір ревизияның шамамен орналасқан орнында сақталатын және біріктірілетін болады

source: After this, it's important to do a manual review.
kk_kz: Осыдан кейін қолмен тексеруді жүргізген маңызды.

source: Create new merged version
kk_kz: Жаңа біріктірілген нұсқаны құру

source: Previewing revision:
kk_kz: Ревизияны алдын ала қарау

source: Previewing a merge between two revisions:
kk_kz: Екі нұсқаның қосылуын алдын ала қарау:

source: This revision has been deleted.
kk_kz: Осы нұсқа жойылған болатын.

source: Restoring to this revision will mark the article as deleted.
kk_kz: Егер осы нұсқаға шегіну жүргізілсе, бап жойылған ретінде белгіленетін болады.

source: You need to <a href="%(login_url)s">log in</a> or <a href="%(signup_url)s">sign up</a> to use this function.
kk_kz: Осы функцияны пайдалану үшін сізге <a href="%(login_url)s">кіру</a> немесе <a href="%(signup_url)s">тіркелу</a>керек.

source: You need to log in or sign up to use this function.
kk_kz: Осы функцияны пайдалану үшін Сізге кіру немесе тіркелу керек.

source: Wiki Cheatsheet
kk_kz: Викиді Редакциялау бойынша жадынама

source: Wiki Syntax Help
kk_kz: Вики-синтакспен көмек

source: This wiki uses <strong>Markdown</strong> for styling. There are several useful guides online. See any of the links below for in-depth details:
kk_kz: Осы вики-бет <strong>Markdown</strong>форматтауды пайдаланады. Интернетте бірнеше пайдалы басшылықтар бар. Егер сіз жай-жапсарын білгіңіз келсе, төменде келтірілген сілтемелердің кез келгенін қараңыз:

source: Markdown: Basics
kk_kz: Маркдаун: негіздер

source: Quick Markdown Syntax Guide
kk_kz: Markdown синтаксисі бойынша жылдам басшылық

source: Miniature Markdown Guide
kk_kz: Markdown бойынша мини-басшылық

source: To create a new wiki article, create a link to it. Clicking the link gives you the creation page.
kk_kz: Жаңа вики-бапты құру үшін оған сілтеме құрыңыз. Бапты құру беті осы сілтеме бойынша ашылады.

source: [Article Name](wiki:ArticleName)
kk_kz: [Баптың Атауы](wiki:БаптыңАтауы)

source: edX Additions:
kk_kz: edX толықтырулар:

source: Math Expression
kk_kz: Математикалық Өрнек

source: Useful examples:
kk_kz: Пайдалы мысалдар:

source: Wikipedia
kk_kz: Википедия

source: edX Wiki
kk_kz: Вики edX

source: Huge Header
kk_kz: Үлкен тақырып

source: Smaller Header
kk_kz: Кіші тақырып

source: *emphasis* or _emphasis_
kk_kz: *бөліп көрсету* немесе _ бөліп көрсету _

source: **strong** or __strong__
kk_kz: ** қатты бөліп көрсету ** немесе __ қатты бөліп көрсету __

source: Unordered List
kk_kz: Ретке келтірілмеген тізім

source: Sub Item 1
kk_kz: Қосымша зат 1

source: Sub Item 2
kk_kz: Қосымша зат 2

source: Ordered
kk_kz: Ретке келтірілген

source: List
kk_kz: Тізім

source: Quotes
kk_kz: Дәйексөздер

source: Markdown syntax is allowed. See the %(start_link)scheatsheet%(end_link)s for help.
kk_kz: Маркдаун тілінің синтаксисін пайдалануға рұқсат етіледі. Анықтама үшін %(start_link)sеске түсірулерін%(end_link)sқараңыз.

source: Upload new file
kk_kz: Жаңа файлды жүктеу

source: Search and add file
kk_kz: Файлды іздеу және қосу

source: Upload File
kk_kz: Файлды жүктеу

source: Upload file
kk_kz: Файлды жүктеу

source: Search files and articles
kk_kz: Файлдар және баптар бойынша іздеу

source: You can reuse files from other articles. These files are subject to updates on other articles which may or may not be a good thing.
kk_kz: Сіз басқа баптардан алынған файлдарды пайдалана аласыз. Бұл файлдар басқа баптарда жаңартылуы мүмкін, бұл әрі жағымды, әрі жағымсыз жаңалық болуы мүмкін.

source: The following files are available for this article. Copy the markdown tag to directly refer to a file from the article text.
kk_kz: Осы бап үшін мынадай файлдар қол жетімді. Файлға тікелей сілтеме үшін бап мәтінен тэгилерді көшіріп алыңыз.

source: Markdown tag
kk_kz: Белгілеу тег маркдауны

source: Uploaded by
kk_kz: Жүктелді

source: Size
kk_kz: Мөлшері

source: File History
kk_kz: Файлдың тарихы

source: Detach
kk_kz: Ажыратып алу

source: Replace
kk_kz: Ауыстыру

source: Restore
kk_kz: Қалпына келтіру

source: anonymous (IP logged)
kk_kz: Аноним (IP-мекенжай жасырылған)

source: File history
kk_kz: Файл тарихы

source: revisions
kk_kz: ревизиялар

source: There are no attachments for this article.
kk_kz: Осы бап үшін қосымшалар жоқ.

source: Invalid course update id.
kk_kz: Курстың жаңарту сәйкестендіргіші дұрыс емес.

source: Course update not found.
kk_kz: Курстың жаңартуы табылмады.

source: GIT_REPO_EXPORT_DIR not set or path {0} doesn't exist, please create it, or configure a different path with GIT_REPO_EXPORT_DIR
kk_kz: GIT_REPO_EXPORT_DIR айнымалысының мәні анықталмады, не {0} каталогы жоқ. Оны құрыңыз не GIT_REPO_EXPORT_DIR айнымалысында басқа каталогты көрсетіңіз

source: Non writable git url provided. Expecting something like: git@github.com:mitocw/edx4edx_lite.git
kk_kz: git қоймасына қате сілтеме. Мынаған ұқсас нәрсе күтілуде: git@github.com:mitocw/edx4edx_lite.git

source: If using http urls, you must provide the username and password in the url. Similar to https://user:pass@github.com/user/course.
kk_kz: http көрсеткіштерін пайдаланған кезде, сіз сілтемеде пайдаланушының атын және парольді ұсынуыңыз тиіс, мысалы, https://user:pass@github.com/user/course.

source: Unable to determine branch, repo in detached HEAD mode
kk_kz: Тармақты сәйкестендіру мүмкін емес, қойма HEAD режимінен ажыратылған

source: Unable to update or clone git repository.
kk_kz: git қоймасын жаңарту немесе клондау мүмкін емес.

source: Unable to export course to xml.
kk_kz: Курсты xml форматына экспорттау мүмкін емес.

source: Unable to configure git username and password
kk_kz: git арналған пайдаланушының атын және парольді беру мүмкін емес

source: Unable to commit changes. This is usually because there are no changes to be committed
kk_kz: Өзгертулерді сақтау мүмкін емес. Бұл әдетте өзгертулер болмағандықтан туындайды.
