Repository: yyang/edx-platform
Catalog: conf/locale/*/LC_MESSAGES/djangojs.po
Languages: fi_fi

source: Error starting a task to rescore problem '<%= problem_id %>'. Make sure that the problem identifier is complete and correct.
fi_fi: Tapahtui virhe aloitettaessa prosessia tehtävän '<%= problem_id %>' arvosanan muuttamiseksi. Varmista, että tehtävän tunniste on kirjoitettu kokonaisuudessaan ja oikein.

source: Error listing task history for this student and problem.
fi_fi: Virhe listatessa toimintohistoriaa tälle opiskelijalle ja tehtävälle.

source: Task Type
fi_fi: Tehtävän tyyppi

source: Task inputs
fi_fi: Prosessin syöte

source: Task ID
fi_fi: Prosessin ID

source: Requester
fi_fi: Pyytäjä

source: Submitted
fi_fi: Palautettu

source: Duration (sec)
fi_fi: Kesto (s)

source: State
fi_fi: Tila

source: Task Status
fi_fi: Prosessin tila

source: Task Progress
fi_fi: Tehtävän edistyminen

source: Grades saved. Fetching the next submission to grade.
fi_fi: Arvosanat tallennettu. Haetaan seuraavaa palautusta arvosteltavaksi.

source: Problem Name
fi_fi: Ongelman nimi

source: Graded
fi_fi: Arvioitu

source: Available to Grade
fi_fi: Valmiina arviointia varten

source: Required
fi_fi: Vaadittu

source: Progress
fi_fi: Edistyminen

source: Back to problem list
fi_fi: Takaisin tehtävälistaan

source: Try loading again
fi_fi: Yritä ladata uudelleen

source: <%= num %> available
fi_fi: <%= num %> saatavissa

source: <%= num %> graded
fi_fi: <%= num %> arvosteltu

source: Re-check for submissions
fi_fi: Tarkasta palautukset uudelleen

source: System got into invalid state: <%= state %>
fi_fi: Järjestelmä joutui virheelliseen tilaan: <%= state %>

source: System got into invalid state for submission:
fi_fi: Järjestelmä joutui virheelliseen tilaan palautuksesta:

source: (Hide)
fi_fi: (piilota)

source: (Show)
fi_fi: (näytä)

source: Insert Hyperlink
fi_fi: Lisää linkki

source: "optional title"
fi_fi: "vaihtoehtoinen otsikko"

source: Insert Image (upload file or type url)
fi_fi: Lisää kuva (lataa tiedosto tai kirjoita url)

source: Markdown Editing Help
fi_fi: Markdown muokkauksen ohje

source: Bold (Ctrl+B)
fi_fi: Lihavointi (Ctrl+B)

source: Italic (Ctrl+I)
fi_fi: Kursivointi (Ctrl+I)

source: Hyperlink (Ctrl+L)
fi_fi: www-linkki (Ctrl+L)

source: Blockquote (Ctrl+Q)
fi_fi: Lohkolainaus (Ctrl+Q)

source: Code Sample (Ctrl+K)
fi_fi: Koodi esimerkki (Ctrl+K)

source: Image (Ctrl+G)
fi_fi: Kuva (Ctrl+G)

source: Numbered List (Ctrl+O)
fi_fi: Numeroitu lista (Ctrl+O)

source: Bulleted List (Ctrl+U)
fi_fi: Lista (Ctrl+U)

source: Heading (Ctrl+H)
fi_fi: Otsikko (Ctrl+H)

source: Horizontal Rule (Ctrl+R)
fi_fi: Vaakaviiva (Ctrl+R)

source: Undo (Ctrl+Z)
fi_fi: Kumoa (Ctrl+Z)

source: Redo (Ctrl+Y)
fi_fi: Tee uudestaan (Ctrl+Y)

source: Redo (Ctrl+Shift+Z)
fi_fi: Tee uudestaan (Ctrl+Shift+Z)

source: strong text
fi_fi: voimakas teksti

source: emphasized text
fi_fi: korostettu teksti

source: enter image description here
fi_fi: kuvan sanallinen kuvaus tähän

source: enter link description here
fi_fi: linkin kuvaus tähän

source: Blockquote
fi_fi: Lohkolainaus

source: enter code here
fi_fi: koodi tähän

source: List item
fi_fi: listan kohta

source: Heading
fi_fi: Otsikko

source: Unknown Error Occurred.
fi_fi: Tapahtui tuntematon virhe.

source: Successfully reset the attempts for user {user}
fi_fi: Yrityskertojen nollaus käyttäjälle {user} onnistui.

source: Failed to reset attempts.
fi_fi: Yrityskertojen nollaus epäonnistui.

source: Successfully deleted student state for user {user}
fi_fi: Opiskelijan tilan poistaminen onnistui käyttäjälle {user}.

source: Failed to delete student state.
fi_fi: Opiskelijan tilan poistaminen epäonnistui.

source: Successfully rescored problem for user {user}
fi_fi: Tehtävän arvostelun muuttaminen onnistui käyttäjälle {user}

source: Failed to rescore problem.
fi_fi: Tehtävän arvostelun muuttaminen epäonnistui.

source: Unable to retrieve data, please try again later.
fi_fi: Tiedon lataaminen epäonnistui. Yritä uudelleen myöhemmin.

source: %(num_students)s student opened Subsection
fi_fi: %(num_students)s opiskelija avasi aliosion

source: %(num_students)s student
fi_fi: %(num_students)s opiskelija

source: %(num_questions)s question
fi_fi: %(num_questions)s kysymys

source: Number of Students
fi_fi: Opiskelijoiden määrä

source: or
fi_fi: tai

source: Your file has been deleted.
fi_fi: Tiedostosi on poistettu.

source: Name
fi_fi: Nimi

source: Uploading…
fi_fi: Ladataan...

source: Choose File
fi_fi: Valitse tiedosto

source: Upload New File
fi_fi: Lataa uusi tiedosto

source: Load Another File
fi_fi: Lataa toinen tiedosto

source: Upload File
fi_fi: Lataa tiedosto

source: Editor
fi_fi: Editori

source: Settings
fi_fi: Asetukset

source: Save
fi_fi: Tallenna

source: Zoom In
fi_fi: Lähennä

source: Zoom Out
fi_fi: Loitonna

source: close
fi_fi: sulje

source: Replace
fi_fi: Korvaa

source: Previous
fi_fi: Edellinen

source: Next
fi_fi: Seuraava
